{
  "weather_details": {
    "18-10-2024": {
      "rainfall": 0,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 94,
      "rh_min": 53,
      "wind_speed": 2,
      "wind_direction": 129,
      "cloud_cover": 4
    },
    "19-10-2024": {
      "rainfall": 0,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 94,
      "rh_min": 53,
      "wind_speed": 2,
      "wind_direction": 129,
      "cloud_cover": 4
    },
    "20-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 56,
      "wind_speed": 2,
      "wind_direction": 127,
      "cloud_cover": 6
    },
    "21-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 54,
      "wind_speed": 2,
      "wind_direction": 117,
      "cloud_cover": 6
    },
    "22-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 90,
      "rh_min": 41,
      "wind_speed": 1,
      "wind_direction": 146,
      "cloud_cover": 5
    },
    "23-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 80,
      "rh_min": 41,
      "wind_speed": 1,
      "wind_direction": 297,
      "cloud_cover": 4
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "କପା",
    "ଓକ୍ରା",
    "କୋଲେ ଫସଲ",
    "ଆମ୍ବ",
    "ଗାଈ/ମଇଁଷି"
  ],
  "general_advisory": "ଆଗାମୀ ଦିନରେ ପାଗ ଶୁଖିଲା ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ କୃଷି କାର୍ଯ୍ଯ଼ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ ଇତ୍ଯ଼ାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ପାଇବା ପାଇଁ ସବୁଜ ପଶୁଖାଦ୍ଯ଼ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ନର୍ସରୀ ବୁଣିବା ଏବଂ କୋଲ୍ ଫସଲ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଶୀତ ଋତୁ ପନିପରିବା ରୋପଣ କରିବା ଆରମ୍ଭ କରିବା ଉଚିତ୍। ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍ ଥିବାରୁ କୃଷକମାନେ ଗୋଟିଏ ଜଳସେଚନ କରି ଧାନ କ୍ଷେତରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଆର୍ଦ୍ରତା ବଜାଯ଼ ରଖିବା ଉଚିତ।",
        "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନେ ସ୍ୱଚ୍ଛ ଏବଂ ଶାନ୍ତ ପାଣିପାଗ ସ୍ଥିତିରେ ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 05 ପ୍ରତିଶତ ଇସି, ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି, ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସସି, କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରିବା ଉଚିତ୍।",
        "ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% SC, ଟେଟ୍ରାନିଲିପ୍ରୋଲ 200 SC, କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 WG ସିଞ୍ଚନ କରିବା ଉଚିତ।"
      ]
    },
    "cotton": {
      "advisory": [
        "କପା ଫସଲରେ ବୋଲୱର୍ମ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ 10 ଲିଟର ପାଣିରେ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
        "ଫୁଲ ଫୁଟିବା ସମଯ଼ରେ କୃଷକମାନେ କୌଣସି ରାସାଯ଼ନିକ କୀଟନାଶକ ସିଞ୍ଚନ କରିବା ଉଚିତ ନୁହେଁ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଓକ୍ରାରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. ର ବିକଳ୍ପ ସ୍ପ୍ରେ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
      ]
    },
    "cole crop": {
      "advisory": [
        "ନର୍ସରୀ ଶଯ୍ୟାକୁ ଉପଯୁକ୍ତ ଆକାରରେ ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ ଏବଂ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
        "ଯେଉଁଠାରେ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଅଛି, ସେଠାରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ଜମିରେ ଫସଲ ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "mango": {
      "advisory": [
        "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ରୋଗାକ୍ରାନ୍ତ ଏବଂ ସଂକ୍ରମିତ ଶାଖା ଏବଂ ପତ୍ରର ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
        "ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, ଯଦି ପତ୍ର କାଟିବା ୱିଭିଲ ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ କୃଷକମାନେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରିବା ଉଚିତ୍ |"
      ]
    },
    "cow/buffalo": {
      "advisory": [
        "ପାଦ ଏବଂ ପାଟି ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ମଧ୍ୟରେ ଟୀକାକରଣ, କୃମି ନିରାକରଣ, ପାଟି ଏବଂ ପାଦକୁ ଜୀବାଣୁମୁକ୍ତ କରିବା, ପ୍ରଭାବିତ ପଶୁମାନଙ୍କୁ ଅଲଗା କରିବା ଏବଂ ଜଣେ ଯୋଗ୍ୟ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ ଅନ୍ତର୍ଭୁକ୍ତ |"
      ]
    }
  },
  "date": "18-10-2024"
}