{
  "weather_details": {
    "28-09-2024": {
      "rainfall": 5,
      "t_max": 30,
      "t_min": 24,
      "rh_max": 94,
      "rh_min": 71,
      "wind_speed": 7,
      "wind_direction": 159,
      "cloud_cover": 8
    },
    "29-09-2024": {
      "rainfall": 5,
      "t_max": 30,
      "t_min": 25,
      "rh_max": 87,
      "rh_min": 66,
      "wind_speed": 7,
      "wind_direction": 225,
      "cloud_cover": 6
    },
    "30-09-2024": {
      "rainfall": 2,
      "t_max": 31,
      "t_min": 25,
      "rh_max": 86,
      "rh_min": 62,
      "wind_speed": 8,
      "wind_direction": 225,
      "cloud_cover": 6
    },
    "01-10-2024": {
      "rainfall": 2,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 89,
      "rh_min": 64,
      "wind_speed": 9,
      "wind_direction": 238,
      "cloud_cover": 6
    },
    "02-10-2024": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 26,
      "rh_max": 89,
      "rh_min": 64,
      "wind_speed": 9,
      "wind_direction": 238,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "କପା",
    "ମକା",
    "ପନିପରିବା ଫସଲ",
    "ଆମ୍ବ",
    "ଗାଈ/ମଇଁଷି"
  ],
  "general_advisory": "ଜଳସେଚନ ତଥା ସିଞ୍ଚନ କାର୍ଯ୍ୟ ସମୟରେ କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଆଗାମୀ ଏକ କିମ୍ବା ଦୁଇ ଦିନ ମଧ୍ୟରେ କେଉଁଠି ନା କେଉଁଠି ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫଳ ବଗିଚା ଏବଂ ପନିପରିବା କ୍ଷେତରେ ଭଲ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଧାନ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ଫସଲରେ ବିଭିନ୍ନ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ନିୟମିତ ନିରୀକ୍ଷଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଫସଲରେ ନାଇଟ୍ରୋଜେନ୍ ସାରର ଅତ୍ୟଧିକ ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ।",
        "ଯଦି ବ୍ୟାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ଦେଖାଯାଏ ତେବେ ନାଇଟ୍ରୋଜେନ୍ ସାରର ଉପର ଡ୍ରେସିଂ ବନ୍ଦ କରନ୍ତୁ ଏବଂ ଅନ୍ୟ ନିର୍ଦ୍ଦିଷ୍ଟ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ | ସମ୍ଭବ ହେଲେ ପାଣି ନିଷ୍କାସନ କରନ୍ତୁ।"
      ]
    },
    "cotton": {
      "advisory": [
        "କପା ଫସଲରେ ଶୋଷକ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ଏବଂ ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରାସାଯ଼ନିକ କୀଟନାଶକକୁ ଏଡ଼ାଇବା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ।"
      ]
    },
    "maize": {
      "advisory": [
        "ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଯ଼ୁରିଆ ସାରର ଉପର ଡ୍ରେସିଂ।",
        "ମକା ଫସଲରେ ସେନା କୃମିର ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ।"
      ]
    },
    "vegetable crops": {
      "advisory": [
        "ବିଭିନ୍ନ ପନିପରିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ।",
        "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳର ଉପଯୁକ୍ତ ନିଷ୍କାସନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
      ]
    },
    "mango": {
      "advisory": [
        "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା।",
        "ଆମ୍ବ ବଗିଚାରେ କୀଟ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ।"
      ]
    },
    "cow/buffalo": {
      "advisory": [
        "ଗାଈ ଏବଂ ମଇଁଷିରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରନ୍ତୁ |",
        "ରୋଗକୁ ରୋକିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ଏବଂ ରକ୍ଷଣାବେକ୍ଷଣ ଅଭ୍ଯ଼ାସ।"
      ]
    }
  },
  "date": "27-09-2024"
}