{
  "weather_details": {
    "09-10-2024": {
      "rainfall": 5,
      "t_max": 33,
      "t_min": 26,
      "rh_max": 93,
      "rh_min": 61,
      "wind_speed": 10,
      "wind_direction": 225,
      "cloud_cover": 8
    },
    "10-10-2024": {
      "rainfall": 4,
      "t_max": 34,
      "t_min": 26,
      "rh_max": 89,
      "rh_min": 59,
      "wind_speed": 12,
      "wind_direction": 212,
      "cloud_cover": 7
    },
    "11-10-2024": {
      "rainfall": 4,
      "t_max": 34,
      "t_min": 26,
      "rh_max": 92,
      "rh_min": 53,
      "wind_speed": 12,
      "wind_direction": 214,
      "cloud_cover": 7
    },
    "12-10-2024": {
      "rainfall": 1,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 58,
      "wind_speed": 10,
      "wind_direction": 214,
      "cloud_cover": 6
    },
    "13-10-2024": {
      "rainfall": 2,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 62,
      "wind_speed": 7,
      "wind_direction": 225,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "ଆଖୁ",
    "ବାଇଗଣ",
    "ଓକ୍ରା",
    "କଦଳୀ",
    "ନଡ଼ିଆ",
    "ପେଁପେ"
  ],
  "general_advisory": "ନିଯ଼ମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ବିପିଏଚ ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ. ର ଜନସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖନ୍ତୁ। ଯଦି ଧାନ ଫସଲ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ତେବେ 17.5 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 12 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି./ଏକର ସୁପାରିଶ କରାଯାଇଥିବା ସାରର ଦ୍ୱିତୀଯ଼ ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ କ୍ଷେତରେ ଠିଆ ହୋଇଥିବା ଜଳ ବଜାଯ଼ ରଖନ୍ତୁ | ଆଶା କରାଯାଉଥିବା ବର୍ଷା କାରଣରୁ ଠିଆ ହୋଇଥିବା ଫସଲ ଏବଂ ପନିପରିବାକୁ ଆବଶ୍ଯ଼କ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ଜାରି ରଖନ୍ତୁ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ଯଦି ଧାନ ଫସଲ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ତେବେ 17.5 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 12 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି./ଏକର ସୁପାରିଶ କରାଯାଇଥିବା ସାରର ଦ୍ୱିତୀଯ଼ ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ କ୍ଷେତରେ ଠିଆ ହୋଇଥିବା ଜଳ ବଜାଯ଼ ରଖନ୍ତୁ |",
        "ପ୍ରଚଳିତ ଉଷ୍ମ ଏବଂ ଆର୍ଦ୍ର ପାଗ ଧାନରେ ସିଥ୍ ବ୍ଲାଇଟ୍ ଏବଂ ବିସ୍ଫୋରଣ ରୋଗର ଘଟଣା ବୃଦ୍ଧି କରିପାରେ, ତେଣୁ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ (ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି) @400g ଲିଟର ପାଣି |",
        "ଯଦି ବିଏଲବି ଘଟଣା ବୃଦ୍ଧି ପାଏ, ତେବେ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @200gm ଏକର ସହିତ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @500gm ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା ଏକର ପିଛା ଏମଓପି 12 କିଲୋଗ୍ରାମର ଅତିରିକ୍ତ ମାତ୍ରାର ମୃତ୍ତିକା ପ୍ରଯ଼ୋଗ ସୁପାରିଶ କରାଯାଏ।",
        "ଯଦି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି ପାଏ ତେବେ ନିଯ଼ମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ବିପିଏଚ ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ. ର ଜନସଂଖ୍ଯ଼ାକୁ ନିରୀକ୍ଷଣ କରନ୍ତୁ। ବିକଳ୍ପ ଭାବେ କ୍ଷେତକୁ ଶୁଖାଇବା ଏବଂ ଓଦା କରିବା ଏବଂ ନିମ୍ବ-ଆଧାରିତ ଫର୍ମୁଲେସନ 1500 ପିପିଏମ (ଏକର ପିଛା 600 ମିଲି) ରେ ପତ୍ରପତ୍ରିକା ପ୍ରଯ଼ୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
        "ନିୟମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ଡବ୍ଲୁ. ବି. ପି. ଏଚ୍. ଏବଂ ବି. ପି. ଏଚ୍. ର ଜନସଂଖ୍ୟା ସ୍ତର ଉପରେ ନଜର ରଖନ୍ତୁ।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଆଖୁରେ ମିଳି ବଗ ଏବଂ ସ୍କେଲ୍ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ | ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, Thiamethoxam@80g ଏକର ଏବଂ ଲାମ୍ବଡା ସାଯ଼ାହାଲୋଥ୍ରିନ୍ @4.9CS @250ml ଏକରରେ ସିଞ୍ଚନ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବାଇଗଣରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି କୀଟପତଙ୍ଗ ଇ. ଟି. ଏଲ୍. ଜାରି ରଖେ, ତେବେ 15 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପିନେଟୁରାମ୍ @<ଆଇ. ଡି. 1> <ଆଇ. ଡି. 2> ମିଲି/ଏକର ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ <ଆଇ. ଡି. 3> ଗ୍ରାମ୍/ଏକରର ବିକଳ୍ପ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଓକ୍ରାରେ ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, (ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) @400g ଏକର ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "bittergourd": {
      "advisory": [
        "କଦଳୀରେ ଡାଉନ୍ ଫଙ୍ଗୁକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @100ml ଏକର ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "coconut": {
      "advisory": [
        "ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖି ଲାଲ ପାମ୍ ୱିଭିଲ ଏବଂ ଗଣ୍ଡା ଭୃଣର କାର୍ଯ୍ଯ଼କଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ | ଗଣ୍ଡାର ଭୃଣର ବିକାଶଶୀଳ ପର୍ଯ୍ଯ଼ାଯ଼କୁ ମାରିବା ପାଇଁ ନିକଟସ୍ଥ ସାର ଗର୍ତ୍ତରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ @1.2ml/litre ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "papaya": {
      "advisory": [
        "ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟଫ୍ଲାଇ) କୁ ଫାନ୍ଦରେ ପକାଇବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ନିମ୍ବ ତେଲ ପ୍ରସ୍ତୁତିର ବିକଳ୍ପ ଭାବେ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ସିଞ୍ଚନ ଏବଂ ଧଳା ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫ୍ଲୋନିକାମିଡ 50ଡବ୍ଲ୍ଯ଼ୁଜି @0.3g/litre ସିଞ୍ଚନ କରନ୍ତୁ।"
      ]
    }
  },
  "date": "08-10-2024"
}