{
  "weather_details": {
    "28-09-2024": {
      "rainfall": 15,
      "t_max": 32,
      "t_min": 24,
      "rh_max": 95,
      "rh_min": 75,
      "wind_speed": 10,
      "wind_direction": 167,
      "cloud_cover": 8
    },
    "29-09-2024": {
      "rainfall": 5,
      "t_max": 32,
      "t_min": 24,
      "rh_max": 92,
      "rh_min": 65,
      "wind_speed": 9,
      "wind_direction": 202,
      "cloud_cover": 7
    },
    "30-09-2024": {
      "rainfall": 3,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 61,
      "wind_speed": 9,
      "wind_direction": 243,
      "cloud_cover": 5
    },
    "01-10-2024": {
      "rainfall": 5,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 94,
      "rh_min": 63,
      "wind_speed": 12,
      "wind_direction": 248,
      "cloud_cover": 6
    },
    "02-10-2024": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 87,
      "rh_min": 66,
      "wind_speed": 11,
      "wind_direction": 243,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଧାନ।",
    "ମକା",
    "ଆଖୁ",
    "ଚିନାବାଦାମ",
    "ତିଲ।",
    "କାକୁଡ଼ି",
    "ବାଇଗଣ",
    "ଟମାଟୋ",
    "ଲଙ୍କା",
    "ଓକ୍ରା",
    "ପଶୁପାଳନ",
    "ମତ୍ସ୍ଯ଼ଚାଷ"
  ],
  "general_advisory": "ନଳକୂପ ଖୋଲା ରଖି ଠିଆ ହୋଇଥିବା ଫସଲରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ସାର ପ୍ରୟୋଗ ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ଜାରି ରଖନ୍ତୁ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପାଇଁ ଉପଯୁକ୍ତ କ୍ଷେତ୍ର ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ସେହି ଅନୁଯାୟୀ ପଦକ୍ଷେପ ନିଅନ୍ତୁ |",
  "crops_data": {
    "paddy": {
      "advisory": [
        "ଯଦି ବିସ୍ଫୋରଣ ଜନିତ ରୋଗ ଦେଖାଯାଏ, ତେବେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ଆଗାଛାକୁ ବାହାର କରି କ୍ଷେତକୁ ସଫା ରଖନ୍ତୁ। ଟ୍ରାଇକୋଡର୍ମାଭିରିଡିର ପତ୍ରପତ୍ରିକା ସ୍ପ୍ରେ 4 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ। ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ହେକ୍ଟର ପିଛା 400 ମିଲି. ରେ ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକୋନାଜୋଲ + ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ମିଲି. ରେ ଟେବୁକୋନାଜୋଲ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ + 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @80 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଧାନରେ ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ପାଇଁ ଅନୁକୂଳ | ଏହାକୁ ରାସାୟନିକ ଭାବରେ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 53.8% DF @600 ଗ୍ରାମ୍/ଏକର କିମ୍ବା 200 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ କପର୍ ଅକ୍ସି କ୍ଲୋରାଇଡ୍ 50% WP @600 ଗ୍ରାମ୍/ଏକର ସହିତ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "maize": {
      "advisory": [
        "ଶୁଖିଲା ଋତୁ ପରେ ବର୍ଷା ମକା ଉପରେ କୃମିର ଆକ୍ରମଣକୁ ବୃଦ୍ଧି କରିପାରେ। କୀଟ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ବିଉଭେରିଆ ବାସିଆନାକୁ ଏକର ପିଛା 200 ଗ୍ରାମ ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାଯ଼ନିକ ଭାବରେ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ଏସ୍. ଜି. @80 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @100 କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନା ପାଇଁ ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଜୈବିକ ବ୍ୟବହାର ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲୋନିସ୍ କାର୍ଡ ପ୍ରତି ଏକର ପିଛା 6 ଥର ସାପ୍ତାହିକ ବ୍ୟବଧାନରେ ପ୍ରତ୍ୟେକ କାର୍ଡକୁ ଦିଆଯାଇଥିବା ଛିଦ୍ରରେ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ବ୍ୟବହାର କରନ୍ତୁ।",
        "ଏହି କୀଟକୁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 600-ମିଲିମିଟର ଫିପ୍ରୋନିଲ୍ କିମ୍ବା ଏକର ପିଛା 400-ମିଲିମିଟର ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା ଏକର ପିଛା 80-ମିଲିମିଟର କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 4 କି. ଗ୍ରା. କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.40 ଜିଆର. 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହା ପରିବର୍ତ୍ତେ, ଆପଣ 8 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶ୍ରଣ କରି କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କିଲୋଗ୍ରାମ/ଏକର ମଧ୍ଯ଼ ପ୍ରଯ଼ୋଗ କରିପାରିବେ।"
      ]
    },
    "groundnut": {
      "advisory": [
        "ତମାଖୁ କ୍ଯ଼ାଟର୍ପିଲର କୀଟକୁ ଜୈବିକ ଭାବରେ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 6 @ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ପୋଡୋଲୁର ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଲାଇଟ୍ ଟ୍ରାପ୍ @8 ନମ୍ବର ସ୍ଥାପନ କରନ୍ତୁ। ବ୍ଯ଼ାସିଲସ୍ ଥୁରିଙ୍ଗେନେସିସ୍ @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା @500 ଗ୍ରାମ୍/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏକରରେ ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "sesame": {
      "advisory": [
        "ବର୍ଷା ପରେ ତିଲ ଫସଲରେ ଲିଫ୍ ୱେବର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଲିଫ୍ ୱେବର୍ ପରିଚାଳନା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cucurbits": {
      "advisory": [
        "ବର୍ଷା ପରେ କାକୁଡ଼ି ପନିପରିବାରେ ପାଉଡର ମାଇଲ୍ଡ୍ୟୁ ରୋଗର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। କାକୁଡ଼ିରେ ଏହି ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 4.8% + କ୍ଲୋରୋଥାଲୋନିଲ୍ 40% ଏସ୍. ସି. @3 ମିଲି/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12% + ମାନକୋଜେବ୍ 63% ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବର୍ଷା ପରେ ବାଇଗଣ, ଟମାଟୋ ଏବଂ ଲଙ୍କା ପରି ସୋଲାନାସିୟସ୍ ପନିପରିବାରେ ଫୁସାରିୟମ୍ ୱିଲ୍ଟ ରୋଗ ଦେଖାଯାଇପାରେ | ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଉପୁଡ଼ନ୍ତୁ ଏବଂ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ ଦରରେ ମେଟାଲ୍ୟାକ୍ସିଲ 8% + ମାନକୋଜେବ 64% ଡବ୍ଲ୍ୟୁ. ପି. ଭିଜାଇ ଦିଅନ୍ତୁ।",
        "ନର୍ସରୀରେ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମା ହାର୍ଜିଆନମ୍ 1 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଭିରିଡେ 1.5 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @50 ଗ୍ରାମ/ବର୍ଗ ମିଟର କ୍ଷେତ୍ର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ବର୍ଷା ପରେ ବାଇଗଣ, ଟମାଟୋ ଏବଂ ଲଙ୍କା ପରି ସୋଲାନାସିଯ଼ସ୍ ପନିପରିବାରେ ଫୁସାରିଯ଼ମ୍ ୱିଲ୍ଟ ରୋଗ ଦେଖାଯାଇପାରେ | ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଉପୁଡ଼ନ୍ତୁ ଏବଂ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟାଲ୍ଯ଼ାକ୍ସିଲ 8% + ମାନକୋଜେବ 64% ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲିଟର ପିଛା 2 ଗ୍ରାମ ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।",
        "ନର୍ସରୀରେ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମା ହାର୍ଜିଆନମ୍ 1 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଭିରିଡେ 1.5 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @50 ଗ୍ରାମ/ବର୍ଗ ମିଟର କ୍ଷେତ୍ର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
      ]
    },
    "chilli": {
      "advisory": [
        "ବର୍ଷା ପରେ ବାଇଗଣ, ଟମାଟୋ ଏବଂ ଲଙ୍କା ପରି ସୋଲାନାସିଯ଼ସ୍ ପନିପରିବାରେ ଫୁସାରିଯ଼ମ୍ ୱିଲ୍ଟ ରୋଗ ଦେଖାଯାଇପାରେ | ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଉପୁଡ଼ନ୍ତୁ ଏବଂ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟାଲ୍ଯ଼ାକ୍ସିଲ 8% + ମାନକୋଜେବ 64% ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲିଟର ପିଛା 2 ଗ୍ରାମ ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।",
        "ନର୍ସରୀରେ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମା ହାର୍ଜିଆନମ୍ 1 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଭିରିଡେ 1.5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @50 ଗ୍ରାମ/ବର୍ଗ ମିଟର କ୍ଷେତ୍ର ପ୍ରୟୋଗ କରନ୍ତୁ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଓକ୍ରାରେ ହଳଦିଆ ନିରର୍ଥକ ମୋଜାଇକ ରୋଗର ଭେକ୍ଟରକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10-12 DAS ରୁ ଆରମ୍ଭ କରି 8-10 ହଳଦିଆ ଷ୍ଟିକି ଟ୍ରାପ୍ଗୁଡ଼ିକର ସଂଖ୍ଯ଼ା ସ୍ଥାପନ କରନ୍ତୁ। ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @600-ମିଲି/ଏକର, ଏହାକୁ 15-ଡିଏଏସରୁ ଆରମ୍ଭ କରି 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "ପଶୁମାନଙ୍କୁ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ୟାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।"
      ]
    },
    "fishery": {
      "advisory": [
        "ବହୁବର୍ଷଜୀବୀ ପୋଖରୀରେ ଶିକାରୀ ଏବଂ ଆଗାଛା ମାଛମାନଙ୍କୁ ମାରିବାକୁ 1 ମିଟର ଗଭୀର ଜଳ ସହିତ ମହୁଆ ତୈଳ କେକ୍ @2.5t/ha ଲଗାନ୍ତୁ | ଯଦି ମାଛରେ 'ଇ. ୟୁ. ଏସ୍.' ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଏକ ଏକର ପୋଖରୀରେ 400 ଲିଟର ପାଣି ସହିତ 'ସିଫ୍ୟାକ୍ସ' @400 ମିଲି ମିଶାଇ ଲଗାନ୍ତୁ।"
      ]
    }
  },
  "date": "27-09-2024"
}