{
  "weather_details": {
    "20.09.2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 85,
      "rh_min": 60,
      "wind_speed": 10,
      "wind_direction": 120,
      "cloud_cover": 3
    }
  },
  "names_of_crops": [
    "ଅରହର",
    "ପନିପରିବା",
    "ଓକ୍ରା",
    "କାକୁଡ଼ି",
    "କୋଇଲା ଫସଲ",
    "ପଶୁପାଳନ"
  ],
  "general_advisory": "ବର୍ଷା ଋତୁରେ ପଶୁମାନଙ୍କ ଉପରେ ନିୟମିତ ସ୍ୱାସ୍ଥ୍ୟ ଯାଞ୍ଚ କରନ୍ତୁ ଯାହା ଦ୍ୱାରା ଚାପ କିମ୍ବା ଅସୁସ୍ଥତାର କୌଣସି ଲକ୍ଷଣ ଶୀଘ୍ର ଚିହ୍ନଟ କରାଯାଇପାରିବ। ଏକ ସ୍ୱଚ୍ଛ ଏବଂ ପର୍ଯ୍ୟାପ୍ତ ଜଳ ଯୋଗାଣ ସୁନିଶ୍ଚିତ କରନ୍ତୁ, ଅଟକି ରହିଥିବା ଜଳରୁ ଦୂରେଇ ରୁହନ୍ତୁ ଯାହା ଜୀବାଣୁ ପାଇଁ ଏକ ପ୍ରଜନନ କ୍ଷେତ୍ର ହୋଇପାରେ | ପ୍ରଦୂଷଣ ପାଇଁ ନିୟମିତ ଭାବେ ଜଳ ଉତ୍ସଗୁଡ଼ିକୁ ଯାଞ୍ଚ କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ସ୍ୱଚ୍ଛତା ବଜାୟ ରଖନ୍ତୁ।",
  "crops_data": {
    "arhar": {
      "advisory": [
        "ଫୋଡ଼ା ବିଟଲ ଫୁଲ ଖାଆନ୍ତି ଏବଂ ଶୁଖିଲା ଶୁଆ ସଂଖ୍ଯ଼ା ହ୍ରାସ କରନ୍ତି, ଯାହା ଫସଲ ଉତ୍ପାଦନକୁ ପ୍ରଭାବିତ କରେ | ପରିଚାଳନା ପାଇଁ, ହାତ ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଗ୍ରହ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ କିରୋସିନିରେ ରଖନ୍ତୁ କିମ୍ବା ମାଟି ସହିତ ଏକ ଗର୍ତ୍ତରେ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
      ]
    },
    "vegetables": {
      "advisory": [
        "ବର୍ତ୍ତମାନର ପାଣିପାଗ କାରଣରୁ ପନିପରିବାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ଭଳି କୀଟ ଶୋଷିବାର ସମ୍ଭାବନା ରହିଛି। କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକକୁ ଶୀଘ୍ର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ରାସାୟନିକ ସ୍ପ୍ରେ ବିକଳ୍ପଗୁଡ଼ିକ ମଧ୍ୟରେ ଥାୟାମେଥୋକ୍ସାମ୍, ଏସିଟାମିପ୍ରିଡ୍, ଫେନୋବୁକାର୍ବ, କିମ୍ବା ଟଲ୍ଫେନପାଇରାଡ୍ ଅନ୍ତର୍ଭୁକ୍ତ |"
      ]
    },
    "okra": {
      "advisory": [
        "ଓକ୍ରାରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା ସ୍ପିନୋସାଡ୍ ଲଗାନ୍ତୁ |"
      ]
    },
    "cucurbits": {
      "advisory": [
        "କୁକୁର୍ବିଟ୍ ଫସଲରେ ରେଡ୍ ପମ୍ପକିନ୍ ବିଟଲ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍, କିମ୍ବା କ୍ଲୋରପାଇରିଫୋସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |"
      ]
    },
    "cole crops": {
      "advisory": [
        "ଫୁଲକୋବି, ବନ୍ଧାକୋବି ଏବଂ ବ୍ରୋକୋଲି ପାଇଁ, ଉନ୍ନତ କିସମ ଏବଂ ହାଇବ୍ରିଡ୍ ମଞ୍ଜି ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ବୀଜ ହାର ବ୍ଯ଼ବହାର କରନ୍ତୁ | ଉପଯୁକ୍ତ ଆକାର ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ କମ୍ପୋଷ୍ଟ ଲଗାନ୍ତୁ |"
      ]
    },
    "livestock": {
      "advisory": [
        "ବର୍ଷା ଋତୁରେ ପଶୁମାନଙ୍କ ଉପରେ ନିଯ଼ମିତ ସ୍ୱାସ୍ଥ୍ଯ଼ ଯାଞ୍ଚ କରନ୍ତୁ ଯାହା ଦ୍ୱାରା ଚାପ କିମ୍ବା ଅସୁସ୍ଥତାର କୌଣସି ଲକ୍ଷଣ ଶୀଘ୍ର ଚିହ୍ନଟ କରାଯାଇପାରିବ। ଏକ ସ୍ୱଚ୍ଛ ଏବଂ ପର୍ଯ୍ଯ଼ାପ୍ତ ଜଳ ଯୋଗାଣ ସୁନିଶ୍ଚିତ କରନ୍ତୁ, ଅଟକି ରହିଥିବା ଜଳରୁ ଦୂରେଇ ରୁହନ୍ତୁ ଯାହା ଜୀବାଣୁ ପାଇଁ ଏକ ପ୍ରଜନନ କ୍ଷେତ୍ର ହୋଇପାରେ | ପ୍ରଦୂଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବେ ଜଳ ଉତ୍ସଗୁଡ଼ିକୁ ଯାଞ୍ଚ କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ସ୍ୱଚ୍ଛତା ବଜାଯ଼ ରଖନ୍ତୁ।"
      ]
    }
  },
  "date": "20-09-2024"
}