{
  "weather_details": {
    "10.09.2024": {
      "rainfall": 0,
      "t_max": 32,
      "t_min": 25,
      "rh_max": 85,
      "rh_min": 65,
      "wind_speed": 10,
      "wind_direction": 140,
      "cloud_cover": 3
    }
  },
  "names_of_crops": [
    "ଅରହର",
    "ତିଲ।",
    "ମାଟି ବାଦାମ",
    "ବାଇଗଣ",
    "ଟମାଟୋ",
    "ଲଙ୍କା",
    "କାକୁଡ଼ି",
    "କଦଳୀ",
    "ପେଁପେ",
    "କଦଳୀ",
    "ମତ୍ସ୍ୟଚାଷ"
  ],
  "general_advisory": "ପ୍ରବଳ ବର୍ଷା ପରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ବିରୁଦ୍ଧରେ ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ନେବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ଏବଂ ଠିକ୍ ସମୟରେ ସାର ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
  "crops_data": {
    "arhar": {
      "advisory": [
        "ଫୋଡ଼ା ବିଟଲ ଫୁଲକୁ ଖାଇଥାଏ ଏବଂ ଶୁଖିଲା ଶୁଆ ଗୁଡ଼ିକର ସଂଖ୍ୟାକୁ ହ୍ରାସ କରିଥାଏ। ହାତ ଦ୍ୱାରା ସଂଗ୍ରହ ଏବଂ କୀଟପତଙ୍ଗ ଅପସାରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "sesame": {
      "advisory": [
        "ତିଲ ଫସଲରେ ଗୁଲ ମାଛି ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ସଂକ୍ରମିତ କ୍ୟାପସୁଲ ବାହାର କରି ନିମ ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "ground nut": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ପରେ ଷ୍ଟେମ ପଚିଯିବାର ସମ୍ଭାବନା। ଭାଲିଡାମାଇସିନ୍ କିମ୍ବା କ୍ୟାପଟାନ + ହେକ୍ସାକୋନାଜୋଲ କବକନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ପରେ ଜଳୀୟ ଅଂଶ ଓ ମୂଳ କ୍ଷୟ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ଏବଂ ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ ଦ୍ରବଣ ସହିତ ମୂଳ କ୍ଷେତ୍ରକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ପରେ ଜଳୀୟ ଅଂଶ ଓ ମୂଳ କ୍ଷୟ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ଏବଂ ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ ଦ୍ରବଣ ସହିତ ମୂଳ କ୍ଷେତ୍ରକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "chilli": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ପରେ ଜଳୀୟ ଅଂଶ ଓ ମୂଳ କ୍ଷୟ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ଏବଂ ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ ଦ୍ରବଣ ସହିତ ମୂଳ କ୍ଷେତ୍ରକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "cucurbits": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ପରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗର ଆଶଙ୍କା। ନିର୍ଦ୍ଦିଷ୍ଟ କବକନାଶକ ଦ୍ୱାରା ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
      ]
    },
    "cowpea": {
      "advisory": [
        "ଇମାମାକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ ଦ୍ୱାରା ଗ୍ରାମ୍ ପୋଡ୍ ବୋରର୍ ପରିଚାଳନା।"
      ]
    },
    "papaya": {
      "advisory": [
        "ଜଳ ନିଷ୍କାସନ ଏବଂ ଷ୍ଟାକିଂ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ନିର୍ଦ୍ଦିଷ୍ଟ କବକନାଶକ ଦ୍ୱାରା ପେଁପେ କ୍ରାଉନ୍ ସଙ୍କୁଚିତକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
      ]
    },
    "banana": {
      "advisory": [
        "ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ କରନ୍ତୁ ଏବଂ ବର୍ଷା ପରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା କଦଳୀକୁ ମାଟି କରନ୍ତୁ। ନିର୍ଦ୍ଦିଷ୍ଟ କବକନାଶକ ଦ୍ୱାରା ସିଗାଟୋକା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
      ]
    },
    "fishery": {
      "advisory": [
        "ପ୍ରବଳ ବର୍ଷା ଫଳରେ ପୋଖରୀରେ ଜଳର ଲବଣାକ୍ତତା ହ୍ରାସ ପାଇପାରେ। ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ଜୀବାଣୁନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।"
      ]
    }
  },
  "date": "10-09-2024"
}