{
  "weather_details": {
    "2024-09-18": {
      "rainfall": 20,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 68,
      "wind_speed": 5,
      "wind_direction": 279,
      "cloud_cover": 8
    },
    "2024-09-19": {
      "rainfall": 15,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 66,
      "wind_speed": 3,
      "wind_direction": 202,
      "cloud_cover": 8
    },
    "2024-09-20": {
      "rainfall": 15,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 92,
      "rh_min": 74,
      "wind_speed": 3,
      "wind_direction": 135,
      "cloud_cover": 8
    },
    "2024-09-21": {
      "rainfall": 10,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 96,
      "rh_min": 67,
      "wind_speed": 5,
      "wind_direction": 90,
      "cloud_cover": 8
    },
    "2024-09-22": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 97,
      "rh_min": 63,
      "wind_speed": 5,
      "wind_direction": 112,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "ମକା",
    "କପା",
    "ବାଇଗଣ",
    "କଦଳୀ"
  ],
  "general_advisory": "ଭାରତୀଯ଼ ପାଣିପାଗ ବିଭାଗରୁ ମିଳିଥିବା ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ଶନିବାର ପର୍ଯ୍ଯ଼ନ୍ତ ଜିଲ୍ଲାରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସାଧାରଣତଃ ଆକାଶ ମେଘୁଆ ରହିବ। ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ପବନର ବେଗ ଘଣ୍ଟାପ୍ରତି 3ରୁ 5 କିଲୋମିଟର ମଧ୍ଯ଼ରେ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଦୈନିକ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଯଥାକ୍ରମେ 34°ସେ. ରୁ 35°ସେ. ଏବଂ 25°ସେ. ରୁ 26°ସେ. ମଧ୍ଯ଼ରେ ରହିପାରେ। ସକାଳ ଏବଂ ଅପରାହ୍ନରେ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଯଥାକ୍ରମେ 92 ରୁ 97 ପ୍ରତିଶତ ଏବଂ 63 ରୁ 74 ପ୍ରତିଶତ ମଧ୍ଯ଼ରେ ରହିପାରେ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ପ୍ରଚଳିତ ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ହେତୁ, ଫସଲରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ପରି କୀଟପତଙ୍ଗର ଆକ୍ରମଣ ବୃଦ୍ଧି ପାଇପାରେ |",
        "ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନାଃ ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @18.45-kg/ha କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଜିଆର @10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜି @15 କିଲୋଗ୍ରାମ/ହେକ୍ଟର 1:1 ଅନୁପାତରେ ବାଲି ସହିତ ମିଶ୍ରଣ କରି ପ୍ରୟୋଗ କରନ୍ତୁ।"
      ]
    },
    "maize": {
      "advisory": [
        "ଶରତ ସେନା କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200-ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାଯ଼ୋପେଷ୍ଟିସାଇଡ୍ ବେଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ |"
      ]
    },
    "cotton": {
      "advisory": [
        "ଉଚ୍ଚ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ହେତୁ, କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି କୀଟ ଶୋଷିବାର ଘଟଣା ରିପୋର୍ଟ ହୋଇଛି |",
        "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ ପାଇଁ ଯାଆନ୍ତୁ |",
        "ଯଦି ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ କପା ଫସଲ ପରି ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ହୁଏ, ତେବେ 200-ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ-ଆଧାରିତ କୀଟନାଶକ (ନିମ ତେଲ 1500 ପିପିଏମ) @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବା ଠାରୁ ଆରମ୍ଭ କରି ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ଯ଼ନ୍ତ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳେ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବେଗୁନରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ |",
        "କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ |",
        "ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
      ]
    },
    "banana": {
      "advisory": [
        "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କଦଳୀ ବଗିଚାରେ ଏକର ପିଛା 10ରେ କସମୋଲୁର ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ।",
        "ରୋପଣ ପୂର୍ବରୁ କଦଳୀ କାଣ୍ଡକୁ 30 ମିନିଟ୍ ପାଇଁ ଉଷୁମ ପାଣିରେ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ।"
      ]
    }
  },
  "date": "17-09-2024"
}