{
  "weather_details": {
    "2024-09-07": {
      "rainfall": 10,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 67,
      "wind_speed": 5,
      "wind_direction": 288,
      "cloud_cover": 7
    },
    "2024-09-08": {
      "rainfall": 15,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 68,
      "wind_speed": 6,
      "wind_direction": 288,
      "cloud_cover": 8
    },
    "2024-09-09": {
      "rainfall": 25,
      "t_max": 31,
      "t_min": 24,
      "rh_max": 95,
      "rh_min": 76,
      "wind_speed": 7,
      "wind_direction": 291,
      "cloud_cover": 8
    },
    "2024-09-10": {
      "rainfall": 15,
      "t_max": 33,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 76,
      "wind_speed": 8,
      "wind_direction": 292,
      "cloud_cover": 8
    },
    "2024-09-11": {
      "rainfall": 10,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 69,
      "wind_speed": 10,
      "wind_direction": 291,
      "cloud_cover": 7
    }
  },
  "names_of_crops": [
    "ମକା",
    "ଚାଉଳ",
    "ଫିଙ୍ଗର ମିଲେଟ୍",
    "କପା",
    "ପେଁପେ",
    "ବାଇଗଣ",
    "ଗାଈ।",
    "ସାଧାରଣ ମାଛ",
    "ଚିକେନ୍"
  ],
  "general_advisory": "ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଆକାଶ ସାଧାରଣତଃ ମେଘୁଆ ରହିବା ସହିତ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ତାପମାତ୍ରା ସୀମା 31°ସେ. ରୁ 35°ସେ. ଏବଂ 24°ସେ. ରୁ 25°ସେ. ମଧ୍ୟରେ ଭିନ୍ନ ଭିନ୍ନ ହୋଇପାରେ। ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 67 ପ୍ରତିଶତରୁ 95 ପ୍ରତିଶତ ମଧ୍ୟରେ ରହିବ। ସାର ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପଦାର୍ଥର ପ୍ରୟୋଗ ବନ୍ଦ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
  "crops_data": {
    "maize": {
      "advisory": [
        "ଶରତ ସେନା କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200-ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାୟୋପେଷ୍ଟିସାଇଡ୍ ବେଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ରର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ, ଯାହା କ୍ୟାଟର୍ପିଲରମାନଙ୍କୁ ପତ୍ରକୁ ଖାଇବାକୁ ଦେବାରୁ ରୋକିଥାଏ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "rice": {
      "advisory": [
        "ବିସ୍ଫୋରଣ ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟେବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "finger millet": {
      "advisory": [
        "ଗୋଲାପୀ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନାଃ ଶୀଘ୍ର ଚାରା ରୋପଣ, ପ୍ରଭାବିତ ବୁଦା ହଟାଇବା ଏବଂ ନଷ୍ଟ କରିବା, ଫାନ୍ଦ ଏବଂ ଲାଠି ବ୍ୟବହାର କରିବା, ଲାଭଦାୟକ କୀଟପତଙ୍ଗ ଏବଂ ପ୍ରାକୃତିକ ସ୍ପ୍ରେ ପ୍ରୟୋଗ କରିବା।"
      ]
    },
    "cotton": {
      "advisory": [
        "ଉଚ୍ଚ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ହେତୁ, କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି କୀଟ ଶୋଷିବାର ଘଟଣା ରିପୋର୍ଟ ହୋଇଛି | ନିୟମିତ ନିରୀକ୍ଷଣ ଏବଂ ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ ସୁପାରିଶ କରାଯାଏ |"
      ]
    },
    "papaya": {
      "advisory": [
        "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ, ମିଲି ବଗ୍ର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରଭାବିତ ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ, ଫାନ୍ଦ ଲଗାନ୍ତୁ, ଏବଂ ବ୍ୟବଧାନରେ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସହିତ ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ବ୍ୟବହାର କରନ୍ତୁ |"
      ]
    },
    "cow": {
      "advisory": [
        "ଯେହେତୁ ବର୍ଷା ଦିନରେ ଘାସରେ ଆର୍ଦ୍ରତା ଅଧିକ ଥାଏ, ତେଣୁ ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ପର୍ଯ୍ୟାପ୍ତ ଶୁଖିଲା ପଦାର୍ଥ ଯୋଗାଇଥାଏ |"
      ]
    },
    "common fish": {
      "advisory": [
        "ଷ୍ଟକ୍ କରିବା ପରେ, ଉପଯୁକ୍ତ ଖାଦ୍ୟ ପ୍ରଦାନ କରନ୍ତୁ, ପିଏଚ୍ ଏବଂ ଜଳ ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ, ନିୟମିତ ଭାବରେ ପୋଖରୀ ଜଳ ଶୁଦ୍ଧ କରନ୍ତୁ |"
      ]
    },
    "chicken": {
      "advisory": [
        "ବାର୍ଡ ଫ୍ଲୁକୁ ରୋକିବା ପାଇଁ, ସ୍ୱଚ୍ଛତା ବଜାୟ ରଖନ୍ତୁ, ବାରମ୍ବାର ଖାଦ୍ୟ ଏବଂ ପାଣି ବଦଳାନ୍ତୁ, ଏବଂ ମୃତ ପକ୍ଷୀମାନଙ୍କୁ ସଠିକ୍ ଭାବରେ ନଷ୍ଟ କରନ୍ତୁ |"
      ]
    }
  },
  "date": "06-09-2024"
}