{
  "weather_details": {
    "2024-09-07": {
      "rainfall": 10,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 67,
      "wind_speed": 5,
      "wind_direction": 288,
      "cloud_cover": 7
    },
    "2024-09-08": {
      "rainfall": 15,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 68,
      "wind_speed": 6,
      "wind_direction": 288,
      "cloud_cover": 8
    },
    "2024-09-09": {
      "rainfall": 25,
      "t_max": 31,
      "t_min": 24,
      "rh_max": 95,
      "rh_min": 76,
      "wind_speed": 7,
      "wind_direction": 291,
      "cloud_cover": 8
    },
    "2024-09-10": {
      "rainfall": 15,
      "t_max": 33,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 76,
      "wind_speed": 8,
      "wind_direction": 292,
      "cloud_cover": 8
    },
    "2024-09-1": {
      "rainfall": 10,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 69,
      "wind_speed": 10,
      "wind_direction": 291,
      "cloud_cover": 7
    }
  },
  "names_of_crops": [
    "ମକା",
    "ଚାଉଳ",
    "ଫିଙ୍ଗର ମିଲେଟ୍",
    "କପା",
    "ପେଁପେ",
    "ବାଇଗଣ",
    "ଗାଈ।",
    "ସାଧାରଣ ମାଛ",
    "ଚିକେନ୍"
  ],
  "general_advisory": "ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଆକାଶ ସାଧାରଣତଃ ମେଘୁଆ ରହିବା ସହିତ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ତାପମାତ୍ରା ସର୍ବାଧିକ ପାଇଁ 31°ସେ. ରୁ 35°ସେ. ଏବଂ ସର୍ବନିମ୍ନ ପାଇଁ 24°ସେ. ରୁ 25°ସେ. ମଧ୍ୟରେ ରହିଥାଏ। ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସକାଳେ 90 ପ୍ରତିଶତରୁ 95 ପ୍ରତିଶତ ଏବଂ ଅପରାହ୍ନରେ 67 ପ୍ରତିଶତରୁ 76 ପ୍ରତିଶତ ମଧ୍ୟରେ ରହିଥାଏ।",
  "crops_data": {
    "maize": {
      "advisory": [
        "ପତନ ଆର୍ମିୱର୍ମ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ବାୟୋପେଷ୍ଟିସାଇଡ୍ ବେଉଭେରିଆ ବାସିଆନା କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଯେପରିକି ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍, ସ୍ପିନେଟୋରାମ୍, କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ବ୍ୟବହାର କରନ୍ତୁ |"
      ]
    },
    "rice": {
      "advisory": [
        "ବିସ୍ଫୋରଣ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ହେକ୍ସାକୋନାଜୋଲ, ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ, କିମ୍ବା ଟେବୁକୋନାଜୋଲ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "finger millet": {
      "advisory": [
        "ଗୋଲାପୀ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲୋନିସ୍ କାର୍ଡ, ବାସିଲସ୍ ଥୁରିଙ୍ଗିୟେନ୍ସିସ୍, କିମ୍ବା ମେଟାରିଜିୟମ୍ ଆନିସୋପିଲା ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "cotton": {
      "advisory": [
        "ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ସର ପରିଚାଳନା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ଫ୍ଲୋନିକାମିଡ୍, ଥାୟାମେଥୋକ୍ସାମ୍, କିମ୍ବା ଡାଇନୋଟେଫୁରାନ୍ ଭଳି ରାସାୟନିକ ପଦାର୍ଥ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "papaya": {
      "advisory": [
        "ଖାଦ୍ୟ ପୋକ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଏବଂ ଫଳଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ, ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ, ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍, କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍, କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ ପରି ବିକଳ୍ପ ରାସାୟନିକ ସ୍ପ୍ରେ ବ୍ୟବହାର କରନ୍ତୁ |"
      ]
    },
    "cow": {
      "advisory": [
        "ବର୍ଷା ଦିନରେ ଘାସରେ ଅଧିକ ଆର୍ଦ୍ରତା ଥିବାରୁ ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ଧ୍ୟାନ ଦିଅନ୍ତୁ।"
      ]
    },
    "common fish": {
      "advisory": [
        "ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଖାଇବାକୁ ଦିଅନ୍ତୁ, ଭିଟାମିନ୍ ଏବଂ ଖଣିଜ ମିଶ୍ରଣ ମିଶାନ୍ତୁ, ନିୟମିତ ଭାବରେ ପିଏଚ୍ ଏବଂ ଜଳ ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ, ପୋଖରୀ ଶୁଦ୍ଧିକରଣ ପାଇଁ ଚୂନ ଏବଂ ଗାଈ ଗୋବର ଲଗାନ୍ତୁ |"
      ]
    },
    "chicken": {
      "advisory": [
        "ସ୍ୱଚ୍ଛତା ବଜାୟ ରଖିବା, ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରିବା ଏବଂ ପ୍ରଭାବିତ ପକ୍ଷୀମାନଙ୍କର ଉପଯୁକ୍ତ ନିଷ୍କାସନ ଦ୍ୱାରା ବାର୍ଡ ଫ୍ଲୁକୁ ରୋକନ୍ତୁ |"
      ]
    }
  },
  "date": "06-09-2024"
}