{
  "weather_details": {
    "2024-10-19": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 97,
      "rh_min": 66,
      "wind_speed": 1,
      "wind_direction": 90,
      "cloud_cover": 6
    },
    "2024-10-20": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 97,
      "rh_min": 67,
      "wind_speed": 2,
      "wind_direction": 346,
      "cloud_cover": 8
    },
    "2024-10-21": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 96,
      "rh_min": 65,
      "wind_speed": 2,
      "wind_direction": 9,
      "cloud_cover": 8
    },
    "2024-10-22": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 53,
      "wind_speed": 3,
      "wind_direction": 14,
      "cloud_cover": 4
    },
    "2024-10-23": {
      "rainfall": 0,
      "t_max": 33,
      "t_min": 24,
      "rh_max": 84,
      "rh_min": 51,
      "wind_speed": 5,
      "wind_direction": 12,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "କପା",
    "ଫୁଲକୋବି",
    "ବାଇଗଣ",
    "ଫ୍ରେଞ୍ଚ ବିନ୍",
    "ଗାଈ।"
  ],
  "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 35.7 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 25.5 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 14.5 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଉଚ୍ଚଭୂମି/ମଧ୍ଯ଼ମ ଜମିରେ ଚିନାବାଦାମ, ଚଣା, ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ମିଠା ଆଳୁ ଏବଂ ତିଲ ଭଳି ରବି ଫସଲ ବୁଣିବା ପାଇଁ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଯଥେଷ୍ଟ। କୋଲ ଫସଲ (ବନ୍ଧାକୋବି, ବିଳମ୍ବିତ ଫୁଲକୋବି ଏବଂ ବ୍ରୋକୋଲି), ସୋଲାନାସିଯ଼ସ୍ ପନିପରିବା (ବାଇଗଣ, ଟମାଟୋ, ଲଙ୍କା ଏବଂ କ୍ଯ଼ାପ୍ସିକମ୍) ଭଳି ପନିପରିବା ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମଯ଼। ଗାଜର, ମୂଳା, ସୋରିଷ, ରସୁଣ, ଡାଳିମ୍ବ ଇତ୍ଯ଼ାଦି ପନିପରିବା ରୋପଣ କରନ୍ତୁ। ଶାଖାଗୁଡ଼ିକର ଏକ ଭଲ ବ୍ଯ଼ବଧାନ ଢାଞ୍ଚାରେ ପ୍ରଚୁର ଫୁଲ କଳ ଉତ୍ପାଦନ କରିବା ପାଇଁ ଗୋଲାପରେ କଠିନ ଛାଣିବା ପାଇଁ ଅକ୍ଟୋବର ହେଉଛି ଆଦର୍ଶ ସମଯ଼ | ଧନିଆ, ଟମାଟୋ, ଫୁଲକୋବି ଏବଂ ତିଲର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। କୋଲେ ଫସଲ ରୋପଣ ପାଇଁ ଯାଆନ୍ତୁ। କୋଲ୍ ଫସଲ ଚାରା ନର୍ସରୀରେ 3-ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି | ମୁଖ୍ଯ଼ କ୍ଷେତରେ ରୋପଣ କରନ୍ତୁ। ବିନ୍ ରୋପଣ ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ରୋପଣ କରାଯାଇଥିବା ଧାନ ପାନିକଲ ଇନିସିଏସନରୁ ଆରମ୍ଭ କରି ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଫୁଲର ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ହୋଇଥାଏ।"
      ]
    },
    "cotton": {
      "advisory": [
        "ଏହି ଫସଲ ବର୍ଗାକାରରୁ ବୋଲ୍ ଗଠନ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ବର୍ତ୍ତମାନ କପାରେ ଶୋଷକ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ପାଇଁ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ଅନୁକୂଳ | ଯଦି ଶୀଘ୍ର ବୁଣାଯାଇଥିବା କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ସର ସଂକ୍ରମଣ ହୁଏ, ତେବେ ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. 20 ଗ୍ରାମ/ଏକର କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ ନିମ୍ବ ତେଲ 1500 ପିପିଏମ <ଆଇ. ଡି. 1>-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cauliflower": {
      "advisory": [
        "ନର୍ସରୀରେ ଥିବା ଫୁଲକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ଯ଼ାଯ଼। ଫୁଲକୋବି ବୁଣିବା ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ସମ୍ପୂର୍ଣ୍ଣ ବୀଜ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଫୁଲକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି କେ-1, ପୁସା ଅର୍ଲି ସିନ୍ଥେଟିକ୍ ଏବଂ ପୁସା ଅର୍ଲି କୁଆନ୍ରି ଏବଂ ଏହାର ବିହନ ହାର ଏକର ପିଛା 200 ଗ୍ରାମ। 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ f ର ଆର୍ଦ୍ରତାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଗୋଟିଏ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1g ମିଶାଇ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1g ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ SG @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% SC @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 1 1.7% SC @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
      ]
    },
    "french bean": {
      "advisory": [
        "ବିନ୍ସରେ ପୋଡ୍ ବୋରର ପରିଚାଳନା କରିବା ପାଇଁ ଏକର ପିଛା 90-ଗ୍ରାମ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @60-ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @40-ମିଲି/ଏକରରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cow": {
      "advisory": [
        "ଯଦି ଆପଣଙ୍କ ଗୃହପାଳିତ ପଶୁ ଖାଦ୍ଯ଼ହୀନ, ଦୁର୍ବଳ, ଦୁର୍ବଳ, ତରଳ ଝାଡ଼ା, କ୍ଷୀର ଉତ୍ପାଦନ କମ୍, ଆଖିରେ ଶୁଷ୍କତା ଏବଂ ପ୍ରତିବନ୍ଧକ ଅବସ୍ଥା ଦେଖାଯାଏ, ତେବେ ପରଜୀବୀ ସଂକ୍ରମଣରୁ ଏହା ସୁଫ୍ ହେବାର ସମସ୍ତ ସମ୍ଭାବନା ଅଛି | ଏହି କୃମି କିମ୍ବା ପରଜୀବୀ ପଶୁମାନଙ୍କର ଜୀବନୀଶକ୍ତି ଏବଂ ଉତ୍ପାଦନଶୀଳତାକୁ ହ୍ରାସ କରିଥାଏ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ନିକଟତମ ଏଲ. ଏ. ସି., ପଶୁ ଚିକିତ୍ସା ଔଷଧ ଦୋକାନରେ ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ସେମାନଙ୍କ ପଶୁମାନଙ୍କର ନମୁନା ପରୀକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    }
  },
  "date": "18-10-2024"
}