{
  "weather_details": {
    "19/10/2024": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 27,
      "rh_max": 92,
      "rh_min": 68,
      "wind_speed": 2,
      "wind_direction": 90,
      "cloud_cover": 5
    },
    "20/10/2024": {
      "rainfall": 4,
      "t_max": 34,
      "t_min": 27,
      "rh_max": 91,
      "rh_min": 64,
      "wind_speed": 6,
      "wind_direction": 323,
      "cloud_cover": 6
    },
    "21/10/2024": {
      "rainfall": 6,
      "t_max": 34,
      "t_min": 26,
      "rh_max": 88,
      "rh_min": 62,
      "wind_speed": 6,
      "wind_direction": 353,
      "cloud_cover": 6
    },
    "22/10/2024": {
      "rainfall": 5,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 83,
      "rh_min": 55,
      "wind_speed": 4,
      "wind_direction": 7,
      "cloud_cover": 4
    },
    "23/10/2024": {
      "rainfall": 7,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 85,
      "rh_min": 53,
      "wind_speed": 11,
      "wind_direction": 12,
      "cloud_cover": 7
    }
  },
  "names_of_crops": [
    "ଧାନ।",
    "କଳା ଚଣା",
    "ସବୁଜ ଚଣା",
    "ରସୁଣ",
    "କଦଳୀ ଗୁଣ୍ଡ",
    "ବାଇଗଣ"
  ],
  "general_advisory": "ଧାନରେ ପାଦ ସଡ଼ିବା ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲ୍ଯ଼ାକ୍ସିଲ ସ୍ପ୍ରେ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @ଏକର ପିଛା 400 ଗ୍ରାମ। ପନିପରିବା ଏବଂ ଡାଲି ପରି ପରିପକ୍ୱ ଫସଲ ଅମଳ କରନ୍ତୁ ଏବଂ ସେଗୁଡ଼ିକୁ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ | ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ପନିପରିବା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ। ଏବେ ଜମି ପ୍ରସ୍ତୁତ କରିବା ଏବଂ ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ନୁକ୍ ର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ସ୍ଥିତି ସର୍ବୋତ୍ତମ ଅଟେ। ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଉଇପୋକା ଫସଲ ଏବଂ ପନିପରିବାକୁ କ୍ଷତି ପହଞ୍ଚାଇପାରେ। କୃଷକମାନଙ୍କୁ କ୍ଲୋରପିରିଫସ୍ 20 ଇସି @ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "ମିଥ୍ୟା ରୋଗଃ ଧାନ କ୍ଷେତରେ ମିଥ୍ୟା ରୋଗ ଦେଖାଯାଇପାରେ। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ପ୍ରୋପିକୋନାଜୋଲ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ @100 ମିଲି କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @250 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ନେକ୍ ବ୍ଲାଷ୍ଟଃ ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ଟର ପିଛା ହେକ୍ସାକୋନାଜୋଲ ମିଲି କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ @200 ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "black gram": {
      "advisory": [
        "ପୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ଫସଲରେ ପୋଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ବିହାରର ଲୋମଯୁକ୍ତ କ୍ଯ଼ାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ 5 ପ୍ରତିଶତ SG @80 18.5% SC @80"
      ]
    },
    "green gram": {
      "advisory": [
        "ପୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ଫସଲରେ ପୋଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ବିହାରର ଲୋମଯୁକ୍ତ କ୍ୟାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ 5 ପ୍ରତିଶତ SG @80 18.5% SC @80"
      ]
    },
    "onion": {
      "advisory": [
        "ବୁଣିବା ପୂର୍ବର ପର୍ଯ୍ଯ଼ାଯ଼ଃ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ ଦ୍ୱାରା କରାଯିବା ଉଚିତ।"
      ]
    },
    "bitter gourd": {
      "advisory": [
        "ଫଳ ଏବଂ ଅମଳଃ ଫଳ ମାଛିଙ୍କ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ଫସଲରେ ପାଉଡର୍ ଫଙ୍ଗୁର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ଫୁଲ ଉଠିବା/ଫଳ ବାହାରିବାଃ ମରିଯିବା ଲକ୍ଷଣ ଥିବା ଗଛଗୁଡ଼ିକୁ କ୍ଷେତ ବାହାରେ ଉପୁଡ଼ାଯାଇ ନଷ୍ଟ କରାଯାଇପାରିବ। ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ଃ ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମେଟାଲାକ୍ସିଲ୍ + ମାନକୋଜେବ୍ ଜିନେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @500 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    }
  },
  "date": "18-10-2024"
}