{
  "weather_details": {
    "19-10-2024": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 23,
      "rh_max": 93,
      "rh_min": 54,
      "wind_speed": 3,
      "wind_direction": 150,
      "cloud_cover": 4
    },
    "20-10-2024": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 23,
      "rh_max": 93,
      "rh_min": 60,
      "wind_speed": 3,
      "wind_direction": 146,
      "cloud_cover": 6
    },
    "21-10-2024": {
      "rainfall": 2,
      "t_max": 33,
      "t_min": 22,
      "rh_max": 93,
      "rh_min": 58,
      "wind_speed": 1,
      "wind_direction": 0,
      "cloud_cover": 6
    },
    "22-10-2024": {
      "rainfall": 0,
      "t_max": 33,
      "t_min": 22,
      "rh_max": 91,
      "rh_min": 46,
      "wind_speed": 2,
      "wind_direction": 117,
      "cloud_cover": 5
    },
    "23-10-2024": {
      "rainfall": 0,
      "t_max": 33,
      "t_min": 22,
      "rh_max": 82,
      "rh_min": 45,
      "wind_speed": 2,
      "wind_direction": 31,
      "cloud_cover": 5
    }
  },
  "names_of_crops": [
    "ଧାନ।",
    "କପା",
    "ଅରହର",
    "ସଂକର ମକା",
    "ଟମାଟୋ",
    "କୋଇଲା ଫସଲ",
    "ରସୁଣ",
    "ମେରିଗୋଲ୍ଡ",
    "ଗୋଲାପ।",
    "ଗୋରୁ।",
    "ମଇଁଷି।",
    "ଛେଳି।",
    "ମେଣ୍ଢା",
    "କୁକୁଡ଼ା ମାଂସ"
  ],
  "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ସପ୍ତାହ-1 (18 ରୁ 22 ଅକ୍ଟୋବର, 2024) ମଧ୍ଯ଼ରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନରୁ ବିକ୍ଷିପ୍ତ ସ୍ଥାନରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ଏହା ପରେ ବର୍ଷା କାର୍ଯ୍ଯ଼କଳାପ ବୃଦ୍ଧି ପାଇବ। ସପ୍ତାହ-1 ମଧ୍ଯ଼ରେ ଦକ୍ଷିଣ ଆଭ୍ଯ଼ନ୍ତରୀଣ ଓଡ଼ିଶାର କିଛି ଅଂଶ ଏବଂ ଉତ୍ତର ଆଭ୍ଯ଼ନ୍ତରୀଣ ଓଡ଼ିଶାର କିଛି ଅଂଶରେ ସର୍ବାଧିକ ତାପମାତ୍ରା 32-34 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ 30-32 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ଓଡ଼ିଶାର ଅଧିକାଂଶ ଭାଗରେ 30-32 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ମଧ୍ଯ଼ରେ ରହିବାର ସମ୍ଭାବନା ରହିଛି। କୃଷକମାନେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ପରିପକ୍ୱ ଉତ୍ପାଦ ଅମଳ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପରବର୍ତ୍ତୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଷ୍ଟିକର ସହିତ ମିଶ୍ରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଜାରି ରଖିପାରିବେ।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ବ୍ଲାଇଟ୍, ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ଷ୍ଟ୍ରିକ୍ ଏବଂ ଲିଫ୍ ବ୍ଲାଷ୍ଟ ଭଳି ରୋଗର ଘଟଣା ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅତ୍ଯ଼ନ୍ତ ଅନୁକୂଳ | କୃଷକମାନଙ୍କୁ ନିଜ କ୍ଷେତରେ ସତର୍କ ରହିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
        "ଗୁଣ୍ଡି ବଗ୍ଃ ଯଦି ସଂକ୍ରମଣ ଦେଖାଯାଏ, ମାଲାଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 06 ପ୍ରତିଶତ + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 04 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. କୁ ପାଣି ସହିତ ମିଶ୍ରିତ ପତ୍ର ସ୍ପ୍ରେ ଭାବରେ ଲଗାନ୍ତୁ।",
        "କାନ କାଟିବା କ୍ଯ଼ାଟର୍ପିଲରଃ ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ୱିନାଲଫସ୍ 25 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cotton": {
      "advisory": [
        "ଆମେରିକୀଯ଼ ବୋଲୱର୍ମଃ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ଲଗାନ୍ତୁ।",
        "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଷ୍ଟ୍ରିପ୍ଟୋସାଇକ୍ଲିନ୍ 1.5 ଗ୍ରାମ୍ + କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲଗାନ୍ତୁ।"
      ]
    },
    "arhar": {
      "advisory": [
        "ଲିଫ୍ ୱେବର୍/ଲିଫ୍ ଫୋଲ୍ଡର୍/ଡିଫୋଲିଏଟର୍ଃ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ଶୁଆ ଛେଦକଃ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% ଲଗାନ୍ତୁ।"
      ]
    },
    "hybrid maize": {
      "advisory": [
        "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ଃ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
        "ବି. ଏଲ୍. ଏସ୍. ବି.: ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ସିଡଲିଂ ୱିଲ୍ଟଃ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ସୁସ୍ଥ ଚାରା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ପଦାର୍ଥ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
      ]
    },
    "cole crops": {
      "advisory": [
        "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତିଃ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ ସୁପାରିସ କରାଯାଇଥିବା ପଦାର୍ଥ ଲଗାନ୍ତୁ। ଫୁଲକୋବି, ବନ୍ଧାକୋବି ଏବଂ ବ୍ରୋକୋଲି ପାଇଁ ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
      ]
    },
    "onion": {
      "advisory": [
        "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତିଃ ସାର ପ୍ରଯ଼ୋଗ ଏବଂ ରୋଗରୁ ସୁରକ୍ଷା ସମେତ ବୁଣିବା ପୂର୍ବରୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ଯତ୍ନ ପ୍ରଦାନ କରନ୍ତୁ। ସଫଳ ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
      ]
    },
    "merigold": {
      "advisory": [
        "କ୍ଷୁଦ୍ର କୀଟ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ବୁପ୍ରୋଫେଜିନ୍ 25 ପ୍ରତିଶତ ଏସ୍ସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "rose": {
      "advisory": [
        "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ ସହିତ ତାଲିମ ଏବଂ ଛାଟାଇ କରାଯିବା ଉଚିତ।",
        "କଳା ଦାଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲଗାନ୍ତୁ।"
      ]
    },
    "cattle": {
      "advisory": [
        "ନିଯ଼ମିତ ଭାବରେ ଗାଈ ଏବଂ ମଇଁଷିକୁ କୀଟ ଦୂର କରିବା ଏବଂ ଟୀକାକରଣ କରିବା। କୌଣସି ସ୍ୱାସ୍ଥ୍ଯ଼ ସମସ୍ଯ଼ା ପାଇଁ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ।"
      ]
    },
    "buffalo": {
      "advisory": [
        "ଡିୱର୍ମ ଏବଂ ନିୟମିତ ଭାବରେ ମଇଁଷିମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ | ପ୍ରଜନନ ସମ୍ବନ୍ଧୀୟ ସମସ୍ୟା ପାଇଁ ପଶୁ ଚିକିତ୍ସା ପରାମର୍ଶ ନିଅନ୍ତୁ।"
      ]
    },
    "goat": {
      "advisory": [
        "ଛେଳି ଏବଂ ମେଣ୍ଢାଙ୍କଠାରେ ଡିହାଇଡ୍ରେସନ୍, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣ ପାଇଁ ନିୟମିତ ଯାଞ୍ଚ କରନ୍ତୁ। କୃମି ଦୂରୀକରଣ ଏବଂ ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ।"
      ]
    },
    "sheep": {
      "advisory": [
        "ସ୍ୱାସ୍ଥ୍ୟ ସମସ୍ୟା ପାଇଁ ନିୟମିତ ଭାବରେ ମେଣ୍ଢା ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ କୃମି ନିରାକରଣ ଏବଂ ଟୀକାକରଣ ସମେତ ଆବଶ୍ୟକ ଯତ୍ନ ପ୍ରଦାନ କରନ୍ତୁ |"
      ]
    },
    "poultry": {
      "advisory": [
        "କୁକୁଡ଼ା ଘରେ ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉଠାଯାଇଥିବା ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ପ୍ରଣାଳୀ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରୋଗ ଜୀବାଣୁ ନିର୍ମାଣକୁ ରୋକିବା ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ସଫା ଏବଂ ଜୀବାଣୁହୀନ କରନ୍ତୁ |"
      ]
    }
  },
  "date": "18-10-2024"
}