{
  "weather_details": {
    "19/10/2024": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 92,
      "rh_min": 65,
      "wind_speed": 6,
      "wind_direction": 326,
      "cloud_cover": 4
    },
    "20/10/2024": {
      "rainfall": 2,
      "t_max": 35,
      "t_min": 24,
      "rh_max": 92,
      "rh_min": 62,
      "wind_speed": 9,
      "wind_direction": 325,
      "cloud_cover": 5
    },
    "21/10/2024": {
      "rainfall": 5,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 86,
      "rh_min": 61,
      "wind_speed": 6,
      "wind_direction": 355,
      "cloud_cover": 4
    },
    "22/10/2024": {
      "rainfall": 10,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 83,
      "rh_min": 55,
      "wind_speed": 12,
      "wind_direction": 1,
      "cloud_cover": 6
    },
    "23/10/2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 85,
      "rh_min": 52,
      "wind_speed": 6,
      "wind_direction": 8,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଧାନ।",
    "ମକା",
    "ଆଖୁ",
    "କପା",
    "କଳା ଚଣା",
    "ସବୁଜ ଚଣା",
    "ରସୁଣ",
    "କଦଳୀ ଗୁଣ୍ଡ",
    "ବାଇଗଣ",
    "ମେଣ୍ଢା",
    "ଛେଳି।"
  ],
  "general_advisory": "ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ ଓଯ଼ୁଏଟି କାଲିଙ୍ଗା ମୂଲ୍ଯ଼ଯୁକ୍ତ ଉତ୍ପାଦ, ଫିଙ୍ଗରଲିଙ୍ଗସ୍/ଇଯ଼ର୍ଲିଙ୍ଗସ୍, ଭର୍ମିକମ୍ପୋଷ୍ଟ ଏବଂ ଫାର୍ମ ଉପକରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଆଇଏମଡି ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଏବଂ ଓଡ଼ିଶାର ଅବସ୍ଥିତି ବିଷଯ଼ରେ କୃଷି-ପାଣିପାଗ ସମ୍ବନ୍ଧୀଯ଼ ପରାମର୍ଶ ବର୍ତ୍ତମାନ ମେଘଦୂତରେ ଉପଲବ୍ଧ।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "ମିଥ୍ୟା ରୋଗଃ ଧାନ କ୍ଷେତରେ ମିଥ୍ୟା ରୋଗ ଦେଖାଯାଇପାରେ। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରୋପିକୋନାଜୋଲ୍ କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ନେକ୍ ବ୍ଲାଷ୍ଟଃ ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ସାକୋନାଜୋଲ କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "maize": {
      "advisory": [
        "ମକା ଫସଲ ପାଇଁ ସାରର ଉପର ଡ୍ରେସିଂ ଆରମ୍ଭ ହୋଇଛି।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "ଆଖୁ ବ୍ଯ଼ାପକ ଅଭିବୃଦ୍ଧି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି।"
      ]
    },
    "cotton": {
      "advisory": [
        "କପା ଫସଲ ବୋଲ୍ ଗଠନ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି |"
      ]
    },
    "black gram": {
      "advisory": [
        "ପୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ କଳା ଚଣା ଫସଲରେ ପୋଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପରିଚାଳନା କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "green gram": {
      "advisory": [
        "ପୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ ସବୁଜ ଚଣା ଫସଲରେ ପୋଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବିହାରର ଲୋମଯୁକ୍ତ କ୍ଯ଼ାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "onion": {
      "advisory": [
        "ପୂର୍ବ-ବୁଣିବା ପର୍ଯ୍ୟାୟଃ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଚିକିତ୍ସା କାର୍ବେନଡାଜିମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ + ଥିରମ୍ ସହିତ କରାଯିବା ଉଚିତ।"
      ]
    },
    "bitter gourd": {
      "advisory": [
        "ଫଳ ଏବଂ ଅମଳଃ ଫଳ ମାଛିଙ୍କ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଡିନୋକାପ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ଫୁଲ ଉଠିବା/ଫଳ ବାହାରିବାଃ ମରିଯିବା ଲକ୍ଷଣ ଥିବା ଗଛଗୁଡ଼ିକୁ କ୍ଷେତ ବାହାରେ ଉପୁଡ଼ାଯାଇ ନଷ୍ଟ କରାଯାଇପାରିବ।",
        "ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ଃ ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ପାଇଁ, ମେଟାଲାକ୍ସିଲ୍ + ମାନକୋଜେବ୍ କିମ୍ବା ଜିନେବ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "sheep": {
      "advisory": [
        "ମେଣ୍ଢାମାନଙ୍କଠାରେ ଲିଭର ଫ୍ଲୁକ୍ ସଂକ୍ରମଣଃ ଲିଭର ଫ୍ଲୁକ୍ ମେଣ୍ଢାମାନଙ୍କର ଏକ ବଡ଼ ଶତ୍ରୁ। ନିର୍ଦ୍ଦିଷ୍ଟ ଔଷଧ ବ୍ଯ଼ବହାର କରି କିମ୍ବା ବତକ ପାଳନ ଦ୍ୱାରା ଏହି କୃମିର ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
      ]
    },
    "goats": {
      "advisory": [
        "ଛେଳିମାନଙ୍କଠାରେ ଲିଭର ଫ୍ଲୁକ୍ ସଂକ୍ରମଣଃ ଲିଭର ଫ୍ଲୁକ୍ ଛେଳିମାନଙ୍କର ଏକ ବଡ଼ ଶତ୍ରୁ। ନିର୍ଦ୍ଦିଷ୍ଟ ଔଷଧ ବ୍ଯ଼ବହାର କରି କିମ୍ବା ବତକ ପାଳନ ଦ୍ୱାରା ଏହି କୃମିର ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
      ]
    }
  },
  "date": "18-10-2024"
}