{
  "weather_details": {
    "2024-10-19": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 95,
      "rh_min": 66,
      "wind_speed": 2,
      "wind_direction": 0,
      "cloud_cover": 5
    },
    "2024-10-20": {
      "rainfall": 2,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 92,
      "rh_min": 63,
      "wind_speed": 3,
      "wind_direction": 342,
      "cloud_cover": 6
    },
    "2024-10-21": {
      "rainfall": 2,
      "t_max": 35,
      "t_min": 24,
      "rh_max": 88,
      "rh_min": 54,
      "wind_speed": 4,
      "wind_direction": 349,
      "cloud_cover": 4
    },
    "2024-10-22": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 83,
      "rh_min": 50,
      "wind_speed": 4,
      "wind_direction": 350,
      "cloud_cover": 4
    },
    "2024-10-23": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 83,
      "rh_min": 51,
      "wind_speed": 5,
      "wind_direction": 352,
      "cloud_cover": 5
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "ମକା",
    "ଫିଙ୍ଗର ମିଲେଟ୍",
    "କଦଳୀ",
    "ଫୁଲକୋବି",
    "କାକୁଡ଼ି",
    "ଟମାଟୋ",
    "ରସୁଣ",
    "ପେଁପେ",
    "ଗାଈ।",
    "ସାଧାରଣ ମାଛ",
    "ଚିକେନ୍"
  ],
  "general_advisory": "ଉଚ୍ଚଭୂମି/ମଧ୍ୟମ ଜମିରେ ଚିନାବାଦାମ, ଚଣା, ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ମିଠା ଆଳୁ ଏବଂ ତିଲ ଭଳି ରବି ଫସଲ ବୁଣିବା ପାଇଁ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଯଥେଷ୍ଟ। କୋଲ ଫସଲ (ବନ୍ଧାକୋବି, ବିଳମ୍ବିତ ଫୁଲକୋବି ଏବଂ ବ୍ରୋକୋଲି), ସୋଲାନାସିୟସ୍ ପନିପରିବା (ବାଇଗଣ, ଟମାଟୋ, ଲଙ୍କା ଏବଂ କ୍ୟାପ୍ସିକମ୍) ଭଳି ପନିପରିବା ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମୟ। ଗାଜର, ମୂଳା, ସୋରିଷ, ରସୁଣ, ଡାଳିମ୍ବ ଇତ୍ୟାଦି ପନିପରିବା ରୋପଣ କରନ୍ତୁ। ଶାଖାଗୁଡ଼ିକର ଏକ ଭଲ ବ୍ୟବଧାନ ଢାଞ୍ଚାରେ ପ୍ରଚୁର ଫୁଲ କଳ ଉତ୍ପାଦନ କରିବା ପାଇଁ ଗୋଲାପରେ କଠିନ ଛାଣିବା ପାଇଁ ଅକ୍ଟୋବର ହେଉଛି ଆଦର୍ଶ ସମୟ | ଧନିଆ, ଟମାଟୋ, ଫୁଲକୋବି ଏବଂ ତିଲର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। କୋଲେ ଫସଲ ରୋପଣ ପାଇଁ ଯାଆନ୍ତୁ। କୋଲ୍ ଫସଲ ଚାରା ନର୍ସରୀରେ 3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ଅଛି | ମୁଖ୍ୟ କ୍ଷେତରେ ରୋପଣ କରନ୍ତୁ। ବିନ୍ ରୋପଣ ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ରୋପଣ କରାଯାଇଥିବା ଧାନ ପାନିକଲ ଇନିସିଏସନରୁ ଆରମ୍ଭ କରି ମୁଖ୍ୟ କ୍ଷେତରେ ଫୁଲର ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ହୋଇଥାଏ। ବର୍ତ୍ତମାନର ଉଚ୍ଚ ଆର୍ଦ୍ର ପାଣିପାଗ ସ୍ଥିତି ଏବଂ ବର୍ଷା ପରେ ସ୍ୱଚ୍ଛ ଆକାଶ ଧାନରେ ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ବିପିଏଚ) ଏବଂ ହ୍ୱାଇଟ୍ ବ୍ୟାକ୍ଡ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ଡବ୍ଲୁବିପିଏଚ) ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଧାନରେ ବିପିଏଚ ଏବଂ ଡବ୍ଲ୍ୟୁ. ବି. ପି. ଏଚ. ପରିଚାଳନା କରିବା ପାଇଁ ନାଇଟ୍ରୋଜେନ ସାରର ଅତ୍ୟଧିକ ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। କ୍ଷେତରେ ଅଧିକ ସମୟ ଧରି ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ ନାହିଁ।"
      ]
    },
    "maize": {
      "advisory": [
        "ଏହି ଫସଲ ହେଉଛି କୋବ ବିକାଶର ପର୍ଯ୍ଯ଼ାଯ଼। କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। କେତେକ ସ୍ଥାନରେ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ମକା ଫସଲରେ ଫଲ୍ ଆର୍ମି କୃମିର ସଂକ୍ରମଣ ହୋଇଥିବା ସୂଚନା ମିଳିଛି। କୀଟ ପରିଚାଳନା ପାଇଁ ବାଯ଼ୋପେଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନାକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200 ଗ୍ରାମ ଲେଖାଏଁ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "finger millet": {
      "advisory": [
        "ଲିଫ୍ ସ୍ପାଟ୍ ଏବଂ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ରୋକିବା ପାଇଁ ଏକର ପିଛା ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. + କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ <ଆଇ. ଡି. 1> ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କବକନାଶକକୁ ସିଞ୍ଚନ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।"
      ]
    },
    "cabbage": {
      "advisory": [
        "ନର୍ସରୀରେ ଥିବା ବନ୍ଧାକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ଯ଼ାଯ଼। ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଏବଂ ବନ୍ଧାକୋବି ମଞ୍ଜି ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ବନ୍ଧାକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ ଇତ୍ଯ଼ାଦି, ଏବଂ ମଞ୍ଜି ଦର ଏକର ପିଛା 200 ଗ୍ରାମ୍ | 1 ଏକର ଫସଲ ପାଇଁ, ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (3 ମି. x1 ମି. x 0.15 ମି. ଆକାରର) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
      ]
    },
    "cauliflower": {
      "advisory": [
        "ନର୍ସରୀରେ ଥିବା ଫୁଲକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ୟାୟ। ଫୁଲକୋବି ବୁଣିବା ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ସମ୍ପୂର୍ଣ୍ଣ ବୀଜ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଫୁଲକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି କେ-1, ପୁସା ପ୍ରାରମ୍ଭିକ ସିନ୍ଥେଟିକ୍, ଏବଂ ପୁସା ପ୍ରାରମ୍ଭିକ କୁଆନ୍ରି, ଏବଂ ମଞ୍ଜି ହାର ଏକର ପିଛା 200 ଗ୍ରାମ୍ | 1 ଏକର ଫସଲ ପାଇଁ, ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (3 ମି. x1 ମି. x 0.15 ମି. ଆକାରର) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିୟମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
      ]
    },
    "cucumber": {
      "advisory": [
        "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4-ଲିଟର ପାଣିରେ 400-ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8-ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ୟା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ନର୍ସରୀରେ ଥିବା ଟମାଟୋ ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ। ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ଟମାଟୋ ମଞ୍ଜି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଟମାଟୋ ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି ଉତ୍କଳ ପ୍ର ଜ୍ଞାନ, ଉତ୍କଳ ରାଜା, ଉତ୍କଳ କୁମାରୀ, ଉତ୍କଳ ପଲ୍ଲବୀ, ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ, ସ୍ୱର୍ଣ୍ଣ ଲାଲିମା ଇତ୍ଯ଼ାଦି | ଏକ ଏକର ଅଞ୍ଚଳରେ ରୋପଣ ପାଇଁ 200 ଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। 1 ଏକର ଫସଲ ପାଇଁ, ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (3 ମି. x 1 ମି. x 0.15 ମି. ଆକାରର) ହେବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜିବା ଠାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1ଜି ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1ଜି ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "onion": {
      "advisory": [
        "ନର୍ସରୀରେ ଥିବା ପିଆଜର ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ। ନର୍ସରୀରେ ଆଳୁ ବୁଣିବା ଏବଂ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ପ୍ରସ୍ତୁତି। ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଭୀମ ସୁପର୍, ଭୀମ ରେଡ୍, ଭୀମ ଶକ୍ତି ପରି କିସମ ଏବଂ ବିହନ ହାର ଏସି ପିଛା 4 ରୁ 5 କିଲୋଗ୍ରାମ। ସୂର୍ଯ୍ଯ଼କିରଣ ଏବଂ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନର୍ସରୀକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। 1 ଏକର ଫସଲ ପାଇଁ, ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (3 ମି. x1 ମି. x 0.15 ମି. ଆକାରର) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜିବା ଠାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1ଜି ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1ଜି ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "papaya": {
      "advisory": [
        "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cow": {
      "advisory": [
        "ଯଦି ଆପଣଙ୍କ ଗୃହପାଳିତ ପଶୁ ଖାଦ୍ୟରୁ ବଞ୍ଚିତ, ଦୁର୍ବଳ, ଦୁର୍ବଳ, ତରଳ ଝାଡ଼ା, ଦୁଗ୍ଧ ଉତ୍ପାଦନ କମ୍, ଆଖିରେ ଶୁଷ୍କତା ଏବଂ ପ୍ରତିବନ୍ଧକ ଅବସ୍ଥା ଦେଖାଯାଏ, ତେବେ ଏହା ପରଜୀବୀ ସଂକ୍ରମଣରେ ପୀଡ଼ିତ ହେବାର ସମସ୍ତ ସମ୍ଭାବନା ଅଛି | ଏହି କୃମି କିମ୍ବା ପରଜୀବୀ ପଶୁମାନଙ୍କର ଜୀବନୀଶକ୍ତି ଏବଂ ଉତ୍ପାଦନଶୀଳତାକୁ ହ୍ରାସ କରିଥାଏ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ନିକଟତମ ଏଲ. ଏ. ସି., ପଶୁ ଚିକିତ୍ସା ଔଷଧ ଦୋକାନରେ ନିୟମିତ ବ୍ୟବଧାନରେ ସେମାନଙ୍କ ପଶୁମାନଙ୍କର ନମୁନା ପରୀକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
      ]
    },
    "common fish": {
      "advisory": [
        "ଫିଙ୍ଗରଲିଙ୍ଗ, ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା 1:1 ଅନୁପାତରେ ଷ୍ଟକ୍ କରିବା ପରେ ଦିନକୁ ଦୁଇଥର ସେମାନଙ୍କ ଶରୀରର ଓଜନର 5 ପ୍ରତିଶତ ଖାଦ୍ଯ଼ ଭାବରେ ଦିଆଯାଏ | ମାଛକୁ ଦିଆଯାଉଥିବା ମୋଟ ଖାଦ୍ଯ଼ରେ ଭିଟାମିନ୍ ଏବଂ ଖଣିଜ ମିଶ୍ରଣ @1% ମିଶାନ୍ତୁ। ଫିଙ୍ଗରଲିଙ୍ଗ୍ ଷ୍ଟକ୍ କରିବା ପରେ ନିଯ଼ମିତ ଭାବରେ ପିଏଚ୍ ଏବଂ ଜଳ ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ | ପୋଖରୀ ଜଳକୁ ଶୁଦ୍ଧ କରିବା ପାଇଁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଚୂନ ମିଶାନ୍ତୁ। ପୋଖରୀରେ ପ୍ଲାଙ୍କଟନର ପରିମାଣ ବଢ଼ାଇବା ପାଇଁ, ମାସକୁ ଦୁଇଥର ଏକର ପିଛା 200 କିଲୋଗ୍ରାମ ଗୋବର ଏବଂ 4 କିଲୋଗ୍ରାମ ସୁପରଫସଫେଟ ଲଗାନ୍ତୁ।"
      ]
    },
    "chicken": {
      "advisory": [
        "ଯଦି କୁକୁଡ଼ା ପକ୍ଷୀର ବୟସ 3ରୁ 4 ସପ୍ତାହ ହୋଇଥାଏ, ତେବେ ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
      ]
    }
  },
  "date": "18-10-2024"
}