{
  "weather_details": {
    "03/04/2024": {
      "rainfall": 0,
      "t_max": 41,
      "t_min": 26,
      "rh_max": 46,
      "rh_min": 11,
      "wind_speed": 8,
      "wind_direction": 288,
      "cloud_cover": 0
    },
    "04/04/2024": {
      "rainfall": 0,
      "t_max": 41,
      "t_min": 26,
      "rh_max": 63,
      "rh_min": 10,
      "wind_speed": 7,
      "wind_direction": 198,
      "cloud_cover": 1
    },
    "05/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 53,
      "rh_min": 16,
      "wind_speed": 9,
      "wind_direction": 207,
      "cloud_cover": 1
    },
    "06/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 51,
      "rh_min": 12,
      "wind_speed": 9,
      "wind_direction": 165,
      "cloud_cover": 1
    },
    "07/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 35,
      "rh_min": 8,
      "wind_speed": 10,
      "wind_direction": 202,
      "cloud_cover": 2
    }
  },
  "names_of_crops": [
    "ଧାନ।",
    "ଆଖୁ",
    "ମକା",
    "ଟମାଟୋ",
    "ବାଇଗଣ",
    "ନଡ଼ିଆ",
    "ପନିପରିବା",
    "ଫିଙ୍ଗରଲିଙ୍ଗ୍",
    "କଳା ଚଣା",
    "ସବୁଜ ଚଣା",
    "ରସୁଣ",
    "ଆମ୍ବ",
    "ଓକ୍ରା"
  ],
  "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଜଳର ଆବଶ୍ଯ଼କତା ପୂରଣ କରିବା ପାଇଁ ମକା ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା-ଧାନରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା-ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସିଞ୍ଚନ କରି ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା କରନ୍ତୁ।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା-ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା ପାଇଁ ଗରମ ମାସରେ ବାରମ୍ବାର ଜଳସେଚନ କରନ୍ତୁ |"
      ]
    },
    "maize": {
      "advisory": [
        "ଉଚ୍ଚ ତାପମାତ୍ରା ଜଳର ଆବଶ୍ଯ଼କତାକୁ ବଢ଼ାଇଥାଏ-ଜଳର ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ସେହି ଅନୁଯାଯ଼ୀ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ଉଚ୍ଚ ତାପମାତ୍ରା ହେତୁ ବିଲ୍ଟିଂ ହୋଇପାରେ-ବିଲ୍ଟିଂକୁ ରୋକିବା ପାଇଁ ମୂଳ ଅଞ୍ଚଳରେ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ |"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବାଇଗଣ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା-ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "coconut": {
      "advisory": [
        "ଜଳକ୍ଷୟ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ।"
      ]
    },
    "vegetables": {
      "advisory": [
        "ଦିନରେ ନୂତନ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ କାଗଜ ଟୋପି ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ।"
      ]
    },
    "fingerlings": {
      "advisory": [
        "ଯଦି ଅଗଭୀର ପୋଖରୀରେ ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସରୁ ଅଧିକ ହୁଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗ ଅମଳ କରନ୍ତୁ।"
      ]
    },
    "black gram": {
      "advisory": [
        "ତମାଖୁ କ୍ୟାଟରପିଲର ପରିଚାଳନା-କ୍ଷେତ ଚାରିପାଖରେ ଧୂଳି ଏବଂ ସୁପାରିସ କରାଯାଇଥିବା ରାସାୟନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "green gram": {
      "advisory": [
        "ତମାଖୁ କ୍ଯ଼ାଟରପିଲର ପରିଚାଳନା-କ୍ଷେତ ଚାରିପାଖରେ ଧୂଳି ଏବଂ ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "onion": {
      "advisory": [
        "ଅମଳ ଏବଂ ସଂରକ୍ଷଣ ପରାମର୍ଶ-ଅମଳ ପରେ ପିଆଜର ଉପର ଭାଗକୁ କାଟି କନ୍ଦକୁ ଭଲ ଭାବେ ଶୁଖାଇ ଦିଅନ୍ତୁ।"
      ]
    },
    "mango": {
      "advisory": [
        "ଆମ୍ବ ହପର ନିଯ଼ନ୍ତ୍ରଣ-ଆମ୍ବ ହପର ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣ ପ୍ରତିରୋଧ-ବୁଣିବା ପୂର୍ବରୁ ଓକ୍ରା ମଞ୍ଜି ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ ଏବଂ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।"
      ]
    }
  },
  "date": "02-04-2024"
}