{
  "weather_details": {
    "05-10-2024": {
      "rainfall": 0,
      "t_max": 33,
      "t_min": 27,
      "rh_max": 68,
      "rh_min": 47,
      "wind_speed": 7,
      "wind_direction": 253,
      "cloud_cover": 4
    },
    "06-10-2024": {
      "rainfall": 0,
      "t_max": 32,
      "t_min": 27,
      "rh_max": 72,
      "rh_min": 46,
      "wind_speed": 5,
      "wind_direction": 248,
      "cloud_cover": 3
    },
    "07-10-2024": {
      "rainfall": 0,
      "t_max": 32,
      "t_min": 27,
      "rh_max": 75,
      "rh_min": 53,
      "wind_speed": 4,
      "wind_direction": 243,
      "cloud_cover": 5
    },
    "08-10-2024": {
      "rainfall": 0,
      "t_max": 32,
      "t_min": 26,
      "rh_max": 83,
      "rh_min": 51,
      "wind_speed": 4,
      "wind_direction": 180,
      "cloud_cover": 4
    },
    "09-10-2024": {
      "rainfall": 5,
      "t_max": 31,
      "t_min": 26,
      "rh_max": 89,
      "rh_min": 57,
      "wind_speed": 6,
      "wind_direction": 115,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
    "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
    "କପା",
    "ଅରହର",
    "ସଂକର ମକା",
    "ବାଇଗଣ",
    "ଟମାଟୋ",
    "କୋଇଲା ଫସଲ",
    "କଦଳୀ",
    "ପେଁପେ",
    "ଗୋରୁ।",
    "ଛେଳି ଏବଂ ମେଣ୍ଢା",
    "କୁକୁଡ଼ା ମାଂସ"
  ],
  "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଆଗାମୀ ଚାରି ଦିନ ମଧ୍ୟରେ କୃଷି ସମ୍ବନ୍ଧୀୟ ଅଭ୍ୟାସ, ଜଳସେଚନ, ପ୍ରୟୋଗ କୀଟନାଶକ ଏବଂ ସାର ଜାରି ରଖିପାରିବେ। କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ ଏବଂ ସିପେଜ୍ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ବନ୍ଧରେ ଥିବା ଛିଦ୍ରଗୁଡ଼ିକୁ ପ୍ଲଗ୍ କରନ୍ତୁ | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ କରାଯିବା ଉଚିତ ଏବଂ କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ହାଲୁକା ଫାନ୍ଦ ବ୍ୟବହାର କରାଯିବା ଉଚିତ ଯାହା ଦ୍ୱାରା ସମୟୋଚିତ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଆଯାଇପାରିବ। ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଉଇପୋକା ଫସଲ ଏବଂ ପନିପରିବାକୁ କ୍ଷତି ପହଞ୍ଚାଇପାରେ। କୃଷକମାନଙ୍କୁ କ୍ଲୋରପିରିଫସ୍ 20 ଇସି @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶଃ ଧାନରେ ବି. ପି. ଏଚ୍. ସଂକ୍ରମଣ ସମୟରେ ନାଇଟ୍ରୋଜେନଯୁକ୍ତ ସାର ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ।",
  "crops_data": {
    "direct seeded paddy": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ଧାନ କ୍ଷୀର ଦୋଇବା ସମୟରେ ଗୁଣ୍ଡି କୀଟ ସଂକ୍ରମଣ ସାଧାରଣତଃ ଦେଖାଯାଏ। ଯେତେବେଳେ ଗୁଣ୍ଡି ବଗ୍ର ସଂଖ୍ୟା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇ. ଟି. ଏଲ୍.) ଅର୍ଥାତ୍ 2 ଜଣ ବୟସ୍କ/ପାହାଡ କିମ୍ବା 5 ଜଣ ବୟସ୍କ/ବର୍ଗ ମିଟର ଅତିକ୍ରମ କରିଥାଏ, ସେତେବେଳେ ଇଟୋଫେନପ୍ରୋକ୍ସ 10 ଇ. ସି. @ଏକର ପିଛା 200 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 1000 ମିଲି. କୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ବି. ପି. ଏଚ୍.: ଧାନର ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ବି. ପି. ଏଚ୍. ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟପର୍ (ବିପିଏଚ) ର ଜନସଂଖ୍ଯ଼ା ଇଟିଏଲ (5-10 ହପର୍/ପାହାଡ) ରୁ ଅଧିକ ହୁଏ, ତେବେ କୃଷକମାନଙ୍କୁ ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଗ୍ରହଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମଯ଼ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ତେବେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 50 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. କିମ୍ବା ଏକର ପିଛା 400 ଗ୍ରାମ୍ ବୁପ୍ରୋଫେଜିନ୍ 20 ପ୍ରତିଶତ + ଏସ୍ଫେଟ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
      ]
    },
    "transplanted paddy": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ଅଳ୍ପ କେତେକ ସ୍ଥାନରେ ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ବିସ୍ଫୋରଣଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ। ଯଦି ଧାନ କ୍ଷେତରେ ପତ୍ରର ବିସ୍ଫୋରଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ 200 ଲିଟର ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଉପରେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି (ନାଟିଭୋ) କିମ୍ବା ଆଇସୋପ୍ରୋଥିଓଲେନ୍ 40 ଇସି (ସୁଲତାନ/ଫୁଜିଟା/ଫୁଜିଓନ୍) 300 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ। 7-10 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।",
        "ଷ୍ଟେମ ବୋରର ଏବଂ ଲିଫ୍ ଫୋଲଡରଃ ଯଦି କୀଟ ସଂଖ୍ୟା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ହୋଇଥାଏ, ତେବେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @60 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ଡବ୍ଲୁ. ଜି. 50 ଗ୍ରାମ/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4ଜି @10 କେଜି/ଏକର ଲଗାଇ ପତ୍ର ଫୋଲଡର ତଥା ଷ୍ଟେମ ବୋରର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
      ]
    },
    "cotton": {
      "advisory": [
        "ଟପିଂ (ମୁଖ୍ୟ କାଣ୍ଡର ଅନ୍ତିମ କଳ କାଟିବା) 90 ଡିଏଏସରେ କିମ୍ବା ଯେତେବେଳେ ଫସଲ 100 ସେ. ମି. ଉଚ୍ଚତାରେ ପହଞ୍ଚିବ, ସେତେବେଳେ କରାଯିବା ଉଚିତ।"
      ]
    },
    "arhar": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ଲିଫ୍ ୱେବର୍/ଲିଫ୍ ଫୋଲ୍ଡର୍/ଡିଫୋଲିଏଟର୍ଃ ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏହି କୀଟପତଙ୍ଗ ଦେଖିବାକୁ ମିଳିପାରେ। ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ବିଲ୍ଟଃ ବର୍ଷା କମିବା ପରେ ବିଲ୍ଟିଂ ଦେଖାଯାଇପାରେ। ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ 75 ପ୍ରତିଶତ WG @1.5g/liter ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
      ]
    },
    "hybrid maize": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ ଏବଂ ବ୍ୟାଣ୍ଡେଡ ଲିଫ୍ ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ବର୍ତ୍ତମାନର ପାଣିପାଗ ଅବସ୍ଥା ହେତୁ ଦେଖାଯାଇପାରେ | ନିୟମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।",
        "ଷ୍ଟେମ ବୋରରଃ ଷ୍ଟେମ ବୋରରର ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକରରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ.: ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ. ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 80 ଗ୍ରାମ ପିଛା 5 ପ୍ରତିଶତ ଏସ. ଜି. ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ।",
        "ବି. ଏଲ୍. ଏସ୍. ବି.: ଭିଜାଇ ରଖିଥିବା, ରଙ୍ଗହୀନ ଏକକେନ୍ଦ୍ରିକ ପଟ୍ଟାଗୁଡ଼ିକ ଏବଂ ପତ୍ର ଏବଂ ଆବରଣ ଉପରେ ବଳଯ଼ଗୁଡ଼ିକ। ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "brinjal": {
      "advisory": [
        "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ୱିଲ୍ଟ୍ଃ ପରିଚାଳନା କରିବା ପାଇଁ, କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @25 ଗ୍ରାମ୍ + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @1.5 ଗ୍ରାମ୍ ସହିତ 10 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ କରନ୍ତୁ।"
      ]
    },
    "tomato": {
      "advisory": [
        "ସିଡଲିଂ ୱିଲ୍ଟଃ ନର୍ସରୀ ଶଯ୍ୟାକୁ ବୁଣିବା ପୂର୍ବରୁ ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ଭାବରେ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ 1.5% ଡବ୍ଲ୍ୟୁ. ପି. @50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍।"
      ]
    },
    "cole crops": {
      "advisory": [
        "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତିଃ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ପ୍ରତ୍ଯ଼େକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ଭଲ ଭାବେ ଅପଘଟିତ ହୋଇଥିବା ଏଫ. ୱାଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ। ଉନ୍ନତ କିସମ କ୍ଷେତ୍ରରେ, ଏକ ଏକର ଚାଷ ପାଇଁ 200-250 ଗ୍ରାମ୍ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ଏବଂ ହାଇବ୍ରିଡ୍ କ୍ଷେତ୍ରରେ 100-150 ଗ୍ରାମ୍ ମଞ୍ଜି ଆବଶ୍ଯ଼କ।"
      ]
    },
    "banana": {
      "advisory": [
        "ସିଗଟୋକା ଲିଫ୍ ସ୍ପାଟ୍ଃ ସିଗଟୋକା ଲିଫ୍ ସ୍ପାଟ୍ ଏବଂ ସିଗାର ଏଣ୍ଡ୍ ରଟ୍ କିମ୍ବା ଟିପ୍ ରଟ୍ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "papaya": {
      "advisory": [
        "ୱାଇ. ଭି. ଏମ୍.: କଦଳୀ ଉପରେ ନଜର ରଖିବା ଏବଂ ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8 ନିଯ଼ୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ଲିଟର ପିଛା 5 ମିଲି. ନିମ ତେଲ (1500 ପିପିଏମ୍) ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cattle": {
      "advisory": [
        "ବାୟୁମଣ୍ଡଳରେ ବୃଦ୍ଧି ପାଉଥିବା ଆର୍ଦ୍ରତାକୁ ଦୃଷ୍ଟିରେ ରଖି ପଶୁଶାଳାଗୁଡ଼ିକରେ ଉପଯୁକ୍ତ ବାୟୁ ଚଳାଚଳ ସୁନିଶ୍ଚିତ କରନ୍ତୁ। ହାଇବ୍ରିଡ୍ ନେପିୟର୍ ଘାସ ପରି ମରୁଡ଼ି-ପ୍ରତିରୋଧକ ପଶୁଖାଦ୍ୟ କିସମ ଚାଷ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଖାଇବାକୁ ଦିଅନ୍ତୁ |"
      ]
    },
    "goat & sheep": {
      "advisory": [
        "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ୟକ ଅନୁଯାୟୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
      ]
    },
    "poultry": {
      "advisory": [
        "କୁକୁଡ଼ା ଘରେ ଉଠାଯାଇଥିବା ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ୟବସ୍ଥା ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିୟନ୍ତ୍ରଣ ବଜାୟ ରଖିବାରେ ସାହାଯ୍ୟ କରେ | ବର୍ଷା ପରେ ଅତ୍ୟଧିକ ଆର୍ଦ୍ରତା ପରିସ୍ଥିତିରେ ଜୀବାଣୁ ସୃଷ୍ଟି ନହେବା ପାଇଁ ନିୟମିତ ଭାବରେ ଘରକୁ ସଫା ଏବଂ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ | ଚାପ ହ୍ରାସ କରିବା ଏବଂ ଅତ୍ୟଧିକ ଉତ୍ତାପକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ ଷ୍ଟକିଂ ଘନତ୍ୱ ବଜାୟ ରଖନ୍ତୁ |"
      ]
    }
  },
  "date": "04-10-2024"
}