{
  "weather_details": {
    "21-09-2024": {
      "rainfall": 6,
      "t_max": 35,
      "t_min": 24,
      "rh_max": 90,
      "rh_min": 61,
      "wind_speed": 4,
      "wind_direction": 248,
      "cloud_cover": 6
    },
    "22-09-2024": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 24,
      "rh_max": 88,
      "rh_min": 62,
      "wind_speed": 5,
      "wind_direction": 72,
      "cloud_cover": 6
    },
    "23-09-2024": {
      "rainfall": 6,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 86,
      "rh_min": 58,
      "wind_speed": 5,
      "wind_direction": 198,
      "cloud_cover": 7
    },
    "24-09-2024": {
      "rainfall": 10,
      "t_max": 33,
      "t_min": 25,
      "rh_max": 90,
      "rh_min": 60,
      "wind_speed": 4,
      "wind_direction": 90,
      "cloud_cover": 7
    },
    "25-09-2024": {
      "rainfall": 12,
      "t_max": 33,
      "t_min": 24,
      "rh_max": 93,
      "rh_min": 68,
      "wind_speed": 6,
      "wind_direction": 150,
      "cloud_cover": 8
    }
  },
  "names_of_crops": [
    "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
    "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
    "କପା",
    "ଅରହର",
    "ସଂକର ମକା",
    "ପନିପରିବା",
    "ଫଳ",
    "ଗାଈ ଏବଂ ମଇଁଷି",
    "ଛେଳି ଏବଂ ମେଣ୍ଢା",
    "କୁକୁଡ଼ା ମାଂସ"
  ],
  "general_advisory": "ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ, ମିଲି ବଗ୍ ଏବଂ ଥ୍ରୀପ୍ ପରି ଶୋଷକ କୀଟପତଙ୍ଗ ସଂକ୍ରମଣ ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ (1500 ପିପିଏମ) ପ୍ରୟୋଗ କରନ୍ତୁ @3 ମିଲି/ଲିଟର ପାଣି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଶୋଷକ କୀଟ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ | ଥ୍ରୀପ୍ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ, ମିଲି ବଗ୍ ଏବଂ ବ୍ଲୁ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ @8nos./acre ସ୍ଥାପନ କରନ୍ତୁ। ପନିପରିବାରେ ଶୋଷକ କୀଟ, ଫଳ ମାଛି ଏବଂ ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଚାଷୀମାନଙ୍କୁ ଏକର ପିଛା 8ନସ୍ ବିଶିଷ୍ଟ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ଏବଂ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ଆପଣଙ୍କ ଫସଲ କ୍ଷେତ୍ରକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ |",
  "crops_data": {
    "direct seeded paddy": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ବିସ୍ଫୋରଣଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ।"
      ]
    },
    "transplanted paddy": {
      "advisory": [
        "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଉଚ୍ଚଭୂମି ସ୍ଥିତିରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମି ସ୍ଥିତିରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
        "କୀଟ ପରିଚାଳନାଃ ଷ୍ଟେମ ବୋରର ଏବଂ ଲିଫ୍ ଫୋଲଡରଃ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ସ୍ଥାପନ କରନ୍ତୁ।"
      ]
    },
    "cotton": {
      "advisory": [
        "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପତ୍ର ଲାଲ ହେବା ହ୍ରାସ କରିବା ପାଇଁ ଜଳମଗ୍ନ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 100 ଗ୍ରାମ୍ ମ୍ୟାଗ୍ନେସିୟମ୍ ସଲଫେଟ୍ ସହିତ 100 ଗ୍ରାମ୍ ୟୁରିଆ ମିଶାଇ ସ୍ପ୍ରେ କରାଯାଇପାରିବ।",
        "କୀଟ ପରିଚାଳନାଃ ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ): ଏକର ପିଛା 600-800 ମିଲି + 200 ଗ୍ରାମ୍ ଡିଟର୍ଜେଣ୍ଟ୍ ପାଉଡର ଭଳି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ପ୍ରୟୋଗ।"
      ]
    },
    "arhar": {
      "advisory": [
        "କୀଟ ପରିଚାଳନାଃ ଲିଫ୍ ୱେବର୍ଃ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜାସିଡ୍, ଥ୍ରିପ୍ସ, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ): ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଶୋଷକ କୀଟ ସାଧାରଣତଃ ଅଧିକ ସକ୍ରିଯ଼ | ନିମ ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ) ସିଞ୍ଚନ କରାଯାଇପାରେ।"
      ]
    },
    "hybrid maize": {
      "advisory": [
        "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ଯ଼ାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
        "କୀଟ ପରିଚାଳନାଃ ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ଯ଼ୁ ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ଲିଫ୍ ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ବର୍ତ୍ତମାନର ପାଣିପାଗ ଅବସ୍ଥା ହେତୁ ଦେଖାଯାଇପାରେ | ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।"
      ]
    },
    "vegetables": {
      "advisory": [
        "ବାଇଗଣଃ ଶୁଷ୍କତାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି @200-ମିଲି/ଏକର + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ଟମାଟୋଃ ନର୍ସରୀରେ ଚାଷ ପାଇଁ ଉତ୍କଳ କୁମାରୀ (ବି. ଟି.-10), ଉତ୍କଳ ଦୀପ୍ତି (ବି. ଟି.-2), ଉତ୍କଳ ରାଜା, ଉତ୍କଳ ପ୍ରଜ୍ଞାନ ଏବଂ ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ ଭଳି ଉପଯୁକ୍ତ କିସମ ବାଛନ୍ତୁ।"
      ]
    },
    "fruits": {
      "advisory": [
        "କଦଳୀଃ ସିଗଟୋକା ପତ୍ର ଦାଗ ଏବଂ ସିଗାର ଏଣ୍ଡ୍ ରଟ୍ କିମ୍ବା ଟିପ୍ ରଟ୍ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
        "ପେଁପେଃ ପେଁପେ ପତ୍ରର କର୍ଲ ଭାଇରସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ଲିଟର ପିଛା 3 ମିଲିଲିଟର ପିଛା ନିମ୍ବ ତେଲ (1500 ପିପିଏମ) ସ୍ପ୍ରେ କରନ୍ତୁ।"
      ]
    },
    "cow & buffalo": {
      "advisory": [
        "ବର୍ଷା ଦିନରେ ଘାସରେ ଆର୍ଦ୍ରତା ଅଧିକ ଥିବାରୁ ଗୋରୁମାନେ ସେଥିରୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ଶୁଖିଲା ପଦାର୍ଥ ପାଆନ୍ତି ନାହିଁ | ତେଣୁ, ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ପ୍ରତି 2 କି. ଗ୍ରା. କ୍ଷୀର ପାଇଁ 1 କି. ଗ୍ରା. ଦିଅନ୍ତୁ।"
      ]
    },
    "goat & sheep": {
      "advisory": [
        "ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ୟ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ ଏବଂ ଛେଳି ଏବଂ ଛେଳିଙ୍କୁ ମଜା କରିବା ଏବଂ ଛେଳି ମାରିବାର ଏକ ମାସ ପୂର୍ବରୁ ସନ୍ତୁଳିତ ସାନ୍ଦ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ୟାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
      ]
    },
    "poultry": {
      "advisory": [
        "ବାର୍ଡ ଫ୍ଲୁ ହେଉଛି କୁକୁଡ଼ାର ଏକ ଭୂତାଣୁଜନିତ ରୋଗ। ଏହା ଦୂଷିତ ଡେଣା, ଲାଳ, ପକ୍ଷୀଙ୍କ ବିଷ୍ଠା ମାଧ୍ଯ଼ମରେ ବ୍ଯ଼ାପିଥାଏ | ବେଳେବେଳେ ଏହା ପ୍ରଭାବିତ ପକ୍ଷୀଙ୍କଠାରୁ ମଣିଷକୁ ବ୍ଯ଼ାପିପାରେ |",
        "ଏହି ସମଯ଼ରେ ଦଯ଼ାକରି ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ଯ଼ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ।",
        "ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଏଠାରେ ଏବଂ ସେଠାରେ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ନାହିଁ। ଦୟାକରି ଗ୍ଲୋଭସ୍ ଏବଂ ମାସ୍କ ପିନ୍ଧି ସେମାନଙ୍କୁ ପୋତି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ୍ କରନ୍ତୁ।",
        "ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
      ]
    }
  },
  "date": "20-09-2024"
}