{
  "weather_details": {
    "05-10-2024": {
      "rainfall": 0,
      "t_max": 36,
      "t_min": 26,
      "rh_max": 44,
      "rh_min": 74,
      "wind_speed": 6,
      "wind_direction": 259,
      "cloud_cover": 2
    },
    "06-10-2024": {
      "rainfall": 0,
      "t_max": 36,
      "t_min": 25,
      "rh_max": 45,
      "rh_min": 79,
      "wind_speed": 5,
      "wind_direction": 270,
      "cloud_cover": 3
    },
    "07-10-2024": {
      "rainfall": 2,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 48,
      "rh_min": 77,
      "wind_speed": 5,
      "wind_direction": 160,
      "cloud_cover": 6
    },
    "08-10-2024": {
      "rainfall": 0,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 51,
      "rh_min": 92,
      "wind_speed": 6,
      "wind_direction": 156,
      "cloud_cover": 4
    },
    "09-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 49,
      "rh_min": 96,
      "wind_speed": 7,
      "wind_direction": 155,
      "cloud_cover": 4
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "ମାଟି ବାଦାମ",
    "ଓକ୍ରା",
    "ଆମ୍ବ",
    "ଗାଈ/ମଇଁଷି"
  ],
  "general_advisory": "ଯେହେତୁ ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍, ତେଣୁ କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ସହିତ କୃଷି କାର୍ଯ୍ଯ଼ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ ଇତ୍ଯ଼ାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ପାଇବା ପାଇଁ ଆର୍ଦ୍ର ମାଟିରେ ସବୁଜ ପଶୁଖାଦ୍ଯ଼ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାୟ ରଖିବା ଉଚିତ।",
        "ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ଦେଖାଦେଲେ, କୃଷକମାନେ ରୋଗ ପରିଚାଳନା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପ୍ରୋଟୋକଲ୍ ଅନୁସରଣ କରିବା ଉଚିତ୍ |",
        "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଉପଯୁକ୍ତ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ।"
      ]
    },
    "ground nut": {
      "advisory": [
        "ଚିନାବାଦାମରେ ଟିକ୍କା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସ୍ୱଚ୍ଛ ପାଣିପାଗ ସ୍ଥିତିରେ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଭେଣ୍ଡି ଫସଲରେ ଭାଇରାଲ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଭାବିତ ଗଛଗୁଡ଼ିକୁ ହଟାଇବା ଏବଂ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସମେତ ନିର୍ଦ୍ଦିଷ୍ଟ କାର୍ଯ୍ଯ଼ାନୁଷ୍ଠାନ ଗ୍ରହଣ କରାଯିବା ଉଚିତ।"
      ]
    },
    "mango": {
      "advisory": [
        "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ଅଭ୍ଯ଼ାସ ଅନୁସରଣ କରାଯିବା ଉଚିତ୍ |",
        "ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, ପତ୍ର କାଟିବା ୱିଭିଲ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କାର୍ଯ୍ଯ଼ାନୁଷ୍ଠାନ ଗ୍ରହଣ କରାଯିବା ଉଚିତ।"
      ]
    },
    "cow/buffalo": {
      "advisory": [
        "ଗାଈ ଏବଂ ମଇଁଷିରେ ପାଦ ଏବଂ ପାଟି ରୋଗର ପ୍ରତିରୋଧ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ବିସ୍ତୃତ ଭାବରେ ନିର୍ଦ୍ଦିଷ୍ଟ ପଦକ୍ଷେପ କାର୍ଯ୍ଯ଼କାରୀ କରାଯିବା ଉଚିତ।"
      ]
    }
  },
  "date": "04-10-2024"
}