{
  "weather_details": {
    "05-10-2024": {
      "rainfall": 0,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 45,
      "rh_min": 72,
      "wind_speed": 7,
      "wind_direction": 259,
      "cloud_cover": 3
    },
    "06-10-2024": {
      "rainfall": 0,
      "t_max": 35,
      "t_min": 26,
      "rh_max": 44,
      "rh_min": 69,
      "wind_speed": 6,
      "wind_direction": 270,
      "cloud_cover": 4
    },
    "07-10-2024": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 49,
      "rh_min": 75,
      "wind_speed": 5,
      "wind_direction": 160,
      "cloud_cover": 6
    },
    "08-10-2024": {
      "rainfall": 2,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 45,
      "rh_min": 87,
      "wind_speed": 6,
      "wind_direction": 156,
      "cloud_cover": 6
    },
    "09-10-2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 25,
      "rh_max": 46,
      "rh_min": 91,
      "wind_speed": 6,
      "wind_direction": 155,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "ଚାଉଳ",
    "ମାଟି ବାଦାମ",
    "ଓକ୍ରା",
    "ଆମ୍ବ",
    "ଗାଈ/ମଇଁଷି"
  ],
  "general_advisory": "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍ ଥିବାରୁ, କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ସହିତ କୃଷି କାର୍ଯ୍ୟ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ ଇତ୍ୟାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ୟ ପାଇବା ପାଇଁ ଆର୍ଦ୍ର ମାଟିରେ ସବୁଜ ପଶୁଖାଦ୍ୟ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଧାନ ଫସଲରେ କେତେକ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
  "crops_data": {
    "rice": {
      "advisory": [
        "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାୟ ରଖିବା ଉଚିତ।",
        "ବ୍ୟାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ଦେଖାଦେଲେ, କୃଷକମାନେ ନାଇଟ୍ରୋଜେନ୍ ସାର (ୟୁରିଆ/ଡିଏପି) ର ଉପର ଡ୍ରେସିଂ ବନ୍ଦ କରିବା ଉଚିତ୍।",
        "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଉପଯୁକ୍ତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବା ଉଚିତ୍।",
        "ଧାନ କ୍ଷେତରେ ଥିବା ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଉପଯୁକ୍ତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
      ]
    },
    "ground nut": {
      "advisory": [
        "ଚିନାବାଦାମରେ ଟିକ୍କା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରୋଥାଲୋନିଲ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
      ]
    },
    "okra": {
      "advisory": [
        "ଓକ୍ରା ଫସଲରେ ହଳଦିଆ ଶିରା ମୋଜାଇକ ଲକ୍ଷଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଉପଯୁକ୍ତ ଅପସାରଣ ଏବଂ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
      ]
    },
    "mango": {
      "advisory": [
        "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ଆଗାଛା, ରୋଗାକ୍ରାନ୍ତ ଏବଂ ସଂକ୍ରମିତ ଶାଖା ଏବଂ ପତ୍ରର ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
        "ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, ଉପଯୁକ୍ତ କୀଟନାଶକ ପଦକ୍ଷେପ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
      ]
    },
    "cow/buffalo": {
      "advisory": [
        "ଗାଈ ଏବଂ ମଇଁଷିରେ ପାଦ ଏବଂ ପାଟି ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ୍ |"
      ]
    }
  },
  "date": "04-10-2024"
}