{
  "names_of_crops": [
     "धान",
     "सब्जियाँ",
     "मक्का",
     "दालें",
     "गन्ना",
     "तिलहन",
     "सोयाबीन",
     "तिल",
     "अरहर मटर",
     "पशुपालन"
  ],
  "general_advisory": "पर्यावरण में अत्यधिक तापमान और आर्द्रता फसलों में बीमारियों और कीटों को जन्म देगी, इसलिए रोग नियंत्रण के लिए प्रकाश संश्लेषण, पक्षी पर्चर, फेरोमोन ट्रैप, ट्राइकोग्राम और ट्राइकोडर्मा जैसे पर्यावरण के अनुकूल कीट नियंत्रण उपायों का उपयोग करें। कम वर्षा वाले क्षेत्रों में पौधों की उचित वृद्धि के लिए पर्याप्त नमी बनाए रखें, विशेष रूप से धान की पराली और गेहूं बनने के मामले में, ताकि मिट्टी में दरारें न पड़ें। जिन क्षेत्रों में पर्याप्त वर्षा नहीं हुई है, वहां के सब्जी उत्पादकों को कम अवधि और कम पानी में भी अच्छी उपज के लिए पालक, मूली, गाजर, शलजम, चुकंदर, मेथि, धनिया आदि उगाने की सलाह दी जाती है। प्राकृतिक और जैविक खेती को बढ़ावा दिया जाना चाहिए, कृषि रसायनों का उपयोग वैज्ञानिक सलाह पर ही किया जाना चाहिए। पशु चिकित्सक की सलाह पर पशुओं को अंतःशिरा और बाहरी परजीवीरोधी दवाएं दें।",
  "crops_data": {
     "paddy": {
        "advisory": [
           "रोपण के बाद 45-50 दिन नाइट्रोजन की शेष मात्रा के साथ दूसरी टॉप ड्रेसिंग करें। यह सुनिश्चित करने के लिए विशेष ध्यान रखा जाना चाहिए कि शीर्ष-ड्रेसिंग युरिया के समय खेत में पर्याप्त नमी उपलब्ध हो।",
           "स्ट्रेस बोरर, लीफ रैप, बंका पेस्ट और हिस्पा के नियंत्रण के लिए चावल में बाइफेंथ्रिन 500 ईसी पाया गया या कुनोल्फोस 25 प्रतिशत ईसी 50 लीटर जल घोल या हाइड्रोक्लोराइड कैराटाप 48 किलोग्राम का छिड़काव करें।",
           "\"धान में जस्ता की कमी के कारण खैरा रोग होने पर जिंक सल्फेट और युरिया के घोल का छिड़काव करें।",
           "धान में पत्ती के झुलसने के लक्षणों के मामले में 500 ग्राम कॉपर ऑक्सीक्लोराइड और 45 ग्राम स्ट्रेप्टोसाइक्लिन प्रति हेक्टेयर। पानी की दर से घोल बनाकर छिड़के।",
           "वर्तमान मौसम शीथ ब्लाइट के लिए अनुकूल है, इसलिए हेक्साकोनाज़ोल को लगाया जाना चाहिए|",
           "वर्तमान जलवायु ब्राउन स्पॉट रोग के लिए अनुकूल है, इसलिए प्रकोप की स्थिति में, मैकोजेब 75 प्रतिशत डब्ल्यू, पीएच है या 2. 75 प्रतिशत डब्ल्यू. पी वॉल्यूम 500-750 लिट।",
           "चावल की किस्मों के बासमती समूह में, यदि रोग के लक्षण दिखाई देते हैं, तो पौधों को उखाड़ दें और उन्हें मिट्टी में दबा दें और 50 प्रतिशत डब्ल्यू. पी. जी. प्रति लीटर पानी के घोल में कार्बेंडाज़िम का छिड़काव करें।"
        ]
     },
     "vegetables": {
        "advisory": [
           "बैगन फसल को तने और फल देने वाले कीटों से बचाने के लिए क्लोरोएन्ट्रानिलिप्रोल रसायन। इस राशि को एक लीटर पानी में घोल लें और दिन के अंतराल पर 40-45 स्प्रे करें।",
           "बैंगन की फसल में फिमोप्सिस ब्लाइट संक्रमण को रोकने के लिए 45 दिनों के अंतराल पर 50 मिलीलीटर मात्रा/लीटर पानी। फलों को तोड़ने के बाद छिड़काव करें और 45 दिनों के बाद अगला तोड़ करें।",
           "हल्दी और अदरक में जल निकासी की व्यवस्था करें और अनुशंसित नाइट्रोजन का उपयोग करें।",
           "बुवाई के लिए नर्सरी में पत्तागोभी, मध्यम आकार की फूलगोभी, शिमला मिर्च, टमाटर आदि की बुवाई करें और पहले से बोए गए पौधों का प्रत्यारोपण करें।",
           "मीठे आलू की अनुशंसित प्रजातियों के बल्बों को लगाएं ताकि बल्बों को समय पर काटा जा सके।",
           "सब्जी की फसलों में वायरल रोगों के प्रकोप की स्थिति में, प्रभावित पौधों को खेत से हटा दें, उन्हें जला दें या उन्हें मिट्टी में दफना दें और अनुशंसित कीटनाशकों का छिड़काव करें।",
           "आलू बोने से पहले, ठंडे भंडार से 7 से 10 बीज निकालें और उन्हें छायादार स्थान पर फैलाएं और बीज रहित फली को काटकर, काटकर, काटकर, सड़े हुए बीज को अलग करें और यदि ठंडे भंडार में रखे गए बीज अंकुरित हो गए हैं तो उन्हें भी हटा दें क्योंकि अगर ऐसे बीज बोए जाते हैं तो अंकुरित बीज सूख जाएंगे और नष्ट हो जाएंगे और उन्हें खेत में फिर से अंकुरित होने में अधिक समय लगेगा। कटे हुए बीजों को टोकरी या बोरे में एक सप्ताह के लिए रखें ताकि आलू अंकुरित हो सकें।",
           "यदि बीज आलू को शीत भंडार में संग्रहीत करने से पहले उपचारित नहीं किया गया है, तो इसे शीत भंडार से हटाने के तुरंत बाद, इसे बोरिक एसिड के 3 प्रतिशत घोल में 30 मिनट के लिए उपचारित करें और इसे छायादार स्थान पर सुखाएं और अंकुरण के लिए टोकरी या बोरे में रखें। अंकुरित बीज आलू का उपचार न करें।",
           "कुफरी चंद्रमुखी और कुफरी बहार जैसी आलू की शुरुआती किस्मों की बुवाई का समय 15 सितंबर से शुरू हो गया है, इसलिए किसानों को अग्निम बीजों की व्यवस्था करनी चाहिए।"
        ]
     },
     "maize": {
        "advisory": [
           "मक्के में तना छेदक के 40 मृत पित्ती के मामले में कार्बोफुरन 3 ग्राम 20 किग्रा. या डाइमेथोएट 30 प्रतिशत ईसी 1 लीटर या कनाल्फास 25 प्रतिशत ईसी4। 50 लीरा। एक लीटर पानी में घोलकर छिड़के।",
           "क्लोरान्ट्रानिलिप्रोल 8. 5 प्रतिशत एससी को मक्के में फॉल आर्मीवर्म के प्रकोप के मामले में 0 से 20 प्रतिशत नुकसान के मामले में प्रभावी नियंत्रण के लिए पाया गया। 6 प्रतिशत + लैम्ब्डा साइहलोसिन ईसी दर से 5 प्रतिशत. लीटर पानी का छिड़काव किया जाना चाहिए।"
        ]
     },
     "pulses": {
        "advisory": [
           "उड़द और मूंग में सफेद मक्खी, टिक्स और चूसने वालों के नियंत्रण के लिए इमामेक्टिन बेजोएट 80 ग्राम। और थायमेथोक्साम को 200 लीटर पानी में घोलकर 200 मिली प्रति एकड़ की दर से छिड़काव करें।"
        ]
     },
     "sugarcane": {
        "advisory": [
           "शरद ऋतु में गन्ने की बुवाई का समय नजदीक आ रहा है, इसलिए नई रोग प्रतिरोधी गन्ने की किस्में जैसे - एस. 43235, कं 44204, को. 45023, के. एस. एच. 7234, के. एस. 78234, को, 16202, को. राज्य एस. 76233 आदि के लिए केवल स्वीकृत किस्मों के बीज गन्ना सुरक्षित करें।",
           "गन्ना अनुसंधान संस्थान, गन्ना विकास परिषद के बागान, बीज गन्ना उत्पादक किसान आदि जैसे अधिकृत स्थानों से ही बीज प्राप्त करें।",
           "यदि शरद ऋतु की बुवाई के लिए खेत खाली नहीं है, तो एसटीपी और पॉली ट्रे विधि से एक नर्सरी तैयार करें और खेत खाली होने पर पौधे लगाएं।",
           "कीटों के जैविक नियंत्रण के लिए प्रति हेक्टेयर 8-10 स्थानों पर 50,000 ट्राइकोग्राम अंडे वाले ट्राइकोकार्ड लगाएं। कार्ड को टुकड़ों में काटें और उन्हें स्ट्रिप्स की निचली सतह पर संलग्न करें|",
           "\"लाल सड़ांध रोग से प्रभावित खेतों को घेरना ताकि संक्रमित सिंचाई का पानी स्वस्थ फसलों को प्रभावित न करे।\" लाल सड़ांध रोग से प्रभावित गुच्छे/कली को हटा दें और नष्ट कर दें और उखड़े हुए क्षेत्र को ट्राइकोडर्मा और मिथाइल के ड्रेनचिंग के साथ इलाज करें। संरक्षण के लिए 2 प्रतिशत।",
           "गन्ने की एकल कली/कली चिप विधि से नर्सरी तैयार करें।"
        ]
     },
     "oilseeds": {
        "advisory": [
           "मूंगफली गंभीर सड़न और टिक्स के लिए प्रवण होते हैं, इसलिए सावधान रहें। प्रकोप होने पर खड़ी फसल पर मैनकोजेब या कार्बेंडाज़िम 50 डब्ल्यू. पी. 225 ग्राम/हेक्टेयर। या जिनेब 75 प्रतिशत घुलनशील पाउडर 2.5 किग्रा। या 3 लीटर रोगाणु 27 प्रतिशत तरल या 2 किलोग्राम रोगाणु 80 प्रतिशत। 40 दिनों के अंतराल पर 500 से 600 लीटर पानी में 2-3 बूंदों को घोल लें।",
           "मूंगफली में सफेद गाद का प्रबंधन करने के लिए, जड़ों में या सिंचाई के माध्यम से 20 ईसी4 लीटर प्रति हेक्टेयर की दर से खड़ी फसल में क्लोरपायरीफॉस डालें।",
           "यह मौसम टिक्का रोग (पत्ती के धब्बे) के लिए अनुकूल है। इस प्रकार, रोग संक्रमण की उपस्थिति पर, मैकोजेब या कार्बेंडाज़िम 50 प्रतिशत डब्ल्यू. पी. 225 ग्राम/हेक्टेयर या ज़ाइन. ई. बी. 75 प्रतिशत घुलनशील पाउडर 2.5 कि. ग्रा./हेक्टेयर।"
        ]
     },
     "soybean": {
        "advisory": [
           "\"सोयाबीन की फसल में पत्ती काटने वाले कीड़ों, रस चूसने वाले और कमरबंद के कीड़े के संक्रमण के मामले में, पानी में एथियन 50ईसी 5 लीटर पतला करके स्प्रे करें।"
        ]
     },
     "sesame": {
        "advisory": [
           "बालों वाले कैटरपिलर में पित्ती के संक्रमण के मामले में, शुरुआती चरण में अंडों/पित्ती को पत्तियों के साथ तोड़कर और उन्हें मिट्टी के तेल वाले पानी में डाल कर या क्विनलफैस 25ईसी को 5 लीटर में घोलकर छिड़काव करके अंडों को नष्ट कर दें।"
        ]
     },
     "pigeon pea": {
        "advisory": [
           "पूर्वी उत्तर प्रदेश में बाढ़ या लगातार बारिश के कारण बुवाई में देरी होने की स्थिति में सितंबर के पहले पखवाड़े में बहार और पीडीए को शुद्ध फसल के रूप में बोया जा सकता है, लेकिन एक पंक्ति से दूसरी पंक्ति की दूरी 30 डिग्री सेल्सियस और बीज की मात्रा 20 से 25 किलोग्राम से अधिक नहीं होनी चाहिए। आर. पर हे। की दर से उपयोग करें।",
           "डाइमेथोएट 30 ईसी 4 लीटर या इमिडाक्लोप्रिड स्प्रे करें।"
        ]
     },
     "animal husbandry": {
        "advisory": [
           "गायों को जलभराव वाले क्षेत्रों में जाने से रोकने और पैरों को सड़ने से रोकने के लिए, उनके घेरे में चूने डालें और पोटेशियम परमैंगनेट के एक प्रतिशत घोल से खुर और फर्श धो लें।",
           "भेड़ों और बकरियों जैसे छोटे जानवरों को पानी में भीगने से रोकें, जिससे निमोनिया का खतरा बढ़ जाता है।",
           "वर्तमान में आप जिन जानवरों की देखभाल कर रहे हैं, जन्म लेते ही उसकी नाल की विशेष ध्यान रखें।"
        ]
     }
  },
  "date": "05-09-2024"
}



