{
  "names_of_crops": [
    "धान",
    "मक्का",
    "सोयाबीन",
    "तिल",
    "गन्ना",
    "मूंगफली",
    "तुर",
    "यूआरडी-मूंग",
    "तोरिया",
    "सब्जी",
    "बागवानी",
    "पशुपालन",
    "मत्स्य पालन",
    "रेशम उत्पादन",
    "वानिकी"
  ],
  "general_advisory": "राज्य में मौसम के वर्तमान संदर्भ में, किसानों को अगले दो हफ्तों के लिए कृषि प्रबंधन के लिए निम्नलिखित सुझाव दिए गए हैंः-कम वर्षा वाले क्षेत्रों में पौधों की उचित वृद्धि के लिए पर्याप्त नमी बनाए रखें, विशेष रूप से धान की पराली और गेहूं बनने के मामले में, ताकि मिट्टी में दरारें न पड़ें। धान की फसल को शुरुआती चरणों (20-30 दिन) में खरपतवारों से अधिक नुकसान होता है। खरपतवार नियंत्रण पर विशेष ध्यान दें। खरपतवार नियंत्रण के लिए, निराई करें और जितना संभव हो सके एक पेडिकाइडर का उपयोग करें; यदि नियंत्रित नहीं किया जाता है, तो अनुशंसित जड़ी-बूटियों का उपयोग करें। पर्यावरण में अत्यधिक तापमान और आर्द्रता फसलों में बीमारियों और कीटों को जन्म देगी, इसलिए कीट नियंत्रण के लिए पर्यावरण के अनुकूल उपाय जैसे प्रकाश संश्लेषण, पक्षी पर्चर, फेरोमोन ट्रैप, ट्राइकोग्राम और रोग। नियंत्रण के लिए ट्राइकोडर्मा का उपयोग करें। जल-भराव वाले क्षेत्रों में, एक-चौथाई गोबर की खाद को मिट्टी में यूरिया की दोगुनी मात्रा में मिलाकर और शीर्ष ड्रेसिंग से पहले 24 घंटे तक रखने के बाद धान की शीर्ष ड्रेसिंग की जानी चाहिए। ऐसा करने से रिसाव से येरिया नष्ट नहीं होगा। प्राकृतिक और जैविक खेती को बढ़ावा दिया जाना चाहिए, कृषि रसायनों का उपयोग वैज्ञानिक सलाह पर ही किया जाना चाहिए।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "धान की खेती",
        "नाइट्रोजन की शेष मात्रा के एक-चौथाई के लिए, 0 पौधों के बाद 25-30 दिन पर पहला टॉपड्रेसिंग करें और 45-50 दिन पर युरिया के साथ दूसरा टॉपड्रेसिंग करें। यह सुनिश्चित करने के लिए विशेष ध्यान रखा जाना चाहिए कि शीर्ष-ड्रेसिंग युरिया के समय खेत में पर्याप्त नमी उपलब्ध हो। 0 संकर, चौड़ी पत्ती और पतंग खरपतवार के नियंत्रण के लिए, बिस्पिरिबैक सोडियम 40% SC0.20 को रोपण के बाद 20-22 दिन नम परिस्थितियों में लिया गया था। यह प्रति है। 500 एल. पानी और तनाव में घुल जाता है।"
      ]
    },
    "maize": {
      "advisory": [
        "मक्के की खेती",
        "नाइट्रोजन की कुल अनुशंसित मात्रा का एक-चौथाई भाग मक्के की बुवाई (रेशमी अवस्था) के अगले दिन शीर्ष ड्रेसिंग के रूप में दें। मक्कामे तना छेदक। कार्बोफुरान 3 ग्राम 20 कि. ग्रा. 0 मृत पत्तागोभी की उपस्थिति में. या डाइमेथोएट 30 प्रतिशत ईसी 4 एल. यह प्रति है। या कुल 25 प्रतिशत ई. सी. 50 एल। यह प्रतिलिपि है। उबलते/500-600 लीटर पानी में घोलकर छिड़के।"
      ]
    },
    "soybean": {
      "advisory": [
        "सोयाबीन की खेती",
        "सोयाबीन की फसल में पत्ती छेदक कीट, रस और कमरबंद भृंग के प्रकोप के मामले में, 500 लीटर पानी में 25ईसी 4.5 लीटर या एथियन 50ईसी 4.5 लीटर का छिड़काव करें।"
      ]
    },
    "sesame": {
      "advisory": [
        "तिल की खेती",
        "तिल (विहार के बालों वाले कैटरपिलर) में पित्ती के संक्रमण के मामले में, शुरुआती चरण में अंडों को पत्तियों के साथ तोड़कर नष्ट कर दें और उन्हें मिट्टी के तेल वाले पानी में डाल दें या 5 लीटर पानी में क्विनलफैस 25ईसी को घोलकर स्प्रे करें।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "गन्ने की खेती",
        "कीटों के जैविक नियंत्रण के लिए प्रति हेक्टेयर 8 से 10 स्थानों पर 50,000 ट्राइकोग्राम अंडे वाले ट्राइकोकार्ड लगाएं। कार्ड को टुकड़ों में काटें और उन्हें स्ट्रिप्स की निचली सतह पर संलग्न करें। इसे 10 दिनों के अंतराल पर दोहराएं।"
      ]
    },
    "groundnut": {
      "advisory": [
        "मूंगफली की खेती",
        "मूंगफली बोने के अगले दिन, एक और निराई करके खरपतवार पर नियंत्रण रखें और हल्की जुताई करते रहें। पेगिंग के दौरान खरपतवार न लगाएं। यदि सूखे की स्थिति है तो सिंचाई की जानी चाहिए। मूंगफली गंभीर सड़न और टिक्स के लिए प्रवण होते हैं, इसलिए सावधान रहें।"
      ]
    },
    "tur": {
      "advisory": [
        "तूर की खेती 0 पूर्वी उत्तर प्रदेश में बाढ़ या लगातार बारिश के कारण बुवाई में देरी होने की स्थिति में, पहली सितंबर।"
      ]
    },
    "urd-moong": {
      "advisory": [
        "उड़द-मूंग की खेती",
        "जिन किसानों ने अभी तक किसी कारण से उड़द नहीं बोया है, उन्हें इस महीने में शेखर-4, शेखर-2 और शेखर-3 की बुवाई पूरी करनी चाहिए।"
      ]
    },
    "toria": {
      "advisory": [
        "तोरिया की खेती",
        "पूरे उत्तर प्रदेश के लिए अनुशंसित टीए-9, पीटी-303, भवानी मध्य उत्तर प्रदेश के लिए अनुशंसित टाइप-36 और तराई क्षेत्र के लिए अनुशंसित पीटी-30 किस्मों के बीजों की अग्रिम व्यवस्था करें ताकि इसे सितंबर के पहले पखवाड़े में बोया जा सके।"
      ]
    },
    "vegetable": {
      "advisory": [
        "सब्जियों की खेती",
        "बुवाई के लिए नर्सरी में पत्तागोभी, मध्यम आकार की फूलगोभी, शिमला मिर्च, टमाटर आदि की बुवाई करें और पहले से बोए गए पौधों का प्रत्यारोपण करें।"
      ]
    },
    "horticulture": {
      "advisory": [
        "बागवानी",
        "उद्यानों में जल निकासी की उचित व्यवस्था करें। आम, अमरूद, आंवला, लीची और निम्बू की प्रगतिशील किस्मों के नए बागों का रोपण जल्द से जल्द पूरा करें और पहले लगाए गए बागों में किसी कारण से मर चुके पौधों को बदल दें। आम के बगीचे के पहले 10 वर्षों में उच्च लाभ के लिए आलू, मिर्च, टमाटर, फूलगोभी और ग्लेडियोलस को इंटरक्रॉप के रूप में उगाया जा सकता है।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "पशुपालन",
        "वर्तमान में 30 अगस्त तक सभी पशु चिकित्सालयों में पैर और मुंह की बीमारी (एफएमडी) और ब्रूमलोसिस का टीकाकरण किया जा रहा है। पशुओं में टीकाकरण सुनिश्चित करें। भेड़ों और बकरियों जैसे छोटे जानवरों को जलभराव वाले क्षेत्रों से बचाएँ। पानी में भिगोने के कारण भेड़ों का वजन बढ़ जाता है और वे बैठने में असमर्थ हो जाती हैं, जिससे उनके पैर की मांसपेशियां कमजोर हो जाती हैं और निमोनिया का खतरा बढ़ जाता है।"
      ]
    },
    "fisheries": {
      "advisory": [
        "मत्स्य पालन",
        "रेशम",
        "कटला, रोहू, नैन, सिल्वर कार्प और ग्रास कार्प के मछली के बीज सभी हैचरी और विभागीय मछली फार्मों में उपलब्ध हैं। मछुआरों को अपने तालाबों में मछली के बीज का भंडारण करना चाहिए। पानी की गुणवत्ता के लिए तालाब में चूने का उपयोग करें। निषेचन के दृष्टिकोण से, चूने 250 किमी/हेक्टेयर पर उपयोग के लिए उपयुक्त है। यह मछली रोग नियंत्रण में भी सहायक है।"
      ]
    },
    "sericulture": {
      "advisory": [
        "रेशम उत्पादन में रुचि रखने वाले किसानों को अपने निकटतम रेशम उत्पादन अधिकारी से संपर्क करना चाहिए। प्रभारी व्यक्ति से संपर्क करके जानकारी प्राप्त करें और कीट नियंत्रण करें।",
        "शहतूत मानसून की फसल सितंबर के पहले सप्ताह से और एरी मानसून की फसल सितंबर के दूसरे सप्ताह से शुरू हो रही है। इसके लिए कीटपाल को सभी आवश्यक तैयारी जैसे शुद्धिकरण आदि समय पर पूरी करनी चाहिए। कीट प्रबंधन भवन और उपकरणों को 2 प्रतिशत फॉर्मेलिन घोल का छिड़काव करके कीटाणुरहित किया जाना चाहिए और कीट प्रबंधन भवन को कीटाणुरहित करने के बाद 24 घंटे के लिए बंद किया जाना चाहिए।"
      ]
    },
    "forestry": {
      "advisory": [
        "वानिकी 0 पौधरोपण का काम जल्द से जल्द पूरा करें।"
      ]
    }
  },
  "date": "22-08-2024"
}