{
  "names_of_crops": [
    "paddy",
    "wheat",
    "barley",
    "oilseeds",
    "rabi maize",
    "sugarcane",
    "gram",
    "pea",
    "potato",
    "vegetables",
    "fruit",
    "animal husbandry",
    "fisheries",
    "sericulture"
  ],
  "general_advisory": "In the current scenario of weather in the state, farmers have to manage their agriculture for the next two weeks. The following recommendations are made: - n lines of general advisory.",
  "crops_data": {
    "paddy": {
      "advisory": [
        "Maintain adequate humidity for paddy cultivation.",
        "Remove unwanted plants from the field for seed paddy.",
        "Control False Smut Disease with recommended pesticides.",
        "Control insect pests like raspberry insect and soldier insect."
      ]
    },
    "wheat": {
      "advisory": [
        "Sowing time for wheat in unirrigated state is between 25 October and 0 November.",
        "Arrange seeds of recommended wheat varieties.",
        "Recommended varieties for barley for unhygienic conditions.",
        "Sow recommended varieties for oilseed crops."
      ]
    },
    "barley": {
      "advisory": [
        "Sowing time for barley in unseasonal state is from 20 October to 0 November.",
        "Recommended varieties for barley for unhygienic conditions."
      ]
    },
    "oilseeds": {
      "advisory": [
        "Sow recommended varieties for mustard/mustard in irrigated areas."
      ]
    },
    "rabi maize": {
      "advisory": [
        "Sow hybrids and complex varieties for rabi maize cultivation."
      ]
    },
    "sugarcane": {
      "advisory": [
        "Sow early high-sugar varieties of sugarcane.",
        "Prepare fields and sow sugarcane in winter season.",
        "Sow organic manure and use pressmaid fertilizer."
      ]
    },
    "gram": {
      "advisory": [
        "Sow recommended variety for non-irrigated gram."
      ]
    },
    "pea": {
      "advisory": [
        "Sow recommended pea varieties."
      ]
    },
    "potato": {
      "advisory": [
        "Prepare field and seed arrangements for main potato crop.",
        "Sow recommended potato varieties."
      ]
    },
    "vegetables": {
      "advisory": [
        "Suitable time for nursery sowing of cauliflower, cabbage, capsicum, and tomatoes for Rabi vegetable sowing.",
        "Use neem-based products and organic insecticides for pest control."
      ]
    },
    "fruit": {
      "advisory": [
        "Harvest banana leaves and stack fruit plants to prevent beetle pest infestation.",
        "Spray recommended chemicals for disease control in bananas and mangoes."
      ]
    },
    "animal husbandry": {
      "advisory": [
        "Vaccination against Foot and Mouth Disease and Lumpy Skin Disease.",
        "Feed newborn animals within two hours of birth.",
        "Consult veterinarian for anti-parasitic drugs."
      ]
    },
    "fisheries": {
      "advisory": [
        "Accumulate carp fishes in ponds.",
        "Use supplementary feed for fish load in the pond."
      ]
    },
    "sericulture": {
      "advisory": [
        "Spray insecticides for pest management in mulberry sector.",
        "Clean silkworms and transfer them to another tray for disease prevention."
      ]
    }
  },
  "date": "10-10-2024"
}