{
  "names_of_crops": [
    "गेहूँ",
    "धान",
    "मक्के",
    "जायद फसलें",
    "गन्ने",
    "सब्जियाँ",
    "बागवानी",
    "पशुपालन",
    "मत्स्य पालन",
    "रेशम उत्पादन",
    "वानिकी"
  ],
  "crops_data": {
    "wheat": {
      "advisory": [
        "देर से पकने वाले गेहूं की बुवाई जल्द से जल्द पूरी करें।",
        "मध्यम अवधि की संकर किस्मों की बुवाई करें। डाकन-407, मालवीय संकर गेहूं-2, प्रो-303 (3464), केएच-945, केएच-50, एमएमएच-69, बायो-9637, बायो-9682, एलजी-32-8, सीओएच (एम) 8 और जटिल किस्में नवजोत, पूसा कम्पोजिट-2, श्वेता व्हाइट, नवीन।",
        "यदि बीज का उपचार नहीं किया जाता है, तो पहले बीज बोने से पहले करें। 2. 5 ग्राम प्रति किलोग्राम बीज। थेरम या 2 ग्राम कार्बोंडाज़िम को 50 डब्ल्यू. पी. के साथ उपचारित किया जाना चाहिए और बाद में बीज को इमिडाक्लोप्रिड 2 ग्राम के साथ उपचारित किया जाना चाहिए।",
        "क्लोरान्ट्रानिलिप्रोल 8.5% एससी। मकाक में फॉल आर्मीवर्म के प्रकोप में 0 से 20 प्रतिशत क्षति के मामले में प्रभावी नियंत्रण के लिए 4 पाया गया। 0. 3 मि. ली. पानी या स्पिनोसैड प्रति लीटर. प्रति लीटर पानी या थायमेथोक्सम। छिड़काव 2.6% + लैम्बडेसिलोथिन 9.5%. 5 मिली प्रति लीटर पानी का घोल बनाकर किया जाना चाहिए।"
      ]
    },
    "paddy": {
      "advisory": [
        "* * * * दिन में 2-3 पौधे 3-4 सेंटीमीटर प्रति पहाड़ी की गहराई तक।",
        "धान की अल्पकालिक सुधरी हुई किस्में-सी. ओ.-5, नरेंद्र-80, मनहर, आई. आर.-50, नरेंद्र-97, पंत धान-72, बरनी दीप, सूखे सम्राट, नरेंद्र लालमती, मालवीय धान-2, मालवीय धान-97, शिया धान-5, नरेंद्र-, नरेंद्र-2 और मध्यम अवधि की किस्में-नरेंद्र-359, पंत धान-40, मालवीय धान-4, एन. डी. आर.-99304-4, सीता, सरजू-52, पंत धान-4, शिया धान-2, शिया धान-4, आई. आर.-64, नरेंद्र धान-2065।",
        "नरेंद्र लालमती, पूसा-637, एच. यू., आर-309, कस्तूरी, पूसा बासमती-4509 जैसी सुगंधित धान की किस्मों की नर्सरी शामिल करें।",
        "परती क्षेत्रों के लिए मध्यम अवधि के धान की किस्मों सी. एस. आर.-40, सी. एस. आर.-43, सी. एस. आर.-3, नरेंद्र उचार धान-2009, सी. एस. आर.-60 की नर्सरी शामिल करें।"
      ]
    },
    "maize": {
      "advisory": [
        "मक्के की देर से पकने वाली बुवाई जल्द से जल्द पूरी करें।",
        "मध्यम अवधि की संकर किस्मों की बुवाई करें। डाकन-407, मालवीय संकर मक्का-2, प्रो-303 (3464), के. एच.-945, के. एच.-50, एम. एम. एच.-69, बायो-9637, बायो-9682, एल. जी.-32-8, सी. ओ. एच. (एम) 8 और जटिल किस्में नवजोत, पूसा कम्पोजिट-2, श्वेता व्हाइट, नवीन।",
        "यदि बीज का उपचार नहीं किया जाता है, तो पहले बीज बोने से पहले करें। 2. 5 ग्राम प्रति किलोग्राम बीज। थेरम या 2 ग्राम कार्बोंडाज़िम को 50 डब्ल्यू. पी. के साथ उपचारित किया जाना चाहिए और बाद में बीज को इमिडाक्लोप्रिड 2 ग्राम के साथ उपचारित किया जाना चाहिए।",
        "क्लोरान्ट्रानिलिप्रोल 8.5% एससी। मकाक में फॉल आर्मीवर्म के प्रकोप में 0 से 20 प्रतिशत क्षति के मामले में प्रभावी नियंत्रण के लिए 4 पाया गया। 0. 3 मि. ली. पानी या स्पिनोसैड प्रति लीटर. प्रति लीटर पानी या थायमेथोक्सम। छिड़काव 2.6% + लैम्बडेसिलोथिन 9.5%. 5 मिली प्रति लीटर पानी का घोल बनाकर किया जाना चाहिए।"
      ]
    },
    "zaid crops": {
      "advisory": [
        "सिंचित क्षेत्रों में पश्चिमी उत्तर प्रदेश के लिए जैद फसलों की सबसे पुरानी ज्ञात किस्म मध्य उत्तर प्रदेश के लिए पारस (पी. ए-29), पूसा अरहर-6, पूरे उत्तर प्रदेश के लिए यू. पी. ए. एस.-20, टी. ए.-24 और पूसा-992, पी. ए.-6 है।",
        "अगर बुवाई से पहले बीज का उपचार नहीं किया जाता है तो एक किलो। 2 ग्राम बीज। थेरम, एक ग्राम कार्बोंडाज़िम या 4 ग्राम ट्राइक्रोमा +। ग्राम कार्बोक्सिन के साथ इलाज करें। बुवाई से पहले, प्रत्येक बीज को जैद फसलों के एक विशिष्ट प्रकंद संवर्धन के साथ उपचारित करें।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "गन्ने में इसके नियंत्रण के लिए कीटों का संक्रमण देखा जा रहा है। एक किलोग्राम सल्फर और 30 ग्राम चूने को 625 लीटर पानी में घोल दिया जाता है। पत्तियों पर एक दर से छिड़कें।",
        "पोक्का बोइंग रोग के नियंत्रण के लिए 0.2% का कॉपर ऑक्सीक्लोराइड या 0.0% का कार्बोंडाज़िम।",
        "घोल बना कर पत्तियों पर छिड़के।",
        "एस. सी. के क्लोरोएन्ट्रोनाइलपाइरोल 8.375 मिली का उपयोग चूहे की तीसरी पीढ़ी के कीटों से सुरक्षा के लिए किया जाता है जो गन्ने की फसल के लिए अधिक हानिकारक होते हैं। घोल को 000 लीटर पानी में घोल लें। की दर से गन्ने की लाइनों के पास उतरना।",
        "शरद ऋतु का गन्ना पकने की अवस्था में पहुँच गया है, इसलिए गन्ने को गिरने से रोकने और अवांछित पत्थरों को बाहर निकलने से रोकने के लिए गन्ने की जड़ों पर मिट्टी लगानी चाहिए।",
        "जिस खाली खेत में शरद ऋतु में गन्ना बोया जाना है, उसमें जैविक पदार्थ को बढ़ाने के लिए संरचना बोएं और 45 से 50 दिनों में इसे खेत में वापस कर दें।",
        "उच्च तापमान को देखते हुए, किसानों को दिन के अंतराल पर अपने गन्ने की सिंचाई करनी चाहिए।"
      ]
    },
    "vegetables": {
      "advisory": [
        "ग्रीन ब्लाइट और व्हाइटफ्लाई कीट के नियंत्रण के लिए अगर इमिडाक्लोप्रिड 30.5% एससी 1 मिमी है तो कद्दू की फसलें। रासायनिक और तना और फल छेदक कीट नियंत्रण के लिए एस. सी. का लिमिटेड फ्लुबेन्डिमाइड 39.35 0। घोल के रूप में प्रति लीटर पानी की मात्रा का छिड़काव करें और फलों की मक्खी की रक्षा के लिए क्यूएलओआर फेरोमोन ट्रैप 8 से 10 ट्रैप प्रति लीटर है। की दर से लागू करें।",
        "मिर्च में पत्ते के नष्ट होने और मोज़ेक वायरस रोग होने की संभावना अधिक होती है। यह रोग वेक्टर कीट व्हाइटफ्लाई या हॉपर बग द्वारा फैलता है। इसके प्रसार को रोकने के लिए, आवश्यकता के अनुसार 40 से 42 दिनों के अंतराल पर प्रति लीटर पानी में इमिडाक्लोरोपिड 30.5% SC4.0 दवा का छिड़काव करें और संक्रमित पौधों को उखाड़कर जला दें या उन्हें मिट्टी में दफना दें।",
        "रासायनिक क्लोरान्ट्रानिलिप्रोल का उपयोग बैंगन की फसल को तने और फल देने वाले कीटों से बचाने के लिए किया जाता था। 0 मिला। इस राशि को एक लीटर पानी में घोल लें और दिन के अंतराल पर 40-5 स्प्रे करें।",
        "भिंडी की फसल में सफेद मक्खी की रोकथाम के लिए, संक्रमित पौधों को उखाड़कर जलाया जाना चाहिए या मिट्टी में दफनाया जाना चाहिए और रोग ले जाने वाले कीट का नीला चिपचिपा जाल प्रति एकड़ 8 से 10 जाल होना चाहिए। इसे रासायनिक उपचार पर रखें जिसमें इमिडाक्लोप्रिड 30.5% SC होता है। 0 मिलीग्राम. घोल बनाकर प्रति लीटर पानी में रसायन का छिड़काव करें।"
      ]
    },
    "horticulture": {
      "advisory": [
        "आमों में, नियमित अंतराल पर सिंचाई करके बगीचों को नम रखें।",
        "फलों के बगीचों के रोपण के लिए, मई के महीने में कंद भरने के लिए, मिट्टी के ऊपरी आधे हिस्से में गोबर की सड़ी हुई खाद मिलाएं और इसे जमीन की सतह से 5 से 20 सेंटीमीटर तक भरें।",
        "फल मक्खियों के नियंत्रण के लिए, गंध तरल पदार्थ को बदला जाना चाहिए और एकत्रित मक्खियों को हटा दिया जाना चाहिए और फेंक दिया जाना चाहिए।",
        "फलों की भंडारण क्षमता बढ़ाने के लिए, चौसा किस्म और अन्य देर से पकने वाली किस्मों की कटाई से पहले 40 दिनों के अंतराल पर डायहाइड्रेटेड कैल्शियम क्लोराइड (227 ग्राम) के तीन स्प्रे किए जाने चाहिए। फलों को पकने पर सुबह या शाम को 8-40 मिमी के डंठल से तोड़ना चाहिए। फलों को सुबह और दोपहर में तोड़ने से उन्हें खेत की गर्मी (दोपहर की गर्मी) से बचाकर भंडारण अवधि बढ़ाई जा सकती है।",
        "आमों को 750 पीपीएम ईथरल (पीपी) का उपयोग करके समान रूप से पकाया जाता है। 8 मिली/एल) गुनगुने पानी (52+2 * सेमी3) को घोल में 5 मिनट के लिए भिगोना चाहिए और फिर शाम को सुखाने के बाद संग्रहीत किया जाना चाहिए। इसमें (0.5 ग्राम/लीटर) कॉर्बेंडाज़िम या थियोफेनेट मिथाइल मिलाने से अन्य कवक भी नष्ट हो जाते हैं और आम अच्छी तरह पक जाता है।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "जानवरों में ब्रूसेला और एफएमडी और एचएस का मुफ्त टीकाकरण चल रहा है, इसलिए जानवरों का टीकाकरण करवाएं। जानवर को पीने के लिए बहुत सारा साफ पानी दें। दूध देने से पहले पशुओं को सुबह और शाम को नहलाएं, ताकि पशुओं में दूध उत्पादन पर प्रतिकूल प्रभाव न पड़े। जानवरों को लू से बचाने के लिए, जूट की कटाई या बोरे को शेड के चारों ओर बांध दिया जाना चाहिए और पानी का लगातार छिड़काव किया जाना चाहिए, ताकि जानवरों को लू से बचाया जा सके।",
        "वेरब्रमण में खरिफ चारा फसलों की बुवाई का समय निकट है। सभी पशुपालकों/किसानों को खेत की तैयारी शुरू करनी चाहिए और उन्नत किस्म के बीजों की व्यवस्था करनी चाहिए और उन्हें समय पर बोना चाहिए।",
        "मुर्गियों को गर्मियों में अपने बाड़े का तापमान 8.26 डिग्री सेल्सियस पर रखना चाहिए, ताकि उन्हें अपने शेड की छत पर बोरे रखकर और हर आधे से एक घंटे में एक स्प्रिंकलर से ठंडा करके इसे कम किया जा सके।",
        "धूप में जलने से बचने के लिए जानवरों को दोपहर में छायादार जगह पर बांधना चाहिए और केवल सुबह और शाम को चराना चाहिए।",
        "दोपहर में नहाने और जानवरों को चराने से बचें।",
        "पशुओं को हरा चारा खिलाना सुनिश्चित करें, सूखे हुए पशुओं को हरा चारा (विशेष रूप से ज्वार) न खिलाएं क्योंकि पशु उसमें एचसीएन (जहरीले पदार्थ) की अधिकता से बीमार हो सकता है।",
        "चालू मौसम में उच्च तापमान के कारण, जानवरों को निर्जलीकरण की समस्या हो सकती है। इसे रोकने के लिए जानवर को खनिज-नमक का मिश्रण खिलाएं।"
      ]
    },
    "fisheries": {
      "advisory": [
        "तालाब बनाने का सबसे अच्छा समय तब होता है जब किसान जो एक नया तालाब बनाना चाहते हैं या अपने तालाब में सुधार करना चाहते हैं, वे 20 जून तक निर्माण पूरा कर लें और आगामी मछली पकड़ने के मौसम की तैयारी करें। इसके लिए मत्स्य विभाग से संपर्क करें।",
        "मछली के बीज उत्पादकों को प्रतिदिन शरीर के वजन के दो प्रतिशत की दर से अपनी संतान की मछली की खुराक देनी चाहिए, साथ ही विटामिन ई से भरपूर आहार भी खाना चाहिए।",
        "कटला, रोहू और नैन किस्मों में परिपक्वता आई है। तालाब का जल स्तर 5 से 6 फीट पर रखें। जिन मछली बीज उत्पादकों ने अभी तक नर्सरी तैयार नहीं की है, उन्हें जल्द ही नर्सरी तैयार करनी चाहिए। कटला, रोहू, नैन प्रजातियों के उत्प्रेरित प्रजनन का समय आ गया है। हैचरी मालिकों को मानसून के आने के पूर्वानुमान पर विशेष ध्यान देना चाहिए। 20 जून से कटला, रोहू, नैन जैसी मछली प्रजातियों के प्रजनन को उत्प्रेरित करें। सिल्वर कार्प और ग्रास कार्प मछली प्रजातियों के मछली के बीज वर्तमान में उत्तर प्रदेश मत्स्य विकास निगम और निजी क्षेत्र में उपलब्ध हैं, इसलिए मछली किसानों को मछली के बीज एकत्र करने के लिए जिला कार्यालय से संपर्क करना चाहिए।",
        "थाई मुगुर मछली पालन प्रतिबंधित है। इसका पालन न करें।"
      ]
    },
    "sericulture": {
      "advisory": [
        "प्यूपा को ठंडा रखें ताकि इसे टसर के अनाज के भंडार में संरक्षित कुओं में जीवित रखा जा सके।",
        "सिंचित क्षेत्र में शहतूत के पौधों और शहतूत/अर्जुन नर्सरी की नियमित रूप से सिंचाई करें।",
        "बिना संदूषित क्षेत्र में शहतूत/अर्जुन के पौधों के आसपास मल्चिंग करके मल्च को संरक्षित करने का प्रयास करें। रेशम के खेतों की रक्षा के लिए बबूल की बाड़ बनाने के लिए खेतों के चारों ओर एक खाई में बबूल के बीज बोएं।",
        "शहतूत के रेशम के खेतों में छंटाई शुरू करें।",
        "नए क्षेत्र में पेड़ लगाने के लिए मिट्टी का काम पूरा किया जाना चाहिए।"
      ]
    },
    "forestry": {
      "advisory": [
        "पौधरोपण के लिए गड्ढों की खुदाई जल्द से जल्द पूरी करें। 2 से 3 सेंटीमीटर मिट्टी के साथ 0 से 5 किलो सड़े हुए गोबर की खाद मिलाएं। मीटर की ऊँचाई तक गड्ढों को भरें। बांसुरी विधि से बांस लगाने का अभ्यास करें।",
        "रोपण से पहले, पौधों को नर्सरी से हटा दें और उन्हें 10 से 20 दिनों के लिए विश्राम अवधि में रखें। पौधों को छायादार स्थान पर रखें और फव्वारे की विधि से हल्की सिंचाई करें। पौधशाला से पौधों के साथ-साथ पौधों को भी हटा दें।",
        "प्रत्यारोपण के लिए आवश्यक पौधे प्राप्त करें।"
      ]
    }
  },
  "date": "13-06-2024"
}