{
  "names_of_crops": [
    "paddy",
    "vegetables",
    "maize",
    "pulses",
    "wheat",
    "horticulture",
    "animal husbandry",
    "fisheries",
    "sericulture",
    "forestry"
  ],
  "general_advisory": "Excessive temperature and humidity in the environment will lead to diseases and pests in crops, so use eco-friendly pest control measures such as photosynthesis, bird percher, pheromone traps, trichogramma, and trichoderma for disease control. Maintain sufficient moisture for proper plant growth in areas of low rainfall, especially in the case of paddy stubble and wheat formation, so that cracks do not form in the soil. Vegetable growers in areas that have not received adequate rainfall are advised to grow spinach, radish, carrot, turnip, beetroot, fenugreek, coriander, etc. for good yield even in short duration and less water. Natural and organic farming should be promoted, agrochemicals should be used on scientific advice only as recommended. Give intravenous and external anti-parasitic drugs to animals on the advice of a veterinarian. Early potato sowing will start from 45th September, so remove the potato from the cold storage and treat it.",
  "crops_data": {
    "paddy": {
      "advisory": [
        "Do a second top dressing with the remaining amount of nitrogen on the 45-50 day after planting. Particular care should be taken to ensure that sufficient moisture is available in the field when top-dressing urea.",
        "Bifenthrin 0% EC500 was found in 0 rice for the control of stress borer, leaf wrap, bunca pest, and hispa. It is per. Or spray Cunolfos 25% EC50 litre 500 litre water solution or Karatap Hydrochloride 4G 48 kg. Mixing the gram quantity with sand or urea gives 3 to 5 C. Soak in lukewarm water.",
        "On occurrence of khaira disease due to zinc deficiency of paddy, 05 to 40 kg. Spray a solution of zinc sulphate and 2% urea per hectare.",
        "500 gm of copper oxychloride and 45 gm of streptocycline per hectare in case of symptoms of leaf scorch in 0 paddy. Sprinkle by making a solution at the rate of water.",
        "The current weather is favorable for sheath blight, so hexaconazole should be applied to 5. 0 E.C. when outbreaks appear. 0 lit. Take the quantity 500-750. Dissolve in water and strain.",
        "The current climate is favourable for brown spot disease, so in the event of an outbreak, Macozeb is 75% W, PH. Or 2. 0 kg of 75% w.p. Volume 500-750 lit. Dissolve in water and strain.",
        "In the Basmati group of rice varieties, if symptoms of the disease appear, uproot the plants and press them into the soil and spray Carbendazim in a solution of 50% w.p.g per litre of water."
      ]
    },
    "vegetables": {
      "advisory": [
        "Chloroantraniliprole chemical to protect the brinjal crop from stem and fruiting pests. Got 0. Dissolve the amount in a liter of water and spray at 40-45 day intervals.",
        "Spray a solution of thiophenate methyl with 1. 00 to 4. 50 ml quantity / l water at an interval of 45 days to prevent phimopsis blight infestation in brinjal crop. Spray the fruits after plucking and do the next plucking after 45 days.",
        "Make drainage arrangements in turmeric and ginger and use nitrogen as recommended.",
        "Sow cabbage, medium-sized cauliflower, capsicum, tomatoes, etc. in the nursery for sowing and transplant the pre-sown seedlings.",
        "Finish the transplantation of parwal boll-bearing vines as soon as possible.",
        "Plant the bulbs of the recommended species of sweet potato so that the bulbs can be harvested in time.",
        "Plant the prepared seeds of brinjal and chillies on the beds.",
        "In the event of an outbreak of viral diseases in vegetable crops, remove the affected plants from the field, burn them or bury them in the soil and spray the recommended intravenous insecticides.",
        "Before sowing potatoes, take 7 to 10 seeds out of the cold storage and spread them in a shady place and separate them by sorting out the seed pods which are seedless (unfertilized), cut, cut, rotten and if the seeds stored in the cold storage have sprouted then also remove them because if such seeds are sown then the sprouts will dry up and perish and it will take more time for them to germinate again in the field."
      ]
    },
    "maize": {
      "advisory": [
        "Carbofuran 3g 20 kg in case of 40 dead hives of stem borer in maize. or dimethoate 30% EC 1.0 l. It is per. Or Qnalfas 25 per cent EC4. 50 lire. This is the copy. Sprinkle by dissolving in a liter of water.",
        "For organic pest control, attach Trichogramma egg-containing trichocards at the rate of 50000 per acre on the lower surface of the leaves twice at an interval of 5-6 days.",
        "Chlorantraniliprole 8. 5% SC. 0. 4 was found for effective control in case of 0 to 20% damage in case of outbreak of fall armyworm in maize. 0. 3 ml of water or spinosad per litre. Water or thiamethoxamine at the rate of 2. 6% + lambda cyhalosine at the rate of 9. 5% .5 ml per litre of water should be sprayed."
      ]
    },
    "pulses": {
      "advisory": [
        "Imammectin Bezoate 80g for control of whitefly, ticks and suckers in urad and moong. And spray thiamethoxam at the rate of 200 ml per acre by dissolving it in 200 litres of water."
      ]
    },
    "wheat": {
      "advisory": [
        "Peanuts are prone to severe rot and ticks, so be careful. Mancozeb or Carbendazim 50 WP 225 g / ha on standing crop on outbreak. Or jineb 75% soluble powder 2.5 kg. Or 3 litres of germ 27% liquid or 2 kg of germ 80%. Dissolve 2 - 3 drops in 500 to 600 litres of water at an interval of 40 days.",
        "To manage white silt in groundnut, add chlorpyrifos to the standing crop at the rate of 20 EC4 litres per hectare either in the roots or through irrigation.",
        "This season is favourable for tikka disease (leaf spot). Thus, on the appearance of the disease infection, macozeb or carbendazim 50% WP 225 g / ha or ZINEB 75% soluble powder 2.5 kg / ha. 2 / kg per hectare or 80% germination. Dissolve 2 to 3 drops of K in 500-600 litres of water at 10-day intervals."
      ]
    },
    "horticulture": {
      "advisory": [
        "Cut off the remaining buds, leaving a sword leaf in the banana and stacking (support) in the fruit plants.",
        "Spray copper oxychloride (6 to 8 grams per liter of water) and apply the recommended amount of fertilizers to the plates to control the foliage and anthracnose disease in bananas.",
        "Bananas are infested with beetles in the current season for which monocrotophos (. Spray 25 ml per litre of water) or add carbofuran at the rate of 3 to 4 gm per plant in the sieve and in the soil.",
        "In new orchards of mango, guava, amla, litchi, and lemon, replace plants that have died for some reason with new ones. Potatoes, chillies, tomatoes, cauliflower and gladiolus can be grown as intercrops for higher returns in the first 0 years of the mango orchard.",
        "Spray dimethoate at the rate of 2 ml / l or cunulfas at the rate of 2 ml / l at an interval of 45 days for the prevention of branch knot pests and tent caterpillars.",
        "Spray copper oxychloride (3 g / l water) to control red rust and anthracnose in mangoes.",
        "Spray amla with borax (6 gm per litre of water) to prevent yeast infection."
      ]
    },
    "animal husbandry": {
      "advisory": [
        "To prevent cows from moving into waterlogged areas and preventing foot rot, add lime to their enclosures and wash hoofs and floors with a one percent solution of potassium permanganate.",
        "Keep small animals such as sheep and goats from getting wet in the water, which increases the risk of pneumonia.",
        "Take special care of the animals you currently care for. The placenta of an animal as soon as it is born. Tie with a thread at 5 to 2 inches, cut with a new blade and use tincture iodine."
      ]
    },
    "fisheries": {
      "advisory": [
        "Fish seeds of katla, rohu, nain species and fish seeds of silver carp and grass carp fish species are currently available in the UP Fisheries Development Corporation and private sector, so fish farmers should contact the district office and collect fish seeds. This is the best time to stock fish.",
        "For fish growth, supplements should be used at 4 to 2 percent of the weight of the fish. Fish should be fed in one place for as long as possible.",
        "During the rainy season, it is necessary to eradicate the aquatic plants of the pond. This plant exploits the nutrients available in the pond."
      ]
    },
    "sericulture": {
      "advisory": [
        "Since pest management of monsoon commercial crops is in progress in the mulberry sector, it is advisable for the pest controllers to spray Vetter or RKO on the pests 30 minutes before the first feeding after the pests come out of the molt to prevent pest infestation. Maintain the required temperature and humidity.",
        "Correctly spread the silkworms in the insecticide tray and clean the silkworms by transferring them to another tray using a cleaning net.",
        "Autumn crop mulberry silk puzzle is going to start between 20th to 25th September, for this purpose, pest control buildings, equipment like insect control trays, insect control racks, chopping boards, cleaning net feeding stands, etc. should be sanitized with 5% bleaching powder solution or 1% chlorine dioxide (Sanitech) and the pest control building should be cleaned carefully by mixing 200 grams of bleaching powder in 40 kg lime solution."
      ]
    },
    "forestry": {
      "advisory": [
        "Gap filling should be done in place of the plants that have died after plantation."
      ]
    }
  },
  "date": "05-09-2024"
}