{
  "names_of_crops": [
    "धान",
    "गेहूँ",
    "जौ",
    "तिलहन",
    "रबी मक्का",
    "गन्ना",
    "ग्राम",
    "मटर",
    "आलू",
    "सब्जियाँ",
    "फल।",
    "पशुपालन",
    "मत्स्य पालन",
    "रेशम उत्पादन"
  ],
  "general_advisory": "राज्य में मौसम के वर्तमान परिदृश्य में, किसानों को अगले दो हफ्तों के लिए अपनी कृषि का प्रबंधन करना होगा। निम्नलिखित सिफारिशें की जाती हैंः-सामान्य सलाह की पंक्तियाँ।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "धान की खेती के लिए पर्याप्त आर्द्रता बनाए रखें।",
        "बीज धान के लिए खेत से अवांछित पौधों को हटा दें।",
        "अनुशंसित कीटनाशकों के साथ गलत स्मट रोग को नियंत्रित करें।",
        "रास्पबेरी कीट और सैनिक कीट जैसे कीट कीटों को नियंत्रित करें।"
      ]
    },
    "wheat": {
      "advisory": [
        "असिंचित राज्य में गेहूँ की बुवाई का समय 25 अक्टूबर से 0 नवंबर के बीच है।",
        "अनुशंसित गेहूँ की किस्मों के बीजों की व्यवस्था करें।",
        "अस्वच्छ स्थितियों के लिए जौ के लिए अनुशंसित किस्में।",
        "तिलहन फसलों के लिए अनुशंसित किस्मों की बुवाई करें।"
      ]
    },
    "barley": {
      "advisory": [
        "बेमौसम अवस्था में जौ की बुवाई का समय 20 अक्टूबर से 0 नवंबर तक है।",
        "अस्वच्छ स्थितियों के लिए जौ के लिए अनुशंसित किस्में।"
      ]
    },
    "oilseeds": {
      "advisory": [
        "सिंचित क्षेत्रों में सरसों/सरसों के लिए अनुशंसित किस्मों की बुवाई करें।"
      ]
    },
    "rabi maize": {
      "advisory": [
        "रबी मक्के की खेती के लिए संकर और जटिल किस्मों की बुवाई करें।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "गन्ने की प्रारंभिक उच्च-चीनी किस्मों की बुवाई करें।",
        "सर्दियों के मौसम में खेत तैयार करें और गन्ने की बुवाई करें।",
        "जैविक खाद बोएँ और प्रेसमेड उर्वरक का उपयोग करें।"
      ]
    },
    "gram": {
      "advisory": [
        "गैर-सिंचित चना के लिए अनुशंसित किस्म की बुवाई करें।"
      ]
    },
    "pea": {
      "advisory": [
        "मटर की अनुशंसित किस्मों की बुवाई करें।"
      ]
    },
    "potato": {
      "advisory": [
        "आलू की मुख्य फसल के लिए खेत और बीज की व्यवस्था तैयार करें।",
        "आलू की अनुशंसित किस्मों की बुआई करें।"
      ]
    },
    "vegetables": {
      "advisory": [
        "रबी सब्जी की बुवाई के लिए फूलगोभी, पत्तागोभी, शिमला मिर्च और टमाटर की नर्सरी बुवाई के लिए उपयुक्त समय।",
        "कीट नियंत्रण के लिए नीम आधारित उत्पादों और जैविक कीटनाशकों का उपयोग करें।"
      ]
    },
    "fruit": {
      "advisory": [
        "भृंग कीट संक्रमण को रोकने के लिए केले के पत्तों की कटाई करें और फलों के पौधों को ढेर करें।",
        "केले और आमों में रोग नियंत्रण के लिए अनुशंसित रसायनों का छिड़काव करें।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "पैर और मुंह की बीमारी और गांठदार त्वचा की बीमारी के खिलाफ टीकाकरण।",
        "जन्म के दो घंटे के भीतर नवजात पशुओं को खाना खिलाएं।",
        "परजीवीरोधी दवाओं के लिए पशु चिकित्सक से परामर्श लें।"
      ]
    },
    "fisheries": {
      "advisory": [
        "तालाबों में कार्प मछलियों को इकट्ठा करें।",
        "तालाब में मछली के भार के लिए पूरक चारा का उपयोग करें।"
      ]
    },
    "sericulture": {
      "advisory": [
        "शहतूत क्षेत्र में कीट प्रबंधन के लिए कीटनाशकों का छिड़काव करें।",
        "रेशम के कीड़ों को साफ करें और रोग की रोकथाम के लिए उन्हें दूसरे ट्रे में स्थानांतरित करें।"
      ]
    }
  },
  "date": "10-10-2024"
}