{
  "names_of_crops": [
    "धान",
    "सब्जियाँ",
    "मक्का",
    "दालें",
    "बागवानी",
    "पशुपालन",
    "मत्स्य पालन",
    "रेशम उत्पादन",
    "वानिकी"
  ],
  "general_advisory": "पर्यावरण में अत्यधिक तापमान और आर्द्रता फसलों में बीमारियों और कीटों को जन्म देगी, इसलिए रोग नियंत्रण के लिए प्रकाश संश्लेषण, पक्षी पर्चर, फेरोमोन ट्रैप, ट्राइकोग्राम और ट्राइकोडर्मा जैसे पर्यावरण के अनुकूल कीट नियंत्रण उपायों का उपयोग करें। कम वर्षा वाले क्षेत्रों में पौधों की उचित वृद्धि के लिए पर्याप्त नमी बनाए रखें, विशेष रूप से धान की पराली और गेहूं बनने के मामले में, ताकि मिट्टी में दरारें न पड़ें। जिन क्षेत्रों में पर्याप्त वर्षा नहीं हुई है, वहां के सब्जी उत्पादकों को कम अवधि और कम पानी में भी अच्छी उपज के लिए पालक, मूली, गाजर, शलजम, चुकंदर, मेथि, धनिया आदि उगाने की सलाह दी जाती है। प्राकृतिक और जैविक खेती को बढ़ावा दिया जाना चाहिए, कृषि रसायनों का उपयोग वैज्ञानिक सलाह पर ही किया जाना चाहिए। पशु चिकित्सक की सलाह पर पशुओं को अंतःशिरा और बाहरी परजीवीरोधी दवाएं दें। आलू की बुवाई 45 सितंबर से शुरू हो जाएगी, इसलिए आलू को शीत भंडार से हटा दें और इसका उपचार करें।",
  "crops_data": {
    "paddy": {
      "advisory": [
        "रोपण के बाद 45-50 दिन नाइट्रोजन की शेष मात्रा के साथ दूसरी टॉप ड्रेसिंग करें। यह सुनिश्चित करने के लिए विशेष ध्यान रखा जाना चाहिए कि शीर्ष-ड्रेसिंग युरिया के समय खेत में पर्याप्त नमी उपलब्ध हो।",
        "स्ट्रेस बोरर, लीफ रैप, बंका पेस्ट और हिस्पा के नियंत्रण के लिए 0 चावल में बाइफेंथ्रिन 0 प्रतिशत ईसी 500 पाया गया। यह प्रति है। या कुनोल्फोस 25 प्रतिशत ईसी50 लीटर 500 लीटर जल घोल या कैराटाप हाइड्रोक्लोराइड 4जी 48 किलोग्राम का छिड़काव करें। चना की मात्रा को रेत या यूरिया के साथ मिलाने से 3 से 5 डिग्री सेल्सियस मिलता है। गुनगुने पानी में भिगो दें।",
        "\"धान में जस्ता की कमी के कारण खैरा रोग होने पर 05 से 40 किलो। जिंक सल्फेट और 2 प्रतिशत युरिया प्रति हेक्टेयर के घोल का छिड़काव करें।",
        "0 धान में पत्ती के झुलसने के लक्षणों के मामले में 500 ग्राम कॉपर ऑक्सीक्लोराइड और 45 ग्राम स्ट्रेप्टोसाइक्लिन प्रति हेक्टेयर। पानी की दर से घोल बनाकर छिड़के।",
        "वर्तमान मौसम शीथ ब्लाइट के लिए अनुकूल है, इसलिए हेक्साकोनाज़ोल को 5 पर लगाया जाना चाहिए। 0 ई. सी. जब प्रकोप दिखाई देता है। 0 लीटर। मात्रा 500-750 लें। इसे पानी में घोल कर छान लें।",
        "वर्तमान जलवायु ब्राउन स्पॉट रोग के लिए अनुकूल है, इसलिए प्रकोप की स्थिति में, मैकोजेब 75 प्रतिशत डब्ल्यू, पीएच है। या 2. 75 प्रतिशत डब्ल्यू. पी. का 0 किग्रा। वॉल्यूम 500-750 लिट। इसे पानी में घोल कर छान लें।",
        "चावल की किस्मों के बासमती समूह में, यदि रोग के लक्षण दिखाई देते हैं, तो पौधों को उखाड़ दें और उन्हें मिट्टी में दबा दें और 50 प्रतिशत डब्ल्यू. पी. जी. प्रति लीटर पानी के घोल में कार्बेंडाज़िम का छिड़काव करें।"
      ]
    },
    "vegetables": {
      "advisory": [
        "बैगन फसल को तने और फल देने वाले कीटों से बचाने के लिए क्लोरोएन्ट्रानिलिप्रोल रसायन। 0 मिला। इस राशि को एक लीटर पानी में घोल लें और दिन के अंतराल पर 40-45 स्प्रे करें।",
        "1 के साथ थियोफेनेट मिथाइल के घोल का छिड़काव करें। 00 से 4 तक। बैंगन की फसल में फिमोप्सिस ब्लाइट संक्रमण को रोकने के लिए 45 दिनों के अंतराल पर 50 मिलीलीटर मात्रा/लीटर पानी। फलों को तोड़ने के बाद छिड़काव करें और 45 दिनों के बाद अगला तोड़ करें।",
        "हल्दी और अदरक में जल निकासी की व्यवस्था करें और अनुशंसित नाइट्रोजन का उपयोग करें।",
        "बुवाई के लिए नर्सरी में पत्तागोभी, मध्यम आकार की फूलगोभी, शिमला मिर्च, टमाटर आदि की बुवाई करें और पहले से बोए गए पौधों का प्रत्यारोपण करें।",
        "परवाल बोल-असर वाली बेलों का प्रत्यारोपण जल्द से जल्द पूरा करें।",
        "मीठे आलू की अनुशंसित प्रजातियों के बल्बों को लगाएं ताकि बल्बों को समय पर काटा जा सके।",
        "बेड पर बैंगन और मिर्च के तैयार बीज लगाएं।",
        "सब्जी की फसलों में वायरल रोगों के प्रकोप की स्थिति में, प्रभावित पौधों को खेत से हटा दें, उन्हें जला दें या उन्हें मिट्टी में दफना दें और अनुशंसित अंतःशिरा कीटनाशकों का छिड़काव करें।"
      ]
    },
    "maize": {
      "advisory": [
        "मक्के में तना छेदक के 40 मृत पित्ती के मामले में कार्बोफुरन 3 ग्राम 20 किग्रा. या डाइमेथोएट 30 प्रतिशत ईसी 1 लीटर। यह प्रति है। या कनाल्फास 25 प्रतिशत ईसी4। 50 लीरा। यह प्रतिलिपि है। एक लीटर पानी में घोलकर छिड़के।",
        "जैविक कीट नियंत्रण के लिए, 5-6 दिनों के अंतराल पर दो बार पत्तियों की निचली सतह पर 50,000 प्रति एकड़ की दर से ट्राइकोग्राम अंडा युक्त ट्राइकोकार्ड संलग्न करें।",
        "क्लोरान्ट्रानिलिप्रोल 8. 5 प्रतिशत एससी। 0. 4 को मक्के में फॉल आर्मीवर्म के प्रकोप के मामले में 0 से 20 प्रतिशत नुकसान के मामले में प्रभावी नियंत्रण के लिए पाया गया। 0. 3 मिलीलीटर पानी या स्पिनोसैड प्रति लीटर। 2 की दर से पानी या थायमेथोक्सामाइन। 6 प्रतिशत + लैम्ब्डा साइहलोसिन 9 की दर से। 5 प्रतिशत. 5 मिली प्रति लीटर पानी का छिड़काव किया जाना चाहिए।"
      ]
    },
    "pulses": {
      "advisory": [
        "उड़द और मूंग में सफेद मक्खी, टिक्स और चूसने वालों के नियंत्रण के लिए इमामेक्टिन बेजोएट 80 ग्राम। और थायमेथोक्साम को 200 लीटर पानी में घोलकर 200 मिली प्रति एकड़ की दर से छिड़काव करें।"
      ]
    },
    "horticulture": {
      "advisory": [
        "केले में तलवार का पत्ता छोड़ कर और फलों के पौधों में ढेर (सहारा) करके शेष कलियों को काट लें।",
        "कॉपर ऑक्सीक्लोराइड (6 से 8 ग्राम प्रति लीटर पानी) का छिड़काव करें और केले में पत्ते और एंथ्रेक्नोज़ रोग को नियंत्रित करने के लिए प्लेटों पर उर्वरकों की अनुशंसित मात्रा लागू करें।",
        "केले वर्तमान मौसम में भृंगों से पीड़ित होते हैं जिसके लिए मोनोक्रोटोफोस (। 25 मिली प्रति लीटर पानी का छिड़काव करें) या चलनी में और मिट्टी में 3 से 4 ग्राम प्रति पौधे की दर से कार्बोफुरन डालें।",
        "आम, अमरूद, आंवला, लीची और निम्बू के नए बगीचों में, किसी कारण से मर चुके पौधों को नए पौधों से बदल दें। आम के बगीचे के पहले 0 वर्षों में उच्च लाभ के लिए आलू, मिर्च, टमाटर, फूलगोभी और ग्लेडियोलस को इंटरक्रॉप के रूप में उगाया जा सकता है।",
        "शाखा गाँठ कीटों और तम्बू कैटरपिलर की रोकथाम के लिए 45 दिनों के अंतराल पर 2 मिली/एल की दर से डाइमेथोएट या कुनल्फास का छिड़काव करें।",
        "आमों में लाल जंग और एंथ्राकनोज़ को नियंत्रित करने के लिए कॉपर ऑक्सीक्लोराइड (3 ग्राम/लीटर पानी) का छिड़काव करें।",
        "खमीर संक्रमण को रोकने के लिए बोरेक्स (6 ग्राम प्रति लीटर पानी) के साथ आंवले का छिड़काव करें।",
        "कैंसर रोग को रोकने के लिए नींबू में कॉपर ऑक्सीक्लोराइड 3 ग्राम या स्ट्रेप्टोसाइक्लिन 600 मिलीग्राम प्रति लीटर पानी का घोल छिड़कें।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "गायों को जलभराव वाले क्षेत्रों में जाने से रोकने और पैरों को सड़ने से रोकने के लिए, उनके घेरे में चूने डालें और पोटेशियम परमैंगनेट के एक प्रतिशत घोल से खुर और फर्श धो लें।",
        "भेड़ों और बकरियों जैसे छोटे जानवरों को पानी में भीगने से रोकें, जिससे निमोनिया का खतरा बढ़ जाता है।",
        "वर्तमान में आप जिन जानवरों की देखभाल कर रहे हैं, उनका विशेष ध्यान रखें। के जन्म लेते ही उसकी नाल। 5 से 2 इंच के धागे से बांधें, एक नए ब्लेड से काटें और टिंचर आयोडीन का उपयोग करें।",
        "हरे चारे को धोएँ और खिलाएँ ताकि परजीवी चारे के साथ में प्रवेश न करे।"
      ]
    },
    "fisheries": {
      "advisory": [
        "कटला, रोहू, नैन प्रजातियों के मछली के बीज और सिल्वर कार्प और ग्रास कार्प मछली प्रजातियों के मछली के बीज वर्तमान में उत्तर प्रदेश मत्स्य विकास निगम और निजी क्षेत्र में उपलब्ध हैं, इसलिए मछली किसानों को जिला कार्यालय से संपर्क करना चाहिए और मछली के बीज एकत्र करने चाहिए। यह मछली रखने का सबसे अच्छा समय है।",
        "मछली के विकास के लिए, पूरक का उपयोग मछली के वजन के 4 से 2 प्रतिशत पर किया जाना चाहिए। मछली को यथासंभव लंबे समय तक एक ही स्थान पर खिलाया जाना चाहिए।",
        "बरसात के मौसम में तालाब के जलीय पौधों को खत्म करना आवश्यक है। यह पौधा तालाब में उपलब्ध पोषक तत्वों का दोहन करता है।"
      ]
    },
    "sericulture": {
      "advisory": [
        "चूँकि शहतूत क्षेत्र में मानसून वाणिज्यिक फसलों का कीट प्रबंधन प्रगति पर है, इसलिए कीट नियंत्रकों को सलाह दी जाती है कि वे कीटों के संक्रमण को रोकने के लिए कीटों को खिलाने से 30 मिनट पहले कीटों पर वेटर या आर. के. ओ. का छिड़काव करें। आवश्यक तापमान और आर्द्रता बनाए रखें।",
        "कीटनाशक ट्रे में रेशम के कीड़ों को सही ढंग से फैलाएं और सफाई जाल का उपयोग करके उन्हें दूसरी ट्रे में स्थानांतरित करके साफ करें।",
        "शरद ऋतु फसल शहतूत रेशम पहेली 20 से 25 सितंबर के बीच शुरू होने वाली है, इस उद्देश्य के लिए कीट नियंत्रण भवनों, कीट नियंत्रण ट्रे, कीट नियंत्रण रैक, चॉपिंग बोर्ड, नेट फीडिंग स्टैंड आदि जैसे उपकरणों को 5 प्रतिशत ब्लीचिंग पाउडर घोल या 1 प्रतिशत क्लोरीन डाइऑक्साइड (सैनिटेक) से साफ किया जाना चाहिए और कीट नियंत्रण भवन को 40 किलोग्राम चूने के घोल में 200 ग्राम ब्लीचिंग पाउडर मिलाकर सावधानीपूर्वक साफ किया जाना चाहिए।"
      ]
    },
    "forestry": {
      "advisory": [
        "रोपण के बाद मर चुके पौधों के स्थान पर अंतराल भरना चाहिए।"
      ]
    }
  },
  "date": "05-09-2024"
}