{
  "names_of_crops": [
    "paddy",
    "maize",
    "soybean",
    "sesame",
    "sugarcane",
    "groundnut",
    "tur",
    "urd-moong",
    "toria",
    "vegetable",
    "horticulture",
    "animal husbandry",
    "fisheries",
    "sericulture",
    "forestry"
  ],
  "general_advisory": "In the present context of weather in the state, farmers are given the following tips for agricultural management for the next two weeks: - Maintain sufficient moisture for proper plant growth in areas of low rainfall, especially in the case of paddy stubble and wheat formation, so that cracks do not form in the soil. Paddy crop suffers more damage from weeds in the early stages (20-30 days). Pay special attention to weed control. For weed control, do weeding and use a pedicider as much as possible; if not controlled, use herbicides as recommended. Excessive temperature and humidity in the environment will lead to diseases and pests in the crops, hence eco-friendly measures for pest control such as photosynthesis, bird percher, pheromone traps, trichogramma, and diseases. Use Trichoderma for control. In water-logged areas, top dressing of paddy should be done after mixing one-fourth cow dung manure in soil twice the amount of urea and keeping it for 24 hours before top dressing. By doing this, the yerria will not be destroyed by the leak. Natural and organic farming should be promoted, agrochemicals should be used on scientific advice only as recommended.",
  "crops_data": {
    "paddy": {
      "advisory": [
        "Paddy cultivation",
        "Do the first topdressing on the 25-30 day after 0 seedlings and the second topdressing on the 45-50 day with urea for one-fourth of the remaining amount of nitrogen. Particular care should be taken to ensure that sufficient moisture is available in the field when top-dressing urea. For control of 0 hybrid, broadleaf, and moth weeds, Bispiribac sodium 40% SC0.20 was taken in moist conditions on the 20-22 day after planting. It is per. 500 L. Dissolve in water and strain."
      ]
    },
    "maize": {
      "advisory": [
        "Maize cultivation",
        "* Give one-fourth of the total recommended amount of nitrogen as top dressing on the day after maize sowing (silking stage). Stem borer in maize. Carbofuran 3g 20 kg in the presence of 0 dead cabbage. or dimethoate 30% EC 4.0 L. It is per. Or cunnalfas 25 per cent e.c. 50 l. This is the copy. Sprinkle by dissolving in boiling / 500-600 litre water."
      ]
    },
    "soybean": {
      "advisory": [
        "Soybean cultivation",
        "In case of outbreak of leaf borer insect, sap and girdle beetle in soybean crop, spray Caenulfas 25EC 4.5 litres or Ethion 50EC 4.5 litres diluted in 500 litres of water."
      ]
    },
    "sesame": {
      "advisory": [
        "Sesame cultivation",
        "In case of infestation of hives in sesame seeds (Vihara hairy caterpillar), destroy the eggs in the initial stage by breaking them along with the leaves and putting them in kerosene-containing water or spray by dissolving quinalphas 25EC in 5 litres of water."
      ]
    },
    "sugarcane": {
      "advisory": [
        "Sugarcane cultivation",
        "Plant trichocards containing 50,000 Trichogramma eggs at 8 to 10 sites per hectare for biological control of pests. Cut the cards into pieces and attach them to the lower surface of the strips. Repeat this at 10-day intervals."
      ]
    },
    "groundnut": {
      "advisory": [
        "Groundnut cultivation",
        "On the 30-35 day after sowing groundnut, do weed control by doing another weeding and keep on doing light tillage. Do not weed during pegging. Irrigation must be done during if there are drought conditions. Peanuts are prone to severe rot and ticks, so be careful."
      ]
    },
    "tur": {
      "advisory": [
        "Tur cultivation 0 In case of delay in sowing due to floods or incessant rains in eastern Uttar Pradesh, first of September."
      ]
    },
    "urd-moong": {
      "advisory": [
        "Urd-Moong cultivation",
        "The farmers who have not been able to sow Urad yet due to some reasons, they should complete the sowing of Shekhar-4, Shekhar-2 and Shekhar-3 in this month."
      ]
    },
    "toria": {
      "advisory": [
        "Toria cultivation",
        "Make advance arrangements for seeds of varieties Ta-9, PT-303 recommended for entire UP, Type-36 recommended for Bhavani Central UP and PT-30 recommended for Terai region so that it can be sown in the first fortnight of September."
      ]
    },
    "vegetable": {
      "advisory": [
        "Vegetable cultivation",
        "Sow cabbage, medium-sized cauliflower, capsicum, tomatoes, etc. in the nursery for sowing and transplant the pre-sown seedlings."
      ]
    },
    "horticulture": {
      "advisory": [
        "horticulture",
        "Make proper drainage arrangements in the gardens. Complete the plantation of new orchards of progressive varieties of mango, guava, amla, litchi and lemon as soon as possible and replace the plants that have died due to some reason in the previously planted orchards. Potatoes, chillies, tomatoes, cauliflower and gladiolus can be grown as intercrops for higher returns in the first 10 years of a mango orchard."
      ]
    },
    "animal husbandry": {
      "advisory": [
        "Animal husbandry",
        "Currently, vaccination for Foot and Mouth Disease (FMD) and Broomelosis is being done in all the veterinary hospitals till 30th August. Ensure vaccination in animals. Protect small animals such as sheep and goats from waterlogged areas. Sheep gain weight due to being soaked in water and are unable to sit up, which weakens their leg muscles and increases their risk of pneumonia."
      ]
    },
    "fisheries": {
      "advisory": [
        "Fisheries",
        "silk",
        "Fish seeds of katla, rohu, nain, silver carp and grass carp are available at all hatcheries and departmental fish farms. Fishermen should store fish seeds in their ponds. Use lime in the pond for water quality. From the point of view of fertilization, lime is suitable for use at 250 km / ha. This fish is also helpful in disease control."
      ]
    },
    "sericulture": {
      "advisory": [
        "Farmers interested in sericulture should contact their nearest sericulture officer. Get information by contacting the person in charge and perform pest control.",
        "Mulberry monsoon crop is starting from the first week of September and Eri monsoon crop from the second week of September. For this, the insect keeper should complete all the necessary preparations such as purification, etc. in time. The pest management building and equipment should be disinfected by spraying 2% formalin solution and after disinfection, the pest management building should be closed for 24 hours."
      ]
    },
    "forestry": {
      "advisory": [
        "Forestry 0 Complete the plantation work as soon as possible."
      ]
    }
  },
  "date": "22-08-2024"
}