{
  "names_of_crops": [
    "गेहूं",
    "मक्का",
    "जायद",
    "गन्ना",
    "दलहन",
    "सब्जियाँ",
    "बागवानी",
    "पशुपालन",
    "पोल्ट्री",
    "मत्स्य पालन"
  ],
  "general_advisory": "राज्य में वर्तमान मौसम की स्थिति में, किसानों को अगले दो हफ्तों के लिए अपनी कृषि प्रबंधन करनी होगी। निम्नलिखित सिफारिशें की जाती हैं: - पर्यावरण और पोषक तत्वों को संरक्षित करने के लिए, किसानों को गेहूं की कटाई के बाद फसल अवशेष को कभी भी नहीं जलाना चाहिए बल्कि इसे खेत में अपघटित करके मिट्टी की उर्वरता बढ़ानी चाहिए। गेहूं के अवशेष को अपघटित करने के लिए, 5 टन प्रति हेक्टेयर की दर से गोबर की खाद का प्राथमिकता के आधार पर प्रयोग करें। यदि गोबर की खाद उपलब्ध नहीं है, तो 20 किग्रा। /. अतिरिक्त नाइट्रोजन या 2.5 किग्रा। मिट्टी या रेत के साथ ट्राइकोडर्मा बिरडी मिलाएं और जुताई से पहले इसे खेत में डालें। गर्मियों में खेत की गहरी जुताई करें। मिट्टी का परीक्षण कराएं और केवल सिफारिश के अनुसार उर्वरकों का उपयोग करें। धान रोपण क्षेत्रों में, जितनी जल्दी हो सके हांछा या हेनना को हाती खाद के लिए बोएं। कृषि विभाग के गोदामों में सभी जिलों में धान के बीज उपलब्ध हैं। तने का सड़ना, जड़ का सड़ना, जलना, भूरे धब्बे, मुँहासे, जीवाणु जलना, खमीर आदि जैसी मृदा-जनित बीमारियों से सुरक्षा के लिए, ट्राइकोर्डिया बविरिडी 4% डब्ल्यूपी या ट्राइकोर्डरिया 2% डब्ल्यूपी 2.5 किग्रा पर बेची जाती है। यह प्रति 65-75 किग्रा। शिट ब्लाइट, झूठे बॉलवर्म आदि जैसी बीमारियों की रोकथाम को सड़े हुए गोबर की खाद के साथ हल्के पानी के मिश्रण को छिड़ककर और इसे 8-40 दिनों तक छाया में रखकर और फिर बुवाई से पहले अंतिम जुताई पर मिट्टी में मिलाकर किया जा सकता है। दीमक, सफेद गिर्द, निमेटोड्स, जड़ सड़न, कटवर्म आदि से बचाव के लिए वुबेरिया बेसियाना 2.5 किग्रा प्रतिशत डब्ल्यूपी है। 65-75 की दर से किग्रा / हे। गोबर की खाद के साथ हल्के पानी के मिश्रण को छिड़कने और इसे 8 से 40 दिनों तक छाया में रखने के बाद, अंतिम जुताई के समय खेतों में मिलाकर भूमि का उपचार करना चाहिए। पर्याप्त नमी बनाए रखने के लिए उरद, मूंग, और गन्ने की फसलों और लीची और आम के बागों की आवश्यकता के अनुसार सिंचाई जारी रखें। 20 मई से धान की लंबी अवधि वाली किस्मों के लिए बीज बोना सुनिश्चित करें।",
  "crops_data": {
    "wheat": {
      "advisory": [
        "पर्यावरण और पोषक तत्वों को संरक्षित करने के लिए, किसानों को गेहूं की फसल की कटाई के बाद अवशेषों को जलाना नहीं चाहिए बल्कि उसे खेत में सड़ाकर मिट्टी की उर्वरता बढ़ानी चाहिए।",
        "गेहूं के अवशेषों को सड़ाने के लिए, प्राथमिकता के आधार पर 5 टन/हेक्टेयर की दर से गोबर की खाद डालें।",
        "यदि गोबर की खाद उपलब्ध नहीं है, तो 20 किग्रा अतिरिक्त नाइट्रोजन या 2.5 किग्रा का उपयोग करें।",
        "ट्राइकोडर्मा बर्डी को मिट्टी या रेत के साथ मिलाएं और जुताई से पहले इसे खेत में डालें।"
      ]
    },
    "maize": {
      "advisory": [
        "अच्छी उपज प्राप्त करने के लिए, मक्का की देर से पकने वाली संकर किस्मों जैसे गंगा-7, सरताज, HQ, PM-5, HQ, PM-8, प्रो-36 (4640), बायो-968, Y-402, PSC-740, NMH-920, सीडटेक-740, NMH-713 और मिश्रित किस्म प्रभात आदि के बीजों का प्रबंध कर बोना चाहिए।",
        "यदि बीज का उपचार नहीं हुआ है, तो बोने से पहले पहले 4 किग्रा बीज को 2.5 ग्राम थिरम या 2 ग्राम कार्बेंडाजिम 50 WP के साथ उपचारित करना चाहिए और इसके बाद बीज को इमिडाक्लोप्रिड 2 ग्राम/किग्रा के साथ उपचारित करना चाहिए।"
      ]
    },
    "zaid crops": {
      "advisory": [
        "मूंग की फसल पर काले पंखों वाले सफेद रंग के पतंगे का आक्रमण देखा जा रहा है। इसके शरीर के प्रत्येक खंड पर काले धब्बे देखे जा सकते हैं।",
        "फसल की सुरक्षा के लिए, 5% नीम के तेल का घोल बनाएं और इसे सप्ताह में 2 बार या 2-45 दिनों के अंतराल पर शाम को 2 बार फसल पर छिड़कें। इसमें 5% इमामेक्टिन बेंज़ोएट 5% SG की 5% ग्राम मात्रा को 2 लीटर पानी में मिलाएं।",
        "जैसे ही उड़द/मूंग की फसल में पीला मोज़ेक रोग दिखाई दे, प्रभावित पौधों को सावधानीपूर्वक उखाड़कर नष्ट (जला/दफना) देना चाहिए।"
      ]
    },
    "sugarcane": {
      "advisory": [
        "किसान को गन्ने की सिंचाई 72-75 दिन के अंतराल पर करनी चाहिए।",
        "सिंचाई के बाद जब जई निकल आए, तो सबसे पहले उन्हें नाइट्रोजन से टॉपड्रेस करें और गूंथ लें।",
        "नाइट्रोजन टॉपड्रेसिंग के लिए, पर्याप्त नमी की स्थिति में गन्ने की कतारों के पास 425 किग्रा यूरिया/हेक्टेयर की दर से लगाएं।"
      ]
    },
    "pulses": {
      "advisory": [
        "बड़े जानवरों को काली खांसी की रोकथाम के लिए HS वैक्सीन और काली खांसी की रोकथाम के लिए BQ वैक्सीन से टीका लगवाएं। यह सुविधा सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "सुअर बुखार का टीका सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "जानवरों को धूप से बचाने के लिए उन्हें दोपहर में छायादार जगह पर बांधें और केवल सुबह और शाम को चरने दें।"
      ]
    },
    "vegetables": {
      "advisory": [
        "शाकीय सब्जियों में फल मक्खी के प्रकोप पर आजादी शक्ति (नीम का तेल) 0.15% EC 2.50 लीटर का उपयोग करें। 500 से 600 की मात्रा को पानी में घोलकर 10 से 45 दिनों के अंतराल पर आवश्यकता अनुसार छिड़काव करें।",
        "फल मक्खियों से शाकीय फसलों की रक्षा के लिए क्यू-लुर फेरोमोन ट्रैप को 8 से 10 ट्रैप प्रति हेक्टेयर की दर से लगाएं।",
        "मिर्च में पत्तियों के झड़ने और मोज़ेक वायरस रोग की संभावना अधिक होती है।"
      ]
    },
    "horticulture": {
      "advisory": [
        "आवश्यकतानुसार आम और लीची के बगीचों को नम रखें।",
        "आम में फंगल/फफूंद कीटों की रोकथाम के लिए, इमिडाक्लोप्रिड 30.5% SC नामक कीटनाशक की 4 से 2 मिलीलीटर मात्रा का उपयोग करें। पानी में घोल बनाकर पत्तियों पर छिड़काव करें।",
        "आम की आंतरिक सड़न रोग को नियंत्रित करने के लिए, 6 से 8 ग्राम बोरेक्स तत्व की मात्रा को पानी में घोल बनाकर पहले छिड़काव करें।"
      ]
    },
    "animal husbandry": {
      "advisory": [
        "बड़े जानवरों को खुरपका-मुंहपका रोग की रोकथाम के लिए HS वैक्सीन और गलघोटू की रोकथाम के लिए BQ वैक्सीन से टीका लगवाएं। यह सुविधा सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "सुअर बुखार का टीका सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "जानवरों को धूप से बचाने के लिए, उन्हें दोपहर में छायादार जगह पर बांधें और केवल सुबह और शाम को चरने दें।"
      ]
    },
    "poultry": {
      "advisory": [
        "खुरपका-मुंहपका रोग की रोकथाम के लिए बड़े जानवरों को HS वैक्सीन और गलघोटू की रोकथाम के लिए BQ वैक्सीन से टीका लगवाएं। यह सुविधा सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "सुअर बुखार का टीका सभी पशु चिकित्सालयों में निःशुल्क उपलब्ध है।",
        "जानवरों को धूप से बचाने के लिए, उन्हें दोपहर में छायादार जगह पर बांधें और केवल सुबह और शाम को चरने दें।"
      ]
    },
    "fisheries": {
      "advisory": [
        "तालाबों का जल स्तर 5 से 5.5 फीट तक बनाए रखना चाहिए।",
        "मछली के विकास के लिए, प्रोत्साहक का मछली के वजन के 4 से 2 प्रतिशत का उपयोग किया जाना चाहिए।",
        "जातियों (सामान्य कार्प मछलियों के प्रजनन के दृष्टिकोण में डर) को अलग किया जाना चाहिए और उनका विशेष पोषण सुनिश्चित किया जाना चाहिए।"
      ]
    }
  },
  "data": "09-05-2024"
}
