{
  "weather_details": {
    "19/10/2024": {
      "rainfall": 5,
      "t_max": 35,
      "t_min": 25,
      "rh_max": 92,
      "rh_min": 65,
      "wind_speed": 6,
      "wind_direction": 326,
      "cloud_cover": 4
    },
    "20/10/2024": {
      "rainfall": 2,
      "t_max": 35,
      "t_min": 24,
      "rh_max": 92,
      "rh_min": 62,
      "wind_speed": 9,
      "wind_direction": 325,
      "cloud_cover": 5
    },
    "21/10/2024": {
      "rainfall": 5,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 86,
      "rh_min": 61,
      "wind_speed": 6,
      "wind_direction": 355,
      "cloud_cover": 4
    },
    "22/10/2024": {
      "rainfall": 10,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 83,
      "rh_min": 55,
      "wind_speed": 12,
      "wind_direction": 1,
      "cloud_cover": 6
    },
    "23/10/2024": {
      "rainfall": 0,
      "t_max": 34,
      "t_min": 24,
      "rh_max": 85,
      "rh_min": 52,
      "wind_speed": 6,
      "wind_direction": 8,
      "cloud_cover": 6
    }
  },
  "names_of_crops": [
    "paddy",
    "maize",
    "sugarcane",
    "cotton",
    "black gram",
    "green gram",
    "onion",
    "bitter gourd",
    "brinjal",
    "sheep",
    "goats"
  ],
  "general_advisory": "For better agricultural benefits use OUAT KALINGA Value Added Products, Fingerlings/ Yearlings, VermiCompost, and Farm Implements. IMD Weather forecast and Agro-meteorological advisory of Odisha location is now available on Meghdoot.",
  "crops_data": {
    "paddy": {
      "advisory": [
        "False smut: False smut disease may be seen in paddy field. To manage the same, spray Propiconazole or Copper oxychloride.",
        "Neck Blast: To control Neck Blast diseases, first drain out excess water from the paddy field. Spray Hexaconazole or Azoxystrobin+ Difenoconazole."
      ]
    },
    "maize": {
      "advisory": [
        "Top dressing of fertilizer for maize crop has started."
      ]
    },
    "sugarcane": {
      "advisory": [
        "Sugarcane is at grand growth stage."
      ]
    },
    "cotton": {
      "advisory": [
        "Cotton crop is in boll formation stage."
      ]
    },
    "black gram": {
      "advisory": [
        "Pod Borer Management: There are chances of Pod borer infestation in black gram crop. To manage, spray Emamectin Benzoate or Chlorantraniliprole."
      ]
    },
    "green gram": {
      "advisory": [
        "Pod Borer Management: There are chances of Pod borer infestation in green gram crop. To manage Bihar hairy caterpillar, spray Emamectin Benzoate or Profenophos."
      ]
    },
    "onion": {
      "advisory": [
        "Pre-sowing stage: Before sowing of seeds, seed treatment should be done with Carbendazim or Carboxin + Thiram."
      ]
    },
    "bitter gourd": {
      "advisory": [
        "Fruiting and Harvesting: To manage the infestation of Fruit flies, spray Malathion. To control the Powdery mildew disease, spray Dinocap or Carbendazim."
      ]
    },
    "brinjal": {
      "advisory": [
        "Flowering/Fruiting: The plants showing wilting symptoms can be uprooted/destroyed away from the field.",
        "Phomopsis blight: To reduce the Phomopsis blight disease in brinjal, spray Metalaxyl + Mancozeb or Zineb."
      ]
    },
    "sheep": {
      "advisory": [
        "Liver fluke infestation in sheep: Liver Fluke is a great enemy of Sheep. Infestation of this worm can be controlled by using specific drugs or by duck rearing."
      ]
    },
    "goats": {
      "advisory": [
        "Liver fluke infestation in goats: Liver Fluke is a great enemy of Goats. Infestation of this worm can be controlled by using specific drugs or by duck rearing."
      ]
    }
  },
  "date": "18-10-2024"
}