{
  "weather_details": {
    "03/04/2024": {
      "rainfall": 0,
      "t_max": 41,
      "t_min": 26,
      "rh_max": 46,
      "rh_min": 11,
      "wind_speed": 8,
      "wind_direction": 288,
      "cloud_cover": 0
    },
    "04/04/2024": {
      "rainfall": 0,
      "t_max": 41,
      "t_min": 26,
      "rh_max": 63,
      "rh_min": 10,
      "wind_speed": 7,
      "wind_direction": 198,
      "cloud_cover": 1
    },
    "05/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 53,
      "rh_min": 16,
      "wind_speed": 9,
      "wind_direction": 207,
      "cloud_cover": 1
    },
    "06/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 51,
      "rh_min": 12,
      "wind_speed": 9,
      "wind_direction": 165,
      "cloud_cover": 1
    },
    "07/04/2024": {
      "rainfall": 0,
      "t_max": 42,
      "t_min": 27,
      "rh_max": 35,
      "rh_min": 8,
      "wind_speed": 10,
      "wind_direction": 202,
      "cloud_cover": 2
    }
  },
  "names_of_crops": [
    "paddy",
    "sugarcane",
    "maize",
    "tomato",
    "brinjal",
    "coconut",
    "vegetables",
    "fingerlings",
    "black gram",
    "green gram",
    "blast disease",
    "tobacco caterpillar",
    "early shoot borer",
    "okra",
    "whitefly infestation",
    "onion",
    "mango",
    "mango hopper"
  ],
  "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. Cover the rows with dry leaves in Sugarcane. Apply sprinkler irrigation to bring down the heat effect. Mulch coconut leaves to reduce water loss. Harvest fingerlings if water temperature rises to 30°C. Yellow stem borer management is crucial in paddy. Blast disease management recommendations. Tobacco caterpillar management in black gram and green gram. Early shoot borer management in Sugarcane. Brinjal shoot and fruit borer control strategies. Whitefly infestation prevention in okra. Onion harvesting and storage advice. Mango hopper control methods.",
  "crops_data": {
    "paddy": {
      "advisory": [
        "Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages in paddy. Water deficit during these stages should be avoided. Yellow stem borer management is crucial in paddy. Blast disease management recommendations."
      ]
    },
    "sugarcane": {
      "advisory": [
        "Irrigate the crop frequently during hot months to manage early shoot borer. Cut the attacked shoot at or just below the ground level. Apply Fipronil 0.3% GR at the time of first earthing up."
      ]
    },
    "maize": {
      "advisory": [
        "High temperature increases the water requirement of maize crop. Irrigate the crop and avoid stagnant water in the field."
      ]
    },
    "tomato": {
      "advisory": [
        "High temperature may lead to wilting in tomato. Apply Streptocyclin in the root zone."
      ]
    },
    "brinjal": {
      "advisory": [
        "Install pheromone trap for brinjal shoot and fruit borer. Use neem-based pesticide and chemical control as needed."
      ]
    },
    "coconut": {
      "advisory": [
        "Mulch coconut leaves around the tree to reduce water loss."
      ]
    },
    "vegetables": {
      "advisory": [
        "Cover newly planted vegetable seedlings with paper caps during the day."
      ]
    },
    "fingerlings": {
      "advisory": [
        "Harvest fingerlings from shallow ponds if water temperature rises to 30°C."
      ]
    },
    "black gram": {
      "advisory": [
        "Check the migration of caterpillars in black gram. Use dusting and chemical control as needed."
      ]
    },
    "green gram": {
      "advisory": [
        "Check the migration of caterpillars in green gram. Use dusting and chemical control as needed."
      ]
    },
    "blast disease": {
      "advisory": [
        "Management recommendations for blast disease."
      ]
    },
    "tobacco caterpillar": {
      "advisory": [
        "Management recommendations for tobacco caterpillar."
      ]
    },
    "early shoot borer": {
      "advisory": [
        "Management recommendations for early shoot borer."
      ]
    },
    "okra": {
      "advisory": [
        "Treat okra seeds with Imidacloprid before sowing. Install yellow sticky traps to prevent whitefly infestation."
      ]
    },
    "whitefly infestation": {
      "advisory": [
        "Prevent whitefly infestation in okra by treating seeds and using yellow sticky traps."
      ]
    },
    "onion": {
      "advisory": [
        "Harvest onion and store properly for longer periods."
      ]
    },
    "mango": {
      "advisory": [
        "Control mango hoppers by spraying recommended insecticides."
      ]
    },
    "mango hopper": {
      "advisory": [
        "Control mango hoppers by applying recommended insecticides."
      ]
    }
  },
  "date": "02-04-2024"
}