{
  "weather_details": {
    "07-09-2024": {
      "rainfall": 15,
      "t_max": 30,
      "t_min": 25,
      "rh_max": 93,
      "rh_min": 65,
      "wind_speed": 7,
      "wind_direction": 248,
      "cloud_cover": 7
    },
    "08-09-2024": {
      "rainfall": 15,
      "t_max": 30,
      "t_min": 25,
      "rh_max": 94,
      "rh_min": 67,
      "wind_speed": 9,
      "wind_direction": 283,
      "cloud_cover": 7
    },
    "09-09-2024": {
      "rainfall": 20,
      "t_max": 29,
      "t_min": 24,
      "rh_max": 96,
      "rh_min": 76,
      "wind_speed": 13,
      "wind_direction": 283,
      "cloud_cover": 8
    },
    "10-09-2024": {
      "rainfall": 25,
      "t_max": 29,
      "t_min": 24,
      "rh_max": 94,
      "rh_min": 74,
      "wind_speed": 16,
      "wind_direction": 257,
      "cloud_cover": 8
    },
    "11-09-2024": {
      "rainfall": 15,
      "t_max": 30,
      "t_min": 25,
      "rh_max": 94,
      "rh_min": 78,
      "wind_speed": 14,
      "wind_direction": 252,
      "cloud_cover": 7
    }
  },
  "names_of_crops": [
    "direct seeded paddy",
    "transplanted paddy",
    "cotton",
    "arhar",
    "hybrid maize",
    "brinjal",
    "chilli",
    "tomato",
    "cow & buffalo",
    "goat & sheep",
    "poultry"
  ],
  "general_advisory": "As per extended range of forecast received from IMD, fairly widespread rain/thundershower is very likely over districts of Odisha during the week-1 (6th - 12th September, 2024) with isolated heavy rainfall very likely in the districts of South Odisha on 6th Sept; isolated heavy to very heavy rainfall very likely in the districts of South Odisha on 7th Sept; isolated heavy to very heavy rainfall very likely in the districts of Central Odisha on 8th Sept, heavy rainfall very likely over the districts of north Odisha on 9th and 10th Sept. Scattered to fairly widespread rain/thundershower very likely in the district of Odisha state during week 2 (13th - 19th September, 2024). In view of five days weather forecast received from IMD, farmers are advised to withhold application of fertilizers and plant protection chemicals for the time being. Apply balanced and appropriate fertilizers according to crop’s growth stage. Avoid excess nitrogen as it promotes excessive vegetative growth and increase water demand. Always consider an integrated approach of preventive measures together with biological treatment if available to protect the crop from pests. Extensive insecticide use can lead to resistance in the pest. To prevent this, ensure proper rotation between insecticides and use mixtures. Use light trap to monitor insect population so that timely control measure can be taken. SMS Advisory: Apply Urea @ 25kg/ac if crop is at tasseling stage (9 week) in Maize.",
  "crops_data": {
    "direct seeded paddy": {
      "advisory": [
        "Farmers are advised to spray of leaf extracts of Bael, Tulsi, or Neem per litre of water for reducing the incidence of insects & diseases.",
        "Current weather is favorable for blast infestation in paddy fields."
      ]
    },
    "transplanted paddy": {
      "advisory": [
        "Install Pheromone traps to monitor population of pests.",
        "In stem borer endemic areas, release egg parasitoid Trichogramma japonicum @ 60000 eggs/acre."
      ]
    },
    "cotton": {
      "advisory": [
        "Apply plant hormone Planofix for improving seed cotton yield.",
        "Apply total killer herbicide glyphosate or Glufosinate Ammonium to control weeds."
      ]
    },
    "arhar": {
      "advisory": [
        "To control leaf webber infestation, spray Profenophos or Chlorpyriphos.",
        "Monitor field regularly for signs of pest infestation."
      ]
    },
    "hybrid maize": {
      "advisory": [
        "Apply Urea if crop is at tasseling stage.",
        "Monitor the field regularly for pest infestation."
      ]
    },
    "brinjal": {
      "advisory": [
        "Install yellow sticky traps to monitor sucking pests.",
        "Spray Tebuconazole to manage wilting."
      ]
    },
    "chilli": {
      "advisory": [
        "Install Blue sticky traps to monitor thrips infestation.",
        "Spray neem based pesticide at initial stage of thrips infestation."
      ]
    },
    "tomato": {
      "advisory": [
        "Raise tomato seedlings using suitable varieties.",
        "Provide balanced concentrate to livestock prior to kidding/lambing."
      ]
    },
    "cow & buffalo": {
      "advisory": [
        "Give concentrate to dairy animals due to high moisture content in grasses."
      ]
    },
    "goat & sheep": {
      "advisory": [
        "Keep dry fodder and balanced concentrate ready for sheep/goat.",
        "Flush sheep/goat one month prior to kidding/lambing."
      ]
    },
    "poultry": {
      "advisory": [
        "Clean poultry houses daily during bird flu outbreak.",
        "Avoid bringing poultry birds or eggs from bird flu affected areas."
      ]
    }
  },
  "date": "06-09-2024"
}